qsDataAnalysisApp.controller("addQsscDataCtrl",
    ["$scope", "$http", "$rootScope", "$state", "$interval", "ScscInstance",
        function ($scope, $http, $rootScope, $state, $interval, ScscInstance) {
            $rootScope.showChang = false;
            $rootScope.bigTitle = "添加科技园"

            $scope.isSubmitReview = false;

            $scope.division = {
                "四川省": {
                    "成都市": ["锦江区", "青羊区", "金牛区", "武侯区", "成华区", "龙泉驿区", "青白江区", "新都区", "温江县", "金堂县", "双流县", "郫县", "大邑县", "蒲江县", "新津县", "都江堰市", "彭州市", "邛崃市", "崇州市"],
                    "自贡市": ["自流井区", "贡井区", "大安区", "沿滩区", "荣县", "富顺县"],
                    "攀枝花市": ["东区", "西区", "仁和区", "米易县", "盐边县"],
                    "泸州市": ["江阳区", "纳溪区", "龙马潭区", "泸县", "合江县", "叙永县", "古蔺县"],
                    "德阳市": ["旌阳区", "中江县", "罗江县", "广汉市", "什邡市", "绵竹市"],
                    "绵阳市": ["涪城区", "游仙区", "三台县", "盐亭县", "安县", "梓潼县", "北川羌族自治县", "平武县", "江油市"],
                    "广元市": ["市中区", "元坝区", "朝天区", "旺苍县", "青川县", "剑阁县", "苍溪县"],
                    "遂宁市": ["船山区", "安居区", "蓬溪县", "射洪县", "大英县"],
                    "内江市": ["市中区", "东兴区", "威远县", "资中县", "隆昌县"],
                    "乐山市": ["市中区", "沙湾区", "五通桥区", "金口河区", "犍为县", "井研县", "夹江县", "沐川县", "峨边彝族自治县", "马边彝族自治县", "峨眉山市"],
                    "南充市": ["顺庆区", "高坪区", "嘉陵区", "南部县", "营山县", "蓬安县", "仪陇县", "西充县", "阆中市"],
                    "眉山市": ["东坡区", "仁寿县", "彭山县", "洪雅县", "丹棱县", "青神县"],
                    "宜宾市": ["翠屏区", "宜宾县", "南溪县", "江安县", "长宁县", "高县", "珙县", "筠连县", "兴文县", "屏山县"],
                    "广安市": ["广安区", "岳池县", "武胜县", "邻水县", "华莹市"],
                    "达州市": ["通川区", "达县", "宣汉县", "开江县", "大竹县", "渠县", "万源市"],
                    "雅安市": ["雨城区", "名山县", "荥经县", "汉源县", "石棉县", "天全县", "芦山县", "宝兴县"],
                    "巴中市": ["巴州区", "通江县", "南江县", "平昌县"],
                    "资阳市": ["雁江区", "安岳县", "乐至县", "简阳市"],
                    "阿坝藏族羌族自治州": ["汶川县", "理县", "茂县", "松潘县", "九寨沟县", "金川县", "小金县", "黑水县", "马尔康县", "壤塘县", "阿坝县", "若尔盖县", "红原县"],
                    "甘孜藏族自治州": ["康定县", "泸定县", "丹巴县", "九龙县", "雅江县", "道孚县", "炉霍县", "甘孜县", "新龙县", "德格县", "白玉县", "石渠县", "色达县", "理塘县", "巴塘县", "乡城县", "稻城县", "得荣县"],
                    "凉山彝族自治州": ["西昌市", "木里藏族自治县", "盐源县", "德昌县", "会理县", "会东县", "宁南县", "普格县", "布拖县", "金阳县", "昭觉县", "喜德县", "冕宁县", "越西县", "甘洛县", "美姑县", "雷波县"]
                },
                "北京市": {"北京市": ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县"]},
                "上海市": {"上海市": ["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "南汇区", "奉贤区", "崇明县"]},
                "天津市": {"天津市": ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河县", "静海县", "蓟县"]},
                "重庆市": {"重庆市": ["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "黔江区", "长寿区", "綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠县", "开县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县", "江津市", "合川市", "永川市", "南川市"]},

                "贵州省": {
                    "贵阳市": ["南明区", "云岩区", "花溪区", "乌当区", "白云区", "小河区", "开阳县", "息烽县", "修文县", "清镇市"],
                    "六盘水市": ["钟山区", "六枝特区", "水城县", "盘县"],
                    "遵义市": ["红花岗区", "汇川区", "遵义县", "桐梓县", "绥阳县", "正安县", "道真仡佬族苗族自治县", "务川仡佬族苗族自治县", "凤冈县", "湄潭县", "余庆县", "习水县", "赤水市", "仁怀市"],
                    "安顺市": ["西秀区", "平坝县", "普定县", "镇宁布依族苗族自治县", "关岭布依族苗族自治县", "紫云苗族布依族自治县"],
                    "铜仁地区": ["铜仁市", "江口县", "玉屏侗族自治县", "石阡县", "思南县", "印江土家族苗族自治县", "德江县", "沿河土家族自治县", "松桃苗族自治县", "万山特区"],
                    "黔西南布依族苗族自治州": ["兴义市", "兴仁县", "普安县", "晴隆县", "贞丰县", "望谟县", "册亨县", "安龙县"],
                    "毕节地区": ["毕节市", "大方县", "黔西县", "金沙县", "织金县", "纳雍县", "威宁彝族回族苗族自治县", "赫章县"],
                    "黔东南苗族侗族自治州": ["凯里市", "黄平县", "施秉县", "三穗县", "镇远县", "岑巩县", "天柱县", "锦屏县", "剑河县", "台江县", "黎平县", "榕江县", "从江县", "雷山县", "麻江县", "丹寨县"],
                    "黔南布依族苗族自治州": ["都匀市", "福泉市", "荔波县", "贵定县", "瓮安县", "独山县", "平塘县", "罗甸县", "长顺县", "龙里县", "惠水县", "三都水族自治县"]
                },
                "云南省": {
                    "昆明市": ["五华区", "盘龙区", "官渡区", "西山区", "东川区", "呈贡县", "晋宁县", "富民县", "宜良县", "石林彝族自治县", "嵩明县", "禄劝彝族苗族自治县", "寻甸回族彝族自治县", "安宁市"],
                    "曲靖市": ["麒麟区", "马龙县", "陆良县", "师宗县", "罗平县", "富源县", "会泽县", "沾益县", "宣威市"],
                    "玉溪市": ["红塔区", "江川县", "澄江县", "通海县", "华宁县", "易门县", "峨山彝族自治县", "新平彝族傣族自治县", "元江哈尼族彝族傣族自治县"],
                    "保山市": ["隆阳区", "施甸县", "腾冲县", "龙陵县", "昌宁县"],
                    "昭通市": ["昭阳区", "鲁甸县", "巧家县", "盐津县", "大关县", "永善县", "绥江县", "镇雄县", "彝良县", "威信县", "水富县"],
                    "丽江市": ["古城区", "玉龙纳西族自治县", "永胜县", "华坪县", "宁蒗彝族自治县"],
                    "思茅市": ["翠云区", "普洱哈尼族彝族自治县", "墨江哈尼族自治县", "景东彝族自治县", "景谷傣族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "江城哈尼族彝族自治县", "孟连傣族拉祜族佤族自治县", "澜沧拉祜族自治县", "西盟佤族自治县"],
                    "临沧市": ["临翔区", "凤庆县", "云县", "永德县", "镇康县", "双江拉祜族佤族布朗族傣族自治县", "耿马傣族佤族自治县", "沧源佤族自治县"],
                    "楚雄彝族自治州": ["楚雄市", "双柏县", "牟定县", "南华县", "姚安县", "大姚县", "永仁县", "元谋县", "武定县", "禄丰县"],
                    "红河哈尼族彝族自治州": ["个旧市", "开远市", "蒙自县", "屏边苗族自治县", "建水县", "石屏县", "弥勒县", "泸西县", "元阳县", "红河县", "金平苗族瑶族傣族自治县", "绿春县", "河口瑶族自治县"],
                    "文山壮族苗族自治州": ["文山县", "砚山县", "西畴县", "麻栗坡县", "马关县", "丘北县", "广南县", "富宁县"],
                    "西双版纳傣族自治州": ["景洪市", "勐海县", "勐腊县"],
                    "大理白族自治州": ["大理市", "漾濞彝族自治县", "祥云县", "宾川县", "弥渡县", "南涧彝族自治县", "巍山彝族回族自治县", "永平县", "云龙县", "洱源县", "剑川县", "鹤庆县"],
                    "德宏傣族景颇族自治州": ["瑞丽市", "潞西市", "梁河县", "盈江县", "陇川县"],
                    "怒江傈僳族自治州": ["泸水县", "福贡县", "贡山独龙族怒族自治县", "兰坪白族普米族自治县"],
                    "迪庆藏族自治州": ["香格里拉县", "德钦县", "维西傈僳族自治县"]
                },
                "西藏省": {
                    "拉萨市": ["城关区", "林周县", "当雄县", "尼木县", "曲水县", "堆龙德庆县", "达孜县", "墨竹工卡县"],
                    "昌都地区": ["昌都县", "江达县", "贡觉县", "类乌齐县", "丁青县", "察雅县", "八宿县", "左贡县", "芒康县", "洛隆县", "边坝县"],
                    "山南地区": ["乃东县", "扎囊县", "贡嘎县", "桑日县", "琼结县", "曲松县", "措美县", "洛扎县", "加查县", "隆子县", "错那县", "浪卡子县"],
                    "日喀则地区": ["日喀则市", "南木林县", "江孜县", "定日县", "萨迦县", "拉孜县", "昂仁县", "谢通门县", "白朗县", "仁布县", "康马县", "定结县", "仲巴县", "亚东县", "吉隆县", "聂拉木县", "萨嘎县", "岗巴县"],
                    "那曲地区": ["那曲县", "嘉黎县", "比如县", "聂荣县", "安多县", "申扎县", "索县", "班戈县", "巴青县", "尼玛县"],
                    "阿里地区": ["普兰县", "札达县", "噶尔县", "日土县", "革吉县", "改则县", "措勤县"],
                    "林芝地区": ["林芝县", "工布江达县", "米林县", "墨脱县", "波密县", "察隅县", "朗县"]
                },
                "河南省": {
                    "郑州市": ["中原区", "二七区", "管城回族区", "金水区", "上街区", "邙山区", "中牟县", "巩义市", "荥阳市", "新密市", "新郑市", "登封市"],
                    "开封市": ["龙亭区", "顺河回族区", "鼓楼区", "南关区", "郊区", "杞县", "通许县", "尉氏县", "开封县", "兰考县"],
                    "洛阳市": ["老城区", "西工区", "廛河回族区", "涧西区", "吉利区", "洛龙区", "孟津县", "新安县", "栾川县", "嵩县", "汝阳县", "宜阳县", "洛宁县", "伊川县", "偃师市"],
                    "平顶山市": ["新华区", "卫东区", "石龙区", "湛河区", "宝丰县", "叶县", "鲁山县", "郏县", "舞钢市", "汝州市"],
                    "安阳市": ["文峰区", "北关区", "殷都区", "龙安区", "安阳县", "汤阴县", "滑县", "内黄县", "林州市"],
                    "鹤壁市": ["鹤山区", "山城区", "淇滨区", "浚县", "淇县"],
                    "新乡市": ["红旗区", "卫滨区", "凤泉区", "牧野区", "新乡县", "获嘉县", "原阳县", "延津县", "封丘县", "长垣县", "卫辉市", "辉县市"],
                    "焦作市": ["解放区", "中站区", "马村区", "山阳区", "修武县", "博爱县", "武陟县", "温县", "济源市", "沁阳市", "孟州市"],
                    "濮阳市": ["华龙区", "清丰县", "南乐县", "范县", "台前县", "濮阳县"],
                    "许昌市": ["魏都区", "许昌县", "鄢陵县", "襄城县", "禹州市", "长葛市"],
                    "漯河市": ["源汇区", "郾城区", "召陵区", "舞阳县", "临颍县"],
                    "三门峡市": ["湖滨区", "渑池县", "陕县", "卢氏县", "义马市", "灵宝市"],
                    "南阳市": ["宛城区", "卧龙区", "南召县", "方城县", "西峡县", "镇平县", "内乡县", "淅川县", "社旗县", "唐河县", "新野县", "桐柏县", "邓州市"],
                    "商丘市": ["梁园区", "睢阳区", "民权县", "睢县", "宁陵县", "柘城县", "虞城县", "夏邑县", "永城市"],
                    "信阳市": ["师河区", "平桥区", "罗山县", "光山县", "新县", "商城县", "固始县", "潢川县", "淮滨县", "息县"],
                    "周口市": ["川汇区", "扶沟县", "西华县", "商水县", "沈丘县", "郸城县", "淮阳县", "太康县", "鹿邑县", "项城市"],
                    "驻马店市": ["驿城区", "西平县", "上蔡县", "平舆县", "正阳县", "确山县", "泌阳县", "汝南县", "遂平县", "新蔡县"]
                },
                "湖北省": {
                    "武汉市": ["江岸区", "江汉区", "乔口区", "汉阳区", "武昌区", "青山区", "洪山区", "东西湖区", "汉南区", "蔡甸区", "江夏区", "黄陂区", "新洲区"],
                    "黄石市": ["黄石港区", "西塞山区", "下陆区", "铁山区", "阳新县", "大冶市"],
                    "十堰市": ["茅箭区", "张湾区", "郧县", "郧西县", "竹山县", "竹溪县", "房县", "丹江口市"],
                    "宜昌市": ["西陵区", "伍家岗区", "点军区", "猇亭区", "夷陵区", "远安县", "兴山县", "秭归县", "长阳土家族自治县", "五峰土家族自治县", "宜都市", "当阳市", "枝江市"],
                    "襄樊市": ["襄城区", "樊城区", "襄阳区", "南漳县", "谷城县", "保康县", "老河口市", "枣阳市", "宜城市"],
                    "鄂州市": ["梁子湖区", "华容区", "鄂城区"],
                    "荆门市": ["东宝区", "掇刀区", "京山县", "沙洋县", "钟祥市"],
                    "孝感市": ["孝南区", "孝昌县", "大悟县", "云梦县", "应城市", "安陆市", "汉川市"],
                    "荆州市": ["沙市区", "荆州区", "公安县", "监利县", "江陵县", "石首市", "洪湖市", "松滋市"],
                    "黄冈市": ["黄州区", "团风县", "红安县", "罗田县", "英山县", "浠水县", "蕲春县", "黄梅县", "麻城市", "武穴市"],
                    "咸宁市": ["咸安区", "嘉鱼县", "通城县", "崇阳县", "通山县", "赤壁市"],
                    "随州市": ["曾都区", "广水市"],
                    "恩施土家族苗族自治州": ["恩施市", "利川市", "建始县", "巴东县", "宣恩县", "咸丰县", "来凤县", "鹤峰县"],
                    "省直辖行政单位": ["仙桃市", "潜江市", "天门市", "神农架林区"]
                },
                "湖南省": {
                    "长沙市": ["芙蓉区", "天心区", "岳麓区", "开福区", "雨花区", "长沙县", "望城县", "宁乡县", "浏阳市"],
                    "株洲市": ["荷塘区", "芦淞区", "石峰区", "天元区", "株洲县", "攸县", "茶陵县", "炎陵县", "醴陵市"],
                    "湘潭市": ["雨湖区", "岳塘区", "湘潭县", "湘乡市", "韶山市"],
                    "衡阳市": ["珠晖区", "雁峰区", "石鼓区", "蒸湘区", "南岳区", "衡阳县", "衡南县", "衡山县", "衡东县", "祁东县", "耒阳市", "常宁市"],
                    "邵阳市": ["双清区", "大祥区", "北塔区", "邵东县", "新邵县", "邵阳县", "隆回县", "洞口县", "绥宁县", "新宁县", "城步苗族自治县", "武冈市"],
                    "岳阳市": ["岳阳楼区", "云溪区", "君山区", "岳阳县", "华容县", "湘阴县", "平江县", "汨罗市", "临湘市"],
                    "常德市": ["武陵区", "鼎城区", "安乡县", "汉寿县", "澧县", "临澧县", "桃源县", "石门县", "津市市"],
                    "张家界市": ["永定区", "武陵源区", "慈利县", "桑植县"],
                    "益阳市": ["资阳区", "赫山区", "南县", "桃江县", "安化县", "沅江市"],
                    "郴州市": ["北湖区", "苏仙区", "桂阳县", "宜章县", "永兴县", "嘉禾县", "临武县", "汝城县", "桂东县", "安仁县", "资兴市"],
                    "永州市": ["芝山区", "冷水滩区", "祁阳县", "东安县", "双牌县", "道县", "江永县", "宁远县", "蓝山县", "新田县", "江华瑶族自治县"],
                    "怀化市": ["鹤城区", "中方县", "沅陵县", "辰溪县", "溆浦县", "会同县", "麻阳苗族自治县", "新晃侗族自治县", "芷江侗族自治县", "靖州苗族侗族自治县", "通道侗族自治县", "洪江市"],
                    "娄底市": ["娄星区", "双峰县", "新化县", "冷水江市", "涟源市"],
                    "湘西土家族苗族自治州": ["吉首市", "泸溪县", "凤凰县", "花垣县", "保靖县", "古丈县", "永顺县", "龙山县"]
                },
                "广东省": {
                    "广州市": ["东山区", "荔湾区", "越秀区", "海珠区", "天河区", "芳村区", "白云区", "黄埔区", "番禺区", "花都区", "增城市", "从化市"],
                    "韶关市": ["武江区", "浈江区", "曲江区", "始兴县", "仁化县", "翁源县", "乳源瑶族自治县", "新丰县", "乐昌市", "南雄市"],
                    "深圳市": ["罗湖区", "福田区", "南山区", "宝安区", "龙岗区", "盐田区"],
                    "珠海市": ["香洲区", "斗门区", "金湾区"],
                    "汕头市": ["龙湖区", "金平区", "濠江区", "潮阳区", "潮南区", "澄海区", "南澳县"],
                    "佛山市": ["禅城区", "南海区", "顺德区", "三水区", "高明区"],
                    "江门市": ["蓬江区", "江海区", "新会区", "台山市", "开平市", "鹤山市", "恩平市"],
                    "湛江市": ["赤坎区", "霞山区", "坡头区", "麻章区", "遂溪县", "徐闻县", "廉江市", "雷州市", "吴川市"],
                    "茂名市": ["茂南区", "茂港区", "电白县", "高州市", "化州市", "信宜市"],
                    "肇庆市": ["端州区", "鼎湖区", "广宁县", "怀集县", "封开县", "德庆县", "高要市", "四会市"],
                    "惠州市": ["惠城区", "惠阳区", "博罗县", "惠东县", "龙门县"],
                    "梅州市": ["梅江区", "梅县", "大埔县", "丰顺县", "五华县", "平远县", "蕉岭县", "兴宁市"],
                    "汕尾市": ["城区", "海丰县", "陆河县", "陆丰市"],
                    "河源市": ["源城区", "紫金县", "龙川县", "连平县", "和平县", "东源县"],
                    "阳江市": ["江城区", "阳西县", "阳东县", "阳春市"],
                    "清远市": ["清城区", "佛冈县", "阳山县", "连山壮族瑶族自治县", "连南瑶族自治县", "清新县", "英德市", "连州市"],
                    "东莞市": ["东莞市"],
                    "中山市": ["中山市"],
                    "潮州市": ["湘桥区", "潮安县", "饶平县"],
                    "揭阳市": ["榕城区", "揭东县", "揭西县", "惠来县", "普宁市"],
                    "云浮市": ["云城区", "新兴县", "郁南县", "云安县", "罗定市"]
                },
                "广西省": {
                    "南宁市": ["兴宁区", "青秀区", "江南区", "西乡塘区", "良庆区", "邕宁区", "武鸣县", "隆安县", "马山县", "上林县", "宾阳县", "横县"],
                    "柳州市": ["城中区", "鱼峰区", "柳南区", "柳北区", "柳江县", "柳城县", "鹿寨县", "融安县", "融水苗族自治县", "三江侗族自治县"],
                    "桂林市": ["秀峰区", "叠彩区", "象山区", "七星区", "雁山区", "阳朔县", "临桂县", "灵川县", "全州县", "兴安县", "永福县", "灌阳县", "龙胜各族自治县", "资源县", "平乐县", "荔蒲县", "恭城瑶族自治县"],
                    "梧州市": ["万秀区", "蝶山区", "长洲区", "苍梧县", "藤县", "蒙山县", "岑溪市"],
                    "北海市": ["海城区", "银海区", "铁山港区", "合浦县"],
                    "防城港市": ["港口区", "防城区", "上思县", "东兴市"],
                    "钦州市": ["钦南区", "钦北区", "灵山县", "浦北县"],
                    "贵港市": ["港北区", "港南区", "覃塘区", "平南县", "桂平市"],
                    "玉林市": ["玉州区", "容县", "陆川县", "博白县", "兴业县", "北流市"],
                    "百色市": ["右江区", "田阳县", "田东县", "平果县", "德保县", "靖西县", "那坡县", "凌云县", "乐业县", "田林县", "西林县", "隆林各族自治县"],
                    "贺州市": ["八步区", "昭平县", "钟山县", "富川瑶族自治县"],
                    "河池市": ["金城江区", "南丹县", "天峨县", "凤山县", "东兰县", "罗城仫佬族自治县", "环江毛南族自治县", "巴马瑶族自治县", "都安瑶族自治县", "大化瑶族自治县", "宜州市"],
                    "来宾市": ["兴宾区", "忻城县", "象州县", "武宣县", "金秀瑶族自治县", "合山市"],
                    "崇左市": ["江洲区", "扶绥县", "宁明县", "龙州县", "大新县", "天等县", "凭祥市"]
                },
                "陕西省": {
                    "西安市": ["新城区", "碑林区", "莲湖区", "灞桥区", "未央区", "雁塔区", "阎良区", "临潼区", "长安区", "蓝田县", "周至县", "户县", "高陵县"],
                    "铜川市": ["王益区", "印台区", "耀州区", "宜君县"],
                    "宝鸡市": ["渭滨区", "金台区", "陈仓区", "凤翔县", "岐山县", "扶风县", "眉县", "陇县", "千阳县", "麟游县", "凤县", "太白县"],
                    "咸阳市": ["秦都区", "杨凌区", "渭城区", "三原县", "泾阳县", "乾县", "礼泉县", "永寿县", "彬县", "长武县", "旬邑县", "淳化县", "武功县", "兴平市"],
                    "渭南市": ["临渭区", "华县", "潼关县", "大荔县", "合阳县", "澄城县", "蒲城县", "白水县", "富平县", "韩城市", "华阴市"],
                    "延安市": ["宝塔区", "延长县", "延川县", "子长县", "安塞县", "志丹县", "吴旗县", "甘泉县", "富县", "洛川县", "宜川县", "黄龙县", "黄陵县"],
                    "汉中市": ["汉台区", "南郑县", "城固县", "洋县", "西乡县", "勉县", "宁强县", "略阳县", "镇巴县", "留坝县", "佛坪县"],
                    "榆林市": ["榆阳区", "神木县", "府谷县", "横山县", "靖边县", "定边县", "绥德县", "米脂县", "佳县", "吴堡县", "清涧县", "子洲县"],
                    "安康市": ["汉滨区", "汉阴县", "石泉县", "宁陕县", "紫阳县", "岚皋县", "平利县", "镇坪县", "旬阳县", "白河县"],
                    "商洛市": ["商州区", "洛南县", "丹凤县", "商南县", "山阳县", "镇安县", "柞水县"]
                },
                "甘肃省": {
                    "兰州市": ["城关区", "七里河区", "西固区", "安宁区", "红古区", "永登县", "皋兰县", "榆中县"],
                    "嘉峪关市": ["市辖区"],
                    "金昌市": ["金川区", "永昌县"],
                    "白银市": ["白银区", "平川区", "靖远县", "会宁县", "景泰县"],
                    "天水市": ["秦城区", "北道区", "清水县", "秦安县", "甘谷县", "武山县", "张家川回族自治县"],
                    "武威市": ["凉州区", "民勤县", "古浪县", "天祝藏族自治县"],
                    "张掖市": ["甘州区", "肃南裕固族自治县", "民乐县", "临泽县", "高台县", "山丹县"],
                    "平凉市": ["崆峒区", "泾川县", "灵台县", "崇信县", "华亭县", "庄浪县", "静宁县"],
                    "酒泉市": ["肃州区", "金塔县", "安西县", "肃北蒙古族自治县", "阿克塞哈萨克族自治县", "玉门市", "敦煌市"],
                    "庆阳市": ["西峰区", "庆城县", "环县", "华池县", "合水县", "正宁县", "宁县", "镇原县"],
                    "定西市": ["安定区", "通渭县", "陇西县", "渭源县", "临洮县", "漳县", "岷县"],
                    "陇南市": ["武都区", "成县", "文县", "宕昌县", "康县", "西和县", "礼县", "徽县", "两当县"],
                    "临夏回族自治州": ["临夏市", "临夏县", "康乐县", "永靖县", "广河县", "和政县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县"],
                    "甘南藏族自治州": ["合作市", "临潭县", "卓尼县", "舟曲县", "迭部县", "玛曲县", "碌曲县", "夏河县"]
                },
                "青海省": {
                    "西宁市": ["城东区", "城中区", "城西区", "城北区", "大通回族土族自治县", "湟中县", "湟源县"],
                    "海东地区": ["平安县", "民和回族土族自治县", "乐都县", "互助土族自治县", "化隆回族自治县", "循化撒拉族自治县"],
                    "海北藏族自治州": ["门源回族自治县", "祁连县", "海晏县", "刚察县"],
                    "黄南藏族自治州": ["同仁县", "尖扎县", "泽库县", "河南蒙古族自治县"],
                    "海南藏族自治州": ["共和县", "同德县", "贵德县", "兴海县", "贵南县"],
                    "果洛藏族自治州": ["玛沁县", "班玛县", "甘德县", "达日县", "久治县", "玛多县"],
                    "玉树藏族自治州": ["玉树县", "杂多县", "称多县", "治多县", "囊谦县", "曲麻莱县"],
                    "海西蒙古族藏族自治州": ["格尔木市", "德令哈市", "乌兰县", "都兰县", "天峻县"]
                },
                "宁夏省": {
                    "银川市": ["兴庆区", "西夏区", "金凤区", "永宁县", "贺兰县", "灵武市"],
                    "石嘴山市": ["大武口区", "惠农区", "平罗县"],
                    "吴忠市": ["利通区", "盐池县", "同心县", "青铜峡市"],
                    "固原市": ["原州区", "西吉县", "隆德县", "泾源县", "彭阳县", "海原县"],
                    "中卫市": ["沙坡头区", "中宁县"]
                },
                "新疆省": {
                    "乌鲁木齐市": ["天山区", "沙依巴克区", "新市区", "水磨沟区", "头屯河区", "达坂城区", "东山区", "乌鲁木齐县"],
                    "克拉玛依市": ["独山子区", "克拉玛依区", "白碱滩区", "乌尔禾区"],
                    "吐鲁番地区": ["吐鲁番市", "鄯善县", "托克逊县"],
                    "哈密地区": ["哈密市", "巴里坤哈萨克自治县", "伊吾县"],
                    "昌吉回族自治州": ["昌吉市", "阜康市", "米泉市", "呼图壁县", "玛纳斯县", "奇台县", "吉木萨尔县", "木垒哈萨克自治县"],
                    "博尔塔拉蒙古自治州": ["博乐市", "精河县", "温泉县"],
                    "巴音郭楞蒙古自治州": ["库尔勒市", "轮台县", "尉犁县", "若羌县", "且末县", "焉耆回族自治县", "和静县", "和硕县", "博湖县"],
                    "阿克苏地区": ["阿克苏市", "温宿县", "库车县", "沙雅县", "新和县", "拜城县", "乌什县", "阿瓦提县", "柯坪县"],
                    "克孜勒苏柯尔克孜自治州": ["阿图什市", "阿克陶县", "阿合奇县", "乌恰县"],
                    "喀什地区": ["喀什市", "疏附县", "疏勒县", "英吉沙县", "泽普县", "莎车县", "叶城县", "麦盖提县", "岳普湖县", "伽师县", "巴楚县", "塔什库尔干塔吉克自治县"],
                    "和田地区": ["和田市", "和田县", "墨玉县", "皮山县", "洛浦县", "策勒县", "于田县", "民丰县"],
                    "伊犁哈萨克自治州": ["伊宁市", "奎屯市", "伊宁县", "察布查尔锡伯自治县", "霍城县", "巩留县", "新源县", "昭苏县", "特克斯县", "尼勒克县"],
                    "塔城地区": ["塔城市", "乌苏市", "额敏县", "沙湾县", "托里县", "裕民县", "和布克赛尔蒙古自治县"],
                    "阿勒泰地区": ["阿勒泰市", "布尔津县", "富蕴县", "福海县", "哈巴河县", "青河县", "吉木乃县"],
                    "省直辖行政单位": ["石河子市", "阿拉尔市", "图木舒克市", "五家渠市"]
                },
                "河北省": {
                    "石家庄市": ["长安区", "桥东区", "桥西区", "新华区", "井陉矿区", "裕华区", "井陉县", "正定县", "栾城县", "行唐县", "灵寿县", "高邑县", "深泽县", "赞皇县", "无极县", "平山县", "元氏县", "赵县", "辛集市", "藁城市", "晋州市", "新乐市", "鹿泉市"],
                    "唐山市": ["路南区", "路北区", "古冶区", "开平区", "丰南区", "丰润区", "滦县", "滦南县", "乐亭县", "迁西县", "玉田县", "唐海县", "遵化市", "迁安市"],
                    "秦皇岛市": ["海港区", "山海关区", "北戴河区", "青龙满族自治县", "昌黎县", "抚宁县", "卢龙县"],
                    "邯郸市": ["邯山区", "丛台区", "复兴区", "峰峰矿区", "邯郸县", "临漳县", "成安县", "大名县", "涉县", "磁县", "肥乡县", "永年县", "邱县", "鸡泽县", "广平县", "馆陶县", "魏县", "曲周县", "武安市"],
                    "邢台市": ["桥东区", "桥西区", "邢台县", "临城县", "内丘县", "柏乡县", "隆尧县", "任县", "南和县", "宁晋县", "巨鹿县", "新河县", "广宗县", "平乡县", "威县", "清河县", "临西县", "南宫市", "沙河市"],
                    "保定市": ["新市区", "北市区", "南市区", "满城县", "清苑县", "涞水县", "阜平县", "徐水县", "定兴县", "唐县", "高阳县", "容城县", "涞源县", "望都县", "安新县", "易县", "曲阳县", "蠡县", "顺平县", "博野县", "雄县", "涿州市", "定州市", "安国市", "高碑店市"],
                    "张家口市": ["桥东区", "桥西区", "宣化区", "下花园区", "宣化县", "张北县", "康保县", "沽源县", "尚义县", "蔚县", "阳原县", "怀安县", "万全县", "怀来县", "涿鹿县", "赤城县", "崇礼县"],
                    "承德市": ["双桥区", "双滦区", "鹰手营子矿区", "承德县", "兴隆县", "平泉县", "滦平县", "隆化县", "丰宁满族自治县", "宽城满族自治县", "围场满族蒙古族自治县"],
                    "沧州市": ["新华区", "运河区", "沧县", "青县", "东光县", "海兴县", "盐山县", "肃宁县", "南皮县", "吴桥县", "献县", "孟村回族自治县", "泊头市", "任丘市", "黄骅市", "河间市"],
                    "廊坊市": ["安次区", "广阳区", "固安县", "永清县", "香河县", "大城县", "文安县", "大厂回族自治县", "霸州市", "三河市"],
                    "衡水市": ["桃城区", "枣强县", "武邑县", "武强县", "饶阳县", "安平县", "故城县", "景县", "阜城县", "冀州市", "深州市"]
                },
                "山西省": {
                    "太原市": ["小店区", "迎泽区", "杏花岭区", "尖草坪区", "万柏林区", "晋源区", "清徐县", "阳曲县", "娄烦县", "古交市"],
                    "大同市": ["城区", "矿区", "南郊区", "新荣区", "阳高县", "天镇县", "广灵县", "灵丘县", "浑源县", "左云县", "大同县"],
                    "阳泉市": ["城区", "矿区", "郊区", "平定县", "盂县"],
                    "长治市": ["城区", "郊区", "长治县", "襄垣县", "屯留县", "平顺县", "黎城县", "壶关县", "长子县", "武乡县", "沁县", "沁源县", "潞城市"],
                    "晋城市": ["城区", "沁水县", "阳城县", "陵川县", "泽州县", "高平市"],
                    "朔州市": ["朔城区", "平鲁区", "山阴县", "应县", "右玉县", "怀仁县"],
                    "晋中市": ["榆次区", "榆社县", "左权县", "和顺县", "昔阳县", "寿阳县", "太谷县", "祁县", "平遥县", "灵石县", "介休市"],
                    "运城市": ["盐湖区", "临猗县", "万荣县", "闻喜县", "稷山县", "新绛县", "绛县", "垣曲县", "夏县", "平陆县", "芮城县", "永济市", "河津市"],
                    "忻州市": ["忻府区", "定襄县", "五台县", "代县", "繁峙县", "宁武县", "静乐县", "神池县", "五寨县", "岢岚县", "河曲县", "保德县", "偏关县", "原平市"],
                    "临汾市": ["尧都区", "曲沃县", "翼城县", "襄汾县", "洪洞县", "古县", "安泽县", "浮山县", "吉县", "乡宁县", "大宁县", "隰县", "永和县", "蒲县", "汾西县", "侯马市", "霍州市"],
                    "吕梁市": ["离石区", "文水县", "交城县", "兴县", "临县", "柳林县", "石楼县", "岚县", "方山县", "中阳县", "交口县", "孝义市", "汾阳市"]
                },
                "内蒙古省": {
                    "呼和浩特市": ["新城区", "回民区", "玉泉区", "赛罕区", "土默特左旗", "托克托县", "和林格尔县", "清水河县", "武川县"],
                    "包头市": ["东河区", "昆都仑区", "青山区", "石拐区", "白云矿区", "九原区", "土默特右旗", "固阳县", "达尔罕茂明安联合旗"],
                    "乌海市": ["海勃湾区", "海南区", "乌达区"],
                    "赤峰市": ["红山区", "元宝山区", "松山区", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西县", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城县", "敖汉旗"],
                    "通辽市": ["科尔沁区", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "奈曼旗", "扎鲁特旗", "霍林郭勒市"],
                    "鄂尔多斯市": ["东胜区", "达拉特旗", "准格尔旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗"],
                    "呼伦贝尔市": ["海拉尔区", "阿荣旗", "莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗", "满洲里市", "牙克石市", "扎兰屯市", "额尔古纳市", "根河市"],
                    "巴彦淖尔市": ["临河区", "五原县", "磴口县", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"],
                    "乌兰察布市": ["集宁区", "卓资县", "化德县", "商都县", "兴和县", "凉城县", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "丰镇市"],
                    "兴安盟": ["乌兰浩特市", "阿尔山市", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉县"],
                    "锡林郭勒盟": ["二连浩特市", "锡林浩特市", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦县"],
                    "阿拉善盟": ["阿拉善左旗", "阿拉善右旗", "额济纳旗"]
                },
                "江苏省": {
                    "南京市": ["玄武区", "白下区", "秦淮区", "建邺区", "鼓楼区", "下关区", "浦口区", "栖霞区", "雨花台区", "江宁区", "六合区", "溧水县", "高淳县"],
                    "无锡市": ["崇安区", "南长区", "北塘区", "锡山区", "惠山区", "滨湖区", "江阴市", "宜兴市"],
                    "徐州市": ["鼓楼区", "云龙区", "九里区", "贾汪区", "泉山区", "丰县", "沛县", "铜山县", "睢宁县", "新沂市", "邳州市"],
                    "常州市": ["天宁区", "钟楼区", "戚墅堰区", "新北区", "武进区", "溧阳市", "金坛市"],
                    "苏州市": ["沧浪区", "平江区", "金阊区", "虎丘区", "吴中区", "相城区", "常熟市", "张家港市", "昆山市", "吴江市", "太仓市"],
                    "南通市": ["崇川区", "港闸区", "海安县", "如东县", "启东市", "如皋市", "通州市", "海门市"],
                    "连云港市": ["连云区", "新浦区", "海州区", "赣榆县", "东海县", "灌云县", "灌南县"],
                    "淮安市": ["清河区", "楚州区", "淮阴区", "清浦区", "涟水县", "洪泽县", "盱眙县", "金湖县"],
                    "盐城市": ["亭湖区", "盐都区", "响水县", "滨海县", "阜宁县", "射阳县", "建湖县", "东台市", "大丰市"],
                    "扬州市": ["广陵区", "邗江区", "郊区", "宝应县", "仪征市", "高邮市", "江都市"],
                    "镇江市": ["京口区", "润州区", "丹徒区", "丹阳市", "扬中市", "句容市"],
                    "泰州市": ["海陵区", "高港区", "兴化市", "靖江市", "泰兴市", "姜堰市"],
                    "宿迁市": ["宿城区", "宿豫区", "沭阳县", "泗阳县", "泗洪县"]
                },
                "浙江省": {
                    "杭州市": ["上城区", "下城区", "江干区", "拱墅区", "西湖区", "滨江区", "萧山区", "余杭区", "桐庐县", "淳安县", "建德市", "富阳市", "临安市"],
                    "宁波市": ["海曙区", "江东区", "江北区", "北仑区", "镇海区", "鄞州区", "象山县", "宁海县", "余姚市", "慈溪市", "奉化市"],
                    "温州市": ["鹿城区", "龙湾区", "瓯海区", "洞头县", "永嘉县", "平阳县", "苍南县", "文成县", "泰顺县", "瑞安市", "乐清市"],
                    "嘉兴市": ["秀城区", "秀洲区", "嘉善县", "海盐县", "海宁市", "平湖市", "桐乡市"],
                    "湖州市": ["吴兴区", "南浔区", "德清县", "长兴县", "安吉县"],
                    "绍兴市": ["越城区", "绍兴县", "新昌县", "诸暨市", "上虞市", "嵊州市"],
                    "金华市": ["婺城区", "金东区", "武义县", "浦江县", "磐安县", "兰溪市", "义乌市", "东阳市", "永康市"],
                    "衢州市": ["柯城区", "衢江区", "常山县", "开化县", "龙游县", "江山市"],
                    "舟山市": ["定海区", "普陀区", "岱山县", "嵊泗县"],
                    "台州市": ["椒江区", "黄岩区", "路桥区", "玉环县", "三门县", "天台县", "仙居县", "温岭市", "临海市"],
                    "丽水市": ["莲都区", "青田县", "缙云县", "遂昌县", "松阳县", "云和县", "庆元县", "景宁畲族自治县", "龙泉市"]
                },
                "安徽省": {
                    "合肥市": ["瑶海区", "庐阳区", "蜀山区", "包河区", "长丰县", "肥东县", "肥西县"],
                    "芜湖市": ["镜湖区", "马塘区", "新芜区", "鸠江区", "芜湖县", "繁昌县", "南陵县"],
                    "蚌埠市": ["龙子湖区", "蚌山区", "禹会区", "淮上区", "怀远县", "五河县", "固镇县"],
                    "淮南市": ["大通区", "田家庵区", "谢家集区", "八公山区", "潘集区", "凤台县"],
                    "马鞍山市": ["金家庄区", "花山区", "雨山区", "当涂县"],
                    "淮北市": ["杜集区", "相山区", "烈山区", "濉溪县"],
                    "铜陵市": ["铜官山区", "狮子山区", "郊区", "铜陵县"],
                    "安庆市": ["迎江区", "大观区", "郊区", "怀宁县", "枞阳县", "潜山县", "太湖县", "宿松县", "望江县", "岳西县", "桐城市"],
                    "黄山市": ["屯溪区", "黄山区", "徽州区", "歙县", "休宁县", "黟县", "祁门县"],
                    "滁州市": ["琅琊区", "南谯区", "来安县", "全椒县", "定远县", "凤阳县", "天长市", "明光市"],
                    "阜阳市": ["颍州区", "颍东区", "颍泉区", "临泉县", "太和县", "阜南县", "颍上县", "界首市"],
                    "宿州市": ["墉桥区", "砀山县", "萧县", "灵璧县", "泗县"],
                    "巢湖市": ["居巢区", "庐江县", "无为县", "含山县", "和县"],
                    "六安市": ["金安区", "裕安区", "寿县", "霍邱县", "舒城县", "金寨县", "霍山县"],
                    "亳州市": ["谯城区", "涡阳县", "蒙城县", "利辛县"],
                    "池州市": ["贵池区", "东至县", "石台县", "青阳县"],
                    "宣城市": ["宣州区", "郎溪县", "广德县", "泾县", "绩溪县", "旌德县", "宁国市"]
                },
                "福建省": {
                    "福州市": ["鼓楼区", "台江区", "仓山区", "马尾区", "晋安区", "闽侯县", "连江县", "罗源县", "闽清县", "永泰县", "平潭县", "福清市", "长乐市"],
                    "厦门市": ["思明区", "海沧区", "湖里区", "集美区", "同安区", "翔安区"],
                    "莆田市": ["城厢区", "涵江区", "荔城区", "秀屿区", "仙游县"],
                    "三明市": ["梅列区", "三元区", "明溪县", "清流县", "宁化县", "大田县", "尤溪县", "沙县", "将乐县", "泰宁县", "建宁县", "永安市"],
                    "泉州市": ["鲤城区", "丰泽区", "洛江区", "泉港区", "惠安县", "安溪县", "永春县", "德化县", "金门县", "石狮市", "晋江市", "南安市"],
                    "漳州市": ["芗城区", "龙文区", "云霄县", "漳浦县", "诏安县", "长泰县", "东山县", "南靖县", "平和县", "华安县", "龙海市"],
                    "南平市": ["延平区", "顺昌县", "浦城县", "光泽县", "松溪县", "政和县", "邵武市", "武夷山市", "建瓯市", "建阳市"],
                    "龙岩市": ["新罗区", "长汀县", "永定县", "上杭县", "武平县", "连城县", "漳平市"],
                    "宁德市": ["蕉城区", "霞浦县", "古田县", "屏南县", "寿宁县", "周宁县", "柘荣县", "福安市", "福鼎市"]
                },
                "江西省": {
                    "南昌市": ["东湖区", "西湖区", "青云谱区", "湾里区", "青山湖区", "南昌县", "新建县", "安义县", "进贤县"],
                    "景德镇市": ["昌江区", "珠山区", "浮梁县", "乐平市"],
                    "萍乡市": ["安源区", "湘东区", "莲花县", "上栗县", "芦溪县"],
                    "九江市": ["庐山区", "浔阳区", "九江县", "武宁县", "修水县", "永修县", "德安县", "星子县", "都昌县", "湖口县", "彭泽县", "瑞昌市"],
                    "新余市": ["渝水区", "分宜县"],
                    "鹰潭市": ["月湖区", "余江县", "贵溪市"],
                    "赣州市": ["章贡区", "赣县", "信丰县", "大余县", "上犹县", "崇义县", "安远县", "龙南县", "定南县", "全南县", "宁都县", "于都县", "兴国县", "会昌县", "寻乌县", "石城县", "瑞金市", "南康市"],
                    "吉安市": ["吉州区", "青原区", "吉安县", "吉水县", "峡江县", "新干县", "永丰县", "泰和县", "遂川县", "万安县", "安福县", "永新县", "井冈山市"],
                    "宜春市": ["袁州区", "奉新县", "万载县", "上高县", "宜丰县", "靖安县", "铜鼓县", "丰城市", "樟树市", "高安市"],
                    "抚州市": ["临川区", "南城县", "黎川县", "南丰县", "崇仁县", "乐安县", "宜黄县", "金溪县", "资溪县", "东乡县", "广昌县"],
                    "上饶市": ["信州区", "上饶县", "广丰县", "玉山县", "铅山县", "横峰县", "弋阳县", "余干县", "鄱阳县", "万年县", "婺源县", "德兴市"]
                },
                "山东省": {
                    "济南市": ["历下区", "市中区", "槐荫区", "天桥区", "历城区", "长清区", "平阴县", "济阳县", "商河县", "章丘市"],
                    "青岛市": ["市南区", "市北区", "四方区", "黄岛区", "崂山区", "李沧区", "城阳区", "胶州市", "即墨市", "平度市", "胶南市", "莱西市"],
                    "淄博市": ["淄川区", "张店区", "博山区", "临淄区", "周村区", "桓台县", "高青县", "沂源县"],
                    "枣庄市": ["市中区", "薛城区", "峄城区", "台儿庄区", "山亭区", "滕州市"],
                    "东营市": ["东营区", "河口区", "垦利县", "利津县", "广饶县"],
                    "烟台市": ["芝罘区", "福山区", "牟平区", "莱山区", "长岛县", "龙口市", "莱阳市", "莱州市", "蓬莱市", "招远市", "栖霞市", "海阳市"],
                    "潍坊市": ["潍城区", "寒亭区", "坊子区", "奎文区", "临朐县", "昌乐县", "青州市", "诸城市", "寿光市", "安丘市", "高密市", "昌邑市"],
                    "济宁市": ["市中区", "任城区", "微山县", "鱼台县", "金乡县", "嘉祥县", "汶上县", "泗水县", "梁山县", "曲阜市", "兖州市", "邹城市"],
                    "泰安市": ["泰山区", "岱岳区", "宁阳县", "东平县", "新泰市", "肥城市"],
                    "威海市": ["环翠区", "文登市", "荣成市", "乳山市"],
                    "日照市": ["东港区", "岚山区", "五莲县", "莒县"],
                    "莱芜市": ["莱城区", "钢城区"],
                    "临沂市": ["兰山区", "罗庄区", "河东区", "沂南县", "郯城县", "沂水县", "苍山县", "费县", "平邑县", "莒南县", "蒙阴县", "临沭县"],
                    "德州市": ["德城区", "陵县", "宁津县", "庆云县", "临邑县", "齐河县", "平原县", "夏津县", "武城县", "乐陵市", "禹城市"],
                    "聊城市": ["东昌府区", "阳谷县", "莘县", "茌平县", "东阿县", "冠县", "高唐县", "临清市"],
                    "滨州市": ["滨城区", "惠民县", "阳信县", "无棣县", "沾化县", "博兴县", "邹平县"],
                    "荷泽市": ["牡丹区", "曹县", "单县", "成武县", "巨野县", "郓城县", "鄄城县", "定陶县", "东明县"]
                },
                "辽宁省": {
                    "沈阳市": ["和平区", "沈河区", "大东区", "皇姑区", "铁西区", "苏家屯区", "东陵区", "新城子区", "于洪区", "辽中县", "康平县", "法库县", "新民市"],
                    "大连市": ["中山区", "西岗区", "沙河口区", "甘井子区", "旅顺口区", "金州区", "长海县", "瓦房店市", "普兰店市", "庄河市"],
                    "鞍山市": ["铁东区", "铁西区", "立山区", "千山区", "台安县", "岫岩满族自治县", "海城市"],
                    "抚顺市": ["新抚区", "东洲区", "望花区", "顺城区", "抚顺县", "新宾满族自治县", "清原满族自治县"],
                    "本溪市": ["平山区", "溪湖区", "明山区", "南芬区", "本溪满族自治县", "桓仁满族自治县"],
                    "丹东市": ["元宝区", "振兴区", "振安区", "宽甸满族自治县", "东港市", "凤城市"],
                    "锦州市": ["古塔区", "凌河区", "太和区", "黑山县", "义县", "凌海市", "北宁市"],
                    "营口市": ["站前区", "西市区", "鲅鱼圈区", "老边区", "盖州市", "大石桥市"],
                    "阜新市": ["海州区", "新邱区", "太平区", "清河门区", "细河区", "阜新蒙古族自治县", "彰武县"],
                    "辽阳市": ["白塔区", "文圣区", "宏伟区", "弓长岭区", "太子河区", "辽阳县", "灯塔市"],
                    "盘锦市": ["双台子区", "兴隆台区", "大洼县", "盘山县"],
                    "铁岭市": ["银州区", "清河区", "铁岭县", "西丰县", "昌图县", "调兵山市", "开原市"],
                    "朝阳市": ["双塔区", "龙城区", "朝阳县", "建平县", "喀喇沁左翼蒙古族自治县", "北票市", "凌源市"],
                    "葫芦岛市": ["连山区", "龙港区", "南票区", "绥中县", "建昌县", "兴城市"]
                },
                "吉林省": {
                    "长春市": ["南关区", "宽城区", "朝阳区", "二道区", "绿园区", "双阳区", "农安县", "九台市", "榆树市", "德惠市"],
                    "吉林市": ["昌邑区", "龙潭区", "船营区", "丰满区", "永吉县", "蛟河市", "桦甸市", "舒兰市", "磐石市"],
                    "四平市": ["铁西区", "铁东区", "梨树县", "伊通满族自治县", "公主岭市", "双辽市"],
                    "辽源市": ["龙山区", "西安区", "东丰县", "东辽县"],
                    "通化市": ["东昌区", "二道江区", "通化县", "辉南县", "柳河县", "梅河口市", "集安市"],
                    "白山市": ["八道江区", "抚松县", "靖宇县", "长白朝鲜族自治县", "江源县", "临江市"],
                    "松原市": ["宁江区", "前郭尔罗斯蒙古族自治县", "长岭县", "乾安县", "扶余县"],
                    "白城市": ["洮北区", "镇赉县", "通榆县", "洮南市", "大安市"],
                    "延边朝鲜族自治州": ["延吉市", "图们市", "敦化市", "珲春市", "龙井市", "和龙市", "汪清县", "安图县"]
                },
                "黑龙江省": {
                    "哈尔滨市": ["道里区", "南岗区", "道外区", "香坊区", "动力区", "平房区", "松北区", "呼兰区", "依兰县", "方正县", "宾县", "巴彦县", "木兰县", "通河县", "延寿县", "阿城市", "双城市", "尚志市", "五常市"],
                    "齐齐哈尔市": ["龙沙区", "建华区", "铁锋区", "昂昂溪区", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "龙江县", "依安县", "泰来县", "甘南县", "富裕县", "克山县", "克东县", "拜泉县", "讷河市"],
                    "鸡西市": ["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "鸡东县", "虎林市", "密山市"],
                    "鹤岗市": ["向阳区", "工农区", "南山区", "兴安区", "东山区", "兴山区", "萝北县", "绥滨县"],
                    "双鸭山市": ["尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "友谊县", "宝清县", "饶河县"],
                    "大庆市": ["萨尔图区", "龙凤区", "让胡路区", "红岗区", "大同区", "肇州县", "肇源县", "林甸县", "杜尔伯特蒙古族自治县"],
                    "伊春市": ["伊春区", "南岔区", "友好区", "西林区", "翠峦区", "新青区", "美溪区", "金山屯区", "五营区", "乌马河区", "汤旺河区", "带岭区", "乌伊岭区", "红星区", "上甘岭区", "嘉荫县", "铁力市"],
                    "佳木斯市": ["永红区", "向阳区", "前进区", "东风区", "郊区", "桦南县", "桦川县", "汤原县", "抚远县", "同江市", "富锦市"],
                    "七台河市": ["新兴区", "桃山区", "茄子河区", "勃利县"],
                    "牡丹江市": ["东安区", "阳明区", "爱民区", "西安区", "东宁县", "林口县", "绥芬河市", "海林市", "宁安市", "穆棱市"],
                    "黑河市": ["爱辉区", "嫩江县", "逊克县", "孙吴县", "北安市", "五大连池市"],
                    "绥化市": ["北林区", "望奎县", "兰西县", "青冈县", "庆安县", "明水县", "绥棱县", "安达市", "肇东市", "海伦市"],
                    "大兴安岭地区": ["呼玛县", "塔河县", "漠河县"]
                },
                "海南省": {
                    "海口市": ["秀英区", "龙华区", "琼山区", "美兰区"],
                    "三亚市": ["三亚市"],
                    "省直辖县级行政单位": ["五指山市", "琼海市", "儋州市", "文昌市", "万宁市", "东方市", "定安县", "屯昌县", "澄迈县", "临高县", "白沙黎族自治县", "昌江黎族自治县", "乐东黎族自治县", "陵水黎族自治县", "保亭黎族苗族自治县", "琼中黎族苗族自治县", "西沙群岛", "南沙群岛", "中沙群岛的岛礁及其海域"]
                }
            };

            $scope.provinces=[];
            for( item in $scope.division){
                var json={};
                json.name=item;
                json.list=[];
                for( item1 in $scope.division[item]){

                    if(item1!==item){
                        var json1={};
                        json1.name=item1;
                        json.list.push(json1);
                    }else{
                        console.log($scope.division[item][item1]);
                        for( var k=0; k<$scope.division[item][item1].length;k++){
                            var json1={};
                            json1.name = $scope.division[item][item1][k];
                            json.list.push(json1);
                        }
                    }

                }
                $scope.provinces.push(json);
                //debugger;

            }
            //console.log($scope.provinces);
            $scope.newName1="四川";
            $scope.ctiys=$scope.provinces[0].list;
            $scope.changeProvinces=function(v){
                for(var i=0;i<$scope.provinces.length;i++){
                    if($scope.provinces[i].name===v){
                        $scope.ctiys=$scope.provinces[i].list;
                    }

                }
            }

            $scope.submitCompanyReview = function () {
                $scope.isSubmitReview = true;
                stopTime = $interval(function () {
                    $state.go("qs100.sccsAddCompany", {}, {reload: true});
                    $scope.isSubmitReview = false;
                    /**/
                    $interval.cancel(stopTime);
                }, 3000);

                var ii = 0;
                $scope.setTime = 3
                var tt = setInterval(function () {
                    ii++;
                    if (ii === 3) {
                        clearInterval(tt);
                    }
                    $scope.setTime--;
                    $scope.$apply();
                }, 1000)
            }

            $scope.closeSubmitReview = function () {
                $scope.isSubmitReview = false;
            }




            //$scope.pageClass="scscAddCompany"
            $scope.years = [
                {
                    name: "2008年",
                    key: 1
                },
                {
                    name: "2009年",
                    key: 2
                },
                {
                    name: "2010年",
                    key: 2
                },
                {
                    name: "2011年",
                    key: 2
                },
                {
                    name: "2012年",
                    key: 2
                },
                {
                    name: "2013年",
                    key: 2
                },
                {
                    name: "2014年",
                    key: 2
                },
                {
                    name: "2015年",
                    key: 2
                }
            ];
            $scope.newYear = 1;
            $scope.changeYear = function (v) {
                //debugger;
            }
            $scope.months = [
                {
                    name: "1月",
                    key: 1
                },
                {
                    name: "2月",
                    key: 2
                },
                {
                    name: "3月",
                    key: 3
                },
                {
                    name: "4月",
                    key: 4
                },
                {
                    name: "5月",
                    key: 5
                },
                {
                    name: "6月",
                    key: 6
                },
                {
                    name: "7月",
                    key: 7
                },
                {
                    name: "8月",
                    key: 8
                },
                {
                    name: "9月",
                    key: 9
                },
                {
                    name: "10月",
                    key: 10
                },
                {
                    name: "11月",
                    key: 11
                },
                {
                    name: "12月",
                    key: 12
                }
            ];
            $scope.changeMonth = function (v) {
                //debugger;
            };
            $scope.newMonth = 1;
            $scope.states = [
                {
                    name: "运营中",
                    key: 1
                },
                {
                    name: "未上线",
                    key: 2
                },
                {
                    name: "已关闭",
                    key: 3
                },
                {
                    name: "已转型",
                    key: 4
                }
            ];
            $scope.changeState = function (v) {
                //debugger;
            };
            $scope.newState = 1;


            $scope.fields = [
                {
                    name: "教育",
                    key: 1
                },
                {
                    name: "金融",
                    key: 2
                },
                {
                    name: "汽车交通",
                    key: 3
                },
                {
                    name: "房产服务",
                    key: 4
                },
                {
                    name: "医疗健康",
                    key: 5
                },
                {
                    name: "旅游",
                    key: 6
                },
                {
                    name: "本地生活",
                    key: 7
                },
                {
                    name: "游戏",
                    key: 8
                },
                {
                    name: "硬件",
                    key: 9
                },
                {
                    name: "企业服务",
                    key: 10
                },
                {
                    name: "电子商务",
                    key: 11
                },
                {
                    name: "工具软件",
                    key: 12
                },
                {
                    name: "移动互联网",
                    key: 13
                },
                {
                    name: "体育运动",
                    key: 14
                },
                {
                    name: "物流",
                    key: 15
                },
            ];
            $scope.changeField = function (v) {
                //debugger;
            };
            $scope.newField = 1;


            $scope.roles = [

                {
                    name: "创始人",
                    key: 1
                },
                {
                    name: "员工",
                    key: 2
                },
                {
                    name: "投资人",
                    key: 3
                },
                {
                    name: "用户",
                    key: 4
                },
                {
                    name: "发现者",
                    key: 5
                }
            ];
            $scope.changeRole = function (v) {
                //debugger;
            };
            $scope.newRole = 1;


            $scope.moneys = [

                {
                    name: "不明确",
                    key: 1
                },
                {
                    name: "需要融资",
                    key: 2
                },
                {
                    name: "不需要融资",
                    key: 3
                },
                {
                    name: "寻求被收购",
                    key: 4
                },
                {
                    name: "发现者",
                    key: 5
                }
            ];
            $scope.changeMoney = function (v) {
                //debugger;
            };
            $scope.newMoney = 1;
        }]);
qsDataAnalysisApp.controller("chengDuMapCtrl",["$scope","$http","$rootScope","$state","ScscInstance",function($scope,$http,$rootScope,$state,ScscInstance){
    $rootScope.bigTitle="成都双创总览";

    $scope.pageClass="chengDuMap"



    $scope.areas=[
        {
            name:"软件园",
            id:3,
            url:"are8",
            big:"big8",
            are:120,
            x:650,
            y:610

        },
        {
            name:"第五维国际孵化器",
            id:3,
            url:"are8",
            big:"big8",
            active:true,
            src:"static/qsassets/qsstyle/images/dww.png",
            text:"旨在打造国内领先的以互联网和大数据技术应用为主要方向的，全要素平台服务型创新创业孵化器；通过系统和专业化的高质量服务，为在技术、模式、 产品和市场等方面创新的初创类互联网优秀团队和项目提供全要素支持。",
            url:"http://www.5thd.cn/home",
            are:40,
            x:658,
            y:650

        },

        {
            name:"郫县双创科技园",
            id:3,
            url:"are8",
            big:"big8",
            are:80,
            x:368,
            y:90

        },
        {
            name:"郫县双创科技园",
            id:3,
            url:"are8",
            big:"big8",
            are:30,
            x:388,
            y:100

        },
        {
            name:"郫县双创科技园",
            id:3,
            url:"are8",
            big:"big8",
            are:40,
            x:398,
            y:160

        },
        {
            name:"郫县双创科技园",
            id:3,
            url:"are8",
            big:"big8",
            are:40,
            x:410,
            y:160

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:50,
            x:630,
            y:400

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:80,
            x:650,
            y:500

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:50,
            x:644,
            y:388

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:20,
            x:700,
            y:450

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:20,
            x:680,
            y:430

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:20,
            x:570,
            y:470

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:20,
            x:780,
            y:430

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:20,
            x:689,
            y:490

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:20,
            x:648,
            y:550

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:20,
            x:848,
            y:650

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:50,
            x:448,
            y:650

        },
        {
            name:"孵化园",
            id:0,
            url:"are1",
            big:"big1",
            are:20,
            x:688,
            y:580

        },

        {
            name:"环球中心",
            id:1,
            url:"are2",
            big:"big2",
            are:30,
            x:687,
            y:584

        },
        {
            name:"软件园A区",
            id:2,
            url:"are3",
            big:"big3",
            are:20,
            x:708,
            y:610

        },
        {
            name:"软件园B区",
            id:3,
            url:"are4",
            big:"big4",
            are:20,
            x:711,
            y:607

        },
        {
            name:"软件园C区",
            id:3,
            url:"are5",
            big:"big5",
            are:20,
            x:713,
            y:636

        },
        {
            name:"软件园D区",
            id:3,
            url:"are6",
            big:"big6",
            are:20,
            x:731,
            y:636

        },
        {
            name:"软件园E区",
            id:3,
            url:"are7",
            big:"big7",
            are:20,
            x:693,
            y:636

        },
        {
            name:"软件园F区",
            id:3,
            url:"are8",
            big:"big8",
            are:20,
            x:670,
            y:620

        },

        {
            name:"软件园G区",
            id:3,
            url:"are9",
            big:"big9",
            are:20,
            x:655,
            y:630

        }
    ]
    $scope.scale=1.263;
    for(var i=0;i<$scope.areas.length;i++){
        $scope.areas[i].style={
            top:$scope.scale*$scope.areas[i].y,
            left:($scope.scale-0.12)*$scope.areas[i].x,
            width:$scope.scale*$scope.areas[i].are,
            height:$scope.scale*$scope.areas[i].are,
            transform:"scale("+$scope.scale+")",
            opacity: 1
        }
        if($scope.areas[i].name==="第五维国际孵化器"){
            $scope.textBox=$scope.areas[i];
        }
    }

    var pushTime,kk=0;
    $scope.pushList=[];
    function pushLi(){
        if(kk>$scope.areas.length) {
            clearTimeout(pushTime);
            return;
        }
        pushTime=setTimeout(function(){

            $scope.pushList.push($scope.areas[kk]);
            kk++;
            $scope.$apply();
            pushLi();
        },100)
    }
    pushLi();

    setInterval(function(){
        $scope.pushList=[];
        $scope.$apply();
        kk=0
        pushLi();

    },10000)


    $scope.liClick=function(item){

        for( var i=0;i<$scope.areas.length;i++){
            if($scope.areas[i]===item){
                $scope.areas[i].active=true;
            }else{
                $scope.areas[i].active=false;
            }
        }
        $scope.textBox=item;
        $scope.displayCity=true;
    }


    $scope.closeComparison=function(){
        $scope.textBox=$scope.areas[i%$scope.areas.length];
        $scope.displayCity=false;
    }

}]);





dataMap.dataInternet = dataFormatter({
    //max : 60000,
    2011:[16251.93,11307.28,24515.76,11237.55,14359.88,22226.7,10568.83,12582,19195.69,49110.27,32318.85,15300.65,17560.18,11702.82,45361.85,26931.03,19632.26,19669.56,53210.28,11720.87,2522.66,10011.37,21026.68,5701.84,8893.12,605.83,12512.3,5020.37,1670.44,2102.21,6610.05],
    2010:[14113.58,9224.46,20394.26,9200.86,11672,18457.27,8667.58,10368.6,17165.98,41425.48,27722.31,12359.33,14737.12,9451.26,39169.92,23092.36,15967.61,16037.96,46013.06,9569.85,2064.5,7925.58,17185.48,4602.16,7224.18,507.46,10123.48,4120.75,1350.43,1689.65,5437.47],
    2009:[12153.03,7521.85,17235.48,7358.31,9740.25,15212.49,7278.75,8587,15046.45,34457.3,22990.35,10062.82,12236.53,7655.18,33896.65,19480.46,12961.1,13059.69,39482.56,7759.16,1654.21,6530.01,14151.28,3912.68,6169.75,441.36,8169.8,3387.56,1081.27,1353.31,4277.05],
    2008:[11115,6719.01,16011.97,7315.4,8496.2,13668.58,6426.1,8314.37,14069.87,30981.98,21462.69,8851.66,10823.01,6971.05,30933.28,18018.53,11328.92,11555,36796.71,7021,1503.06,5793.66,12601.23,3561.56,5692.12,394.85,7314.58,3166.82,1018.62,1203.92,4183.21],
    2007:[9846.81,5252.76,13607.32,6024.45,6423.18,11164.3,5284.69,7104,12494.01,26018.48,18753.73,7360.92,9248.53,5800.25,25776.91,15012.46,9333.4,9439.6,31777.01,5823.41,1254.17,4676.13,10562.39,2884.11,4772.52,341.43,5757.29,2703.98,797.35,919.11,3523.16],
    2006:[8117.78,4462.74,11467.6,4878.61,4944.25,9304.52,4275.12,6211.8,10572.24,21742.05,15718.47,6112.5,7583.85,4820.53,21900.19,12362.79,7617.47,7688.67,26587.76,4746.16,1065.67,3907.23,8690.24,2338.98,3988.14,290.76,4743.61,2277.35,648.5,725.9,3045.26],
    2005:[6969.52,3905.64,10012.11,4230.53,3905.03,8047.26,3620.27,5513.7,9247.66,18598.69,13417.68,5350.17,6554.69,4056.76,18366.87,10587.42,6590.19,6596.1,22557.37,3984.1,918.75,3467.72,7385.1,2005.42,3462.73,248.8,3933.72,1933.98,543.32,612.61,2604.19],
    2004:[6033.21,3110.97,8477.63,3571.37,3041.07,6672,3122.01,4750.6,8072.83,15003.6,11648.7,4759.3,5763.35,3456.7,15021.84,8553.79,5633.24,5641.94,18864.62,3433.5,819.66,3034.58,6379.63,1677.8,3081.91,220.34,3175.58,1688.49,466.1,537.11,2209.09],
    2003:[5007.21,2578.03,6921.29,2855.23,2388.38,6002.54,2662.08,4057.4,6694.23,12442.87,9705.02,3923.11,4983.67,2807.41,12078.15,6867.7,4757.45,4659.99,15844.64,2821.11,713.96,2555.72,5333.09,1426.34,2556.02,185.09,2587.72,1399.83,390.2,445.36,1886.35],
    2002:[4315,2150.76,6018.28,2324.8,1940.94,5458.22,2348.54,3637.2,5741.03,10606.85,8003.67,3519.72,4467.55,2450.48,10275.5,6035.48,4212.82,4151.54,13502.42,2523.73,642.73,2232.86,4725.01,1243.43,2312.82,162.04,2253.39,1232.03,340.65,377.16,1612.6]
});

dataMap.dataEducation = dataFormatter({
    //max : 4000,
    2011:[136.27,159.72,2905.73,641.42,1306.3,1915.57,1277.44,1701.5,124.94,3064.78,1583.04,2015.31,1612.24,1391.07,3973.85,3512.24,2569.3,2768.03,2665.2,2047.23,659.23,844.52,2983.51,726.22,1411.01,74.47,1220.9,678.75,155.08,184.14,1139.03],
    2010:[124.36,145.58,2562.81,554.48,1095.28,1631.08,1050.15,1302.9,114.15,2540.1,1360.56,1729.02,1363.67,1206.98,3588.28,3258.09,2147,2325.5,2286.98,1675.06,539.83,685.38,2482.89,625.03,1108.38,68.72,988.45,599.28,134.92,159.29,1078.63],
    2009:[118.29,128.85,2207.34,477.59,929.6,1414.9,980.57,1154.33,113.82,2261.86,1163.08,1495.45,1182.74,1098.66,3226.64,2769.05,1795.9,1969.69,2010.27,1458.49,462.19,606.8,2240.61,550.27,1067.6,63.88,789.64,497.05,107.4,127.25,759.74],
    2008:[112.83,122.58,2034.59,313.58,907.95,1302.02,916.72,1088.94,111.8,2100.11,1095.96,1418.09,1158.17,1060.38,3002.65,2658.78,1780,1892.4,1973.05,1453.75,436.04,575.4,2216.15,539.19,1020.56,60.62,753.72,462.27,105.57,118.94,691.07],
    2007:[101.26,110.19,1804.72,311.97,762.1,1133.42,783.8,915.38,101.84,1816.31,986.02,1200.18,1002.11,905.77,2509.14,2217.66,1378,1626.48,1695.57,1241.35,361.07,482.39,2032,446.38,837.35,54.89,592.63,387.55,83.41,97.89,628.72],
    2006:[88.8,103.35,1461.81,276.77,634.94,939.43,672.76,750.14,93.81,1545.05,925.1,1011.03,865.98,786.14,2138.9,1916.74,1140.41,1272.2,1532.17,1032.47,323.48,386.38,1595.48,382.06,724.4,50.9,484.81,334,67.55,79.54,527.8],
    2005:[88.68,112.38,1400,262.42,589.56,882.41,625.61,684.6,90.26,1461.51,892.83,966.5,827.36,727.37,1963.51,1892.01,1082.13,1100.65,1428.27,912.5,300.75,463.4,1481.14,368.94,661.69,48.04,435.77,308.06,65.34,72.07,509.99],
    2004:[87.36,105.28,1370.43,276.3,522.8,798.43,568.69,605.79,83.45,1367.58,814.1,950.5,786.84,664.5,1778.45,1649.29,1020.09,1022.45,1248.59,817.88,278.76,428.05,1379.93,334.5,607.75,44.3,387.88,286.78,60.7,65.33,461.26],
    2003:[84.11,89.91,1064.05,215.19,420.1,615.8,488.23,504.8,81.02,1162.45,717.85,749.4,692.94,560,1480.67,1198.7,798.35,886.47,1072.91,658.78,244.29,339.06,1128.61,298.69,494.6,40.7,302.66,237.91,48.47,55.63,412.9],
    2002:[82.44,84.21,956.84,197.8,374.69,590.2,446.17,474.2,79.68,1110.44,685.2,783.66,664.78,535.98,1390,1288.36,707,847.25,1015.08,601.99,222.89,317.87,1047.95,281.1,463.44,39.75,282.21,215.51,47.31,52.95,305]
});

dataMap.dataCulture = dataFormatter({
    //max : 26600,
    2011:[3752.48,5928.32,13126.86,6635.26,8037.69,12152.15,5611.48,5962.41,7927.89,25203.28,16555.58,8309.38,9069.2,6390.55,24017.11,15427.08,9815.94,9361.99,26447.38,5675.32,714.5,5543.04,11029.13,2194.33,3780.32,208.79,6935.59,2377.83,975.18,1056.15,3225.9],
    2010:[3388.38,4840.23,10707.68,5234,6367.69,9976.82,4506.31,5025.15,7218.32,21753.93,14297.93,6436.62,7522.83,5122.88,21238.49,13226.38,7767.24,7343.19,23014.53,4511.68,571,4359.12,8672.18,1800.06,3223.49,163.92,5446.1,1984.97,744.63,827.91,2592.15],
    2009:[2855.55,3987.84,8959.83,3993.8,5114,7906.34,3541.92,4060.72,6001.78,18566.37,11908.49,4905.22,6005.3,3919.45,18901.83,11010.5,6038.08,5687.19,19419.7,3381.54,443.43,3448.77,6711.87,1476.62,2582.53,136.63,4236.42,1527.24,575.33,662.32,1929.59],
    2008:[2626.41,3709.78,8701.34,4242.36,4376.19,7158.84,3097.12,4319.75,6085.84,16993.34,11567.42,4198.93,5318.44,3554.81,17571.98,10259.99,5082.07,5028.93,18502.2,3037.74,423.55,3057.78,5823.39,1370.03,2452.75,115.56,3861.12,1470.34,557.12,609.98,2070.76],
    2007:[2509.4,2892.53,7201.88,3454.49,3193.67,5544.14,2475.45,3695.58,5571.06,14471.26,10154.25,3370.96,4476.42,2975.53,14647.53,8282.83,4143.06,3977.72,16004.61,2425.29,364.26,2368.53,4648.79,1124.79,2038.39,98.48,2986.46,1279.32,419.03,455.04,1647.55],
    2006:[2191.43,2457.08,6110.43,2755.66,2374.96,4566.83,1915.29,3365.31,4969.95,12282.89,8511.51,2711.18,3695.04,2419.74,12574.03,6724.61,3365.08,3187.05,13469.77,1878.56,308.62,1871.65,3775.14,967.54,1705.83,80.1,2452.44,1043.19,331.91,351.58,1459.3],
    2005:[2026.51,2135.07,5271.57,2357.04,1773.21,3869.4,1580.83,2971.68,4381.2,10524.96,7164.75,2245.9,3175.92,1917.47,10478.62,5514.14,2852.12,2612.57,11356.6,1510.68,240.83,1564,3067.23,821.16,1426.42,63.52,1951.36,838.56,264.61,281.05,1164.79],
    2004:[1853.58,1685.93,4301.73,1919.4,1248.27,3061.62,1329.68,2487.04,3892.12,8437.99,6250.38,1844.9,2770.49,1566.4,8478.69,4182.1,2320.6,2190.54,9280.73,1253.7,205.6,1376.91,2489.4,681.5,1281.63,52.74,1553.1,713.3,211.7,244.05,914.47],
    2003:[1487.15,1337.31,3417.56,1463.38,967.49,2898.89,1098.37,2084.7,3209.02,6787.11,5096.38,1535.29,2340.82,1204.33,6485.05,3310.14,1956.02,1777.74,7592.78,984.08,175.82,1135.31,2014.8,569.37,1047.66,47.64,1221.17,572.02,171.92,194.27,719.54],
    2002:[1249.99,1069.08,2911.69,1134.31,754.78,2609.85,943.49,1843.6,2622.45,5604.49,4090.48,1337.04,2036.97,941.77,5184.98,2768.75,1709.89,1523.5,6143.4,846.89,148.88,958.87,1733.38,481.96,934.88,32.72,1007.56,501.69,144.51,153.06,603.15]
});

dataMap.dataOthers = dataFormatter({
    //max : 25000,
    2011:[12363.18,5219.24,8483.17,3960.87,5015.89,8158.98,3679.91,4918.09,11142.86,20842.21,14180.23,4975.96,6878.74,3921.2,17370.89,7991.72,7247.02,7539.54,24097.7,3998.33,1148.93,3623.81,7014.04,2781.29,3701.79,322.57,4355.81,1963.79,540.18,861.92,2245.12],
    2010:[10600.84,4238.65,7123.77,3412.38,4209.03,6849.37,3111.12,4040.55,9833.51,17131.45,12063.82,4193.69,5850.62,3121.4,14343.14,6607.89,6053.37,6369.27,20711.55,3383.11,953.67,2881.08,6030.41,2177.07,2892.31,274.82,3688.93,1536.5,470.88,702.45,1766.69],
    2009:[9179.19,3405.16,6068.31,2886.92,3696.65,5891.25,2756.26,3371.95,8930.85,13629.07,9918.78,3662.15,5048.49,2637.07,11768.18,5700.91,5127.12,5402.81,18052.59,2919.13,748.59,2474.44,5198.8,1885.79,2519.62,240.85,3143.74,1363.27,398.54,563.74,1587.72],
    2008:[8375.76,2886.65,5276.04,2759.46,3212.06,5207.72,2412.26,2905.68,7872.23,11888.53,8799.31,3234.64,4346.4,2355.86,10358.64,5099.76,4466.85,4633.67,16321.46,2529.51,643.47,2160.48,4561.69,1652.34,2218.81,218.67,2699.74,1234.21,355.93,475,1421.38],
    2007:[7236.15,2250.04,4600.72,2257.99,2467.41,4486.74,2025.44,2493.04,6821.11,9730.91,7613.46,2789.78,3770,1918.95,8620.24,4511.97,3812.34,3835.4,14076.83,2156.76,528.84,1825.21,3881.6,1312.94,1896.78,188.06,2178.2,1037.11,294.91,366.18,1246.89],
    2006:[5837.55,1902.31,3895.36,1846.18,1934.35,3798.26,1687.07,2096.35,5508.48,7914.11,6281.86,2390.29,3022.83,1614.65,7187.26,3721.44,3111.98,3229.42,11585.82,1835.12,433.57,1649.2,3319.62,989.38,1557.91,159.76,1806.36,900.16,249.04,294.78,1058.16],
    2005:[4854.33,1658.19,3340.54,1611.07,1542.26,3295.45,1413.83,1857.42,4776.2,6612.22,5360.1,2137.77,2551.41,1411.92,5924.74,3181.27,2655.94,2882.88,9772.5,1560.92,377.17,1440.32,2836.73,815.32,1374.62,137.24,1546.59,787.36,213.37,259.49,929.41],
    2004:[4092.27,1319.76,2805.47,1375.67,1270,2811.95,1223.64,1657.77,4097.26,5198.03,4584.22,1963.9,2206.02,1225.8,4764.7,2722.4,2292.55,2428.95,8335.3,1361.92,335.3,1229.62,2510.3,661.8,1192.53,123.3,1234.6,688.41,193.7,227.73,833.36],
    2003:[3435.95,1150.81,2439.68,1176.65,1000.79,2487.85,1075.48,1467.9,3404.19,4493.31,3890.79,1638.42,1949.91,1043.08,4112.43,2358.86,2003.08,1995.78,7178.94,1178.25,293.85,1081.35,2189.68,558.28,1013.76,96.76,1063.89,589.91,169.81,195.46,753.91],
    2002:[2982.57,997.47,2149.75,992.69,811.47,2258.17,958.88,1319.4,3038.9,3891.92,3227.99,1399.02,1765.8,972.73,3700.52,1978.37,1795.93,1780.79,6343.94,1074.85,270.96,956.12,1943.68,480.37,914.5,89.56,963.62,514.83,148.83,171.14,704.5]
});

dataMap.dataEstate = dataFormatter({
    //max : 3600,
    2011:[1074.93,411.46,918.02,224.91,384.76,876.12,238.61,492.1,1019.68,2747.89,1677.13,634.92,911.16,402.51,1838.14,987,634.67,518.04,3321.31,465.68,208.71,396.28,620.62,160.3,222.31,17.44,398.03,134.25,29.05,79.01,176.22],
    2010:[1006.52,377.59,697.79,192,309.25,733.37,212.32,391.89,1002.5,2600.95,1618.17,532.17,679.03,340.56,1622.15,773.23,564.41,464.21,2813.95,405.79,188.33,266.38,558.56,139.64,223.45,14.54,315.95,110.02,25.41,60.53,143.44],
    2009:[1062.47,308.73,612.4,173.31,286.65,605.27,200.14,301.18,1237.56,2025.39,1316.84,497.94,656.61,305.9,1329.59,622.98,546.11,400.11,2470.63,348.98,121.76,229.09,548.14,136.15,205.14,13.28,239.92,101.37,23.05,47.56,115.23],
    2008:[844.59,227.88,513.81,166.04,273.3,500.81,182.7,244.47,939.34,1626.13,1052.03,431.27,506.98,281.96,1104.95,512.42,526.88,340.07,2057.45,282.96,95.6,191.21,453.63,104.81,195.48,15.08,193.27,93.8,19.96,38.85,89.79],
    2007:[821.5,183.44,467.97,134.12,191.01,410.43,153.03,225.81,958.06,1365.71,981.42,366.57,511.5,225.96,953.69,447.44,409.65,301.8,2029.77,239.45,67.19,196.06,376.84,93.19,193.59,13.24,153.98,83.52,16.98,29.49,91.28],
    2006:[658.3,156.64,397.14,117.01,136.5,318.54,131.01,194.7,773.61,1017.91,794.41,281.98,435.22,184.67,786.51,348.7,294.73,254.81,1722.07,192.2,44.45,158.2,336.2,80.24,165.92,11.92,125.2,73.21,15.17,25.53,68.9],
    2005:[493.73,122.67,330.87,106,98.75,256.77,112.29,163.34,715.97,799.73,688.86,231.66,331.8,171.88,664.9,298.19,217.17,215.63,1430.37,165.05,38.2,143.88,286.23,76.38,148.69,10.02,108.62,63.78,14.1,22.97,55.79],
    2004:[436.11,106.14,231.08,95.1,73.81,203.1,97.93,137.74,666.3,534.17,587.83,188.28,248.44,167.2,473.27,236.44,204.8,191.5,1103.75,122.52,30.64,129.12,264.3,68.3,116.54,5.8,95.9,56.84,13,20.78,53.55],
    2003:[341.88,92.31,185.19,78.73,61.05,188.49,91.99,127.2,487.82,447.47,473.16,162.63,215.84,138.02,418.21,217.58,176.8,186.49,955.66,100.93,25.14,113.69,231.72,59.86,103.79,4.35,83.9,48.09,11.41,16.85,47.84],
    2002:[298.02,73.04,140.89,65.83,51.48,130.94,76.11,118.7,384.86,371.09,360.63,139.18,188.09,125.27,371.13,199.31,145.17,165.29,808.16,82.83,21.45,90.48,210.82,53.49,95.68,3.42,77.68,41.52,9.74,13.46,43.04]
});

dataMap.dataFinancial = dataFormatter({
    //max : 3200,
    2011:[2215.41,756.5,746.01,519.32,447.46,755.57,207.65,370.78,2277.4,2600.11,2730.29,503.85,862.41,357.44,1640.41,868.2,674.57,501.09,2916.13,445.37,105.24,704.66,868.15,297.27,456.23,31.7,432.11,145.05,62.56,134.18,288.77],
    2010:[1863.61,572.99,615.42,448.3,346.44,639.27,190.12,304.59,1950.96,2105.92,2326.58,396.17,767.58,241.49,1361.45,697.68,561.27,463.16,2658.76,384.53,78.12,496.56,654.7,231.51,375.08,27.08,384.75,100.54,54.53,97.87,225.2],
    2009:[1603.63,461.2,525.67,361.64,291.1,560.2,180.83,227.54,1804.28,1596.98,1899.33,359.6,612.2,165.1,1044.9,499.92,479.11,402.57,2283.29,336.82,65.73,389.97,524.63,194.44,351.74,23.17,336.21,88.27,45.63,75.54,198.87],
    2008:[1519.19,368.1,420.74,290.91,219.09,455.07,147.24,177.43,1414.21,1298.48,1653.45,313.81,497.65,130.57,880.28,413.83,393.05,334.32,1972.4,249.01,47.33,303.01,411.14,151.55,277.66,22.42,287.16,72.49,36.54,64.8,171.97],
    2007:[1302.77,288.17,347.65,218.73,148.3,386.34,126.03,155.48,1209.08,1054.25,1251.43,223.85,385.84,101.34,734.9,302.31,337.27,260.14,1705.08,190.73,34.43,247.46,359.11,122.25,168.55,11.51,231.03,61.6,27.67,51.05,149.22],
    2006:[982.37,186.87,284.04,169.63,108.21,303.41,100.75,74.17,825.2,653.25,906.37,166.01,243.9,79.75,524.94,219.72,174.99,204.72,899.91,129.14,16.37,213.7,299.5,89.43,143.62,6.44,152.25,50.51,23.69,36.99,99.25],
    2005:[840.2,147.4,213.47,135.07,72.52,232.85,83.63,35.03,675.12,492.4,686.32,127.05,186.12,69.55,448.36,181.74,127.32,162.37,661.81,91.93,13.16,185.18,262.26,73.67,130.5,7.57,127.58,44.73,20.36,32.25,80.34],
    2004:[713.79,136.97,209.1,110.29,55.89,188.04,77.17,32.2,612.45,440.5,523.49,94.1,171,65.1,343.37,170.82,118.85,118.64,602.68,74,11.56,162.38,236.5,60.3,118.4,5.4,90.1,42.99,19,27.92,70.3],
    2003:[635.56,112.79,199.87,118.48,55.89,145.38,73.15,32.2,517.97,392.11,451.54,87.45,150.09,64.31,329.71,165.11,107.31,99.35,534.28,61.59,10.68,147.04,206.24,48.01,105.48,4.74,77.87,42.31,17.98,24.8,64.92],
    2002:[561.91,76.86,179.6,124.1,48.39,137.18,75.45,31.6,485.25,368.86,347.53,81.85,138.28,76.51,310.07,158.77,96.95,92.43,454.65,35.86,10.08,134.52,183.13,41.45,102.39,2.81,67.3,42.08,16.75,21.45,52.18]
});


var dataMap = {};
function dataFormatter(obj) {
    var pList = ['北京','天津','河北','山西','内蒙古','辽宁','吉林','黑龙江','上海','江苏','浙江','安徽','福建','江西','山东','河南','湖北','湖南','广东','广西','海南','重庆','四川','贵州','云南','西藏','陕西','甘肃','青海','宁夏','新疆'];
    var temp;
    var max = 0;
    for (var year in obj) {
        temp = obj[year];
        for (var i = 0, l = temp.length; i < l; i++) {
            max = Math.max(max, temp[i]);
            obj[year][i] = {
                name : pList[i],
                value : temp[i]
            }
        }
        obj[year+'max'] = Math.floor(max/100) * 100;
    }
    return obj;
}


qsDataAnalysisApp.controller("importQsscDataCtrl",["$scope","$http","$rootScope","$state","$interval","ScscInstance",function($scope,$http,$rootScope,$state,$interval,ScscInstance){
    $rootScope.showChang = false;
    $scope.isSubmitReview = false;

    $rootScope.bigTitle = "导入科技园"
}]);
var eColorMap = {
    'Internet' : ['#1e10ef','#2effff'],
    'Financial':['#eff735','#ff7f50'],
    'Estate' :['#d1f63a','#ea70d6'],
    'Education' :['#fad416','#42cd32'],
    'Culture' :['#6415ac','#7495ed'],
    'Others' :['#effa4b','#ff69b4']
};

var eNameMap = {
    'Internet' : '互联网',
    'Financial' : '金融',
    'Estate' : '房地产',
    'Education' : '教育',
    'Culture' : '文化娱乐',
    'Others' : '其它'
};

var curYear ="2002";

function option2 (name) {
    var option = {
        title : {
            x: 'center',
            y: 'top',
            textStyle:{
                fontSize: 14
            }
        },
        tooltip : {
            trigger: 'item'
        },
        dataRange: {
            show:true,
            textStyle:{
                color:"#fff"
            },
            min: 0,
            itemWidth:8,
            itemGap: 5,
            x: 'left',
            y: 'bottom'
        },
        series : [
            {
                type: 'map',
                mapType: 'china'
            }
        ]
    };
    var color = eColorMap[name];
    option.title.text = eNameMap[name] + ' (万)';
    option.title.textStyle.color = color[0];
    option.dataRange.color = color;
    option.dataRange.max = dataMap['data' + name][curYear + 'max'];
    
    for (var i = 0, l = option.series.length; i < l; i++) {
        option.series[i].name = eNameMap[name] + '(' + curYear + ')';
        option.series[i].data = dataMap['data' + name][curYear]
    }
    
    return option;
}
qsDataAnalysisApp.controller("qsSccsAddCompanyController",["$scope","$http","$rootScope","$state","$interval","ScscInstance",function($scope,$http,$rootScope,$state,$interval,ScscInstance){

    $scope.isSubmitReview = false;

    $scope.submitCompanyReview = function(){
        $scope.isSubmitReview = true;
        stopTime = $interval(function(){
            $state.go("qs100.sccsAddCompany",{},{reload:true});
            $scope.isSubmitReview = false;
            $interval.cancel(stopTime);
        },3000);

        var ii=0;
        $scope.setTime=3
        var tt=setInterval(function(){
            ii++;
            if(ii===3){
                clearInterval(tt);
            }
            $scope.setTime--;
            $scope.$apply();
        },1000)
    }

    $scope.closeSubmitReview = function(){
        $scope.isSubmitReview = false;
    }


    $rootScope.showChang=false;

    //$scope.pageClass="scscAddCompany"
    $scope.years=[
        {
            name:2008,
            key:1
        },
        {
            name:2009,
            key:2
        },
        {
            name:2010,
            key:2
        },
        {
            name:2011,
            key:2
        },
        {
            name:2012,
            key:2
        },
        {
            name:2013,
            key:2
        },
        {
            name:2014,
            key:2
        },
        {
            name:2015,
            key:2
        }
    ];
    $scope.newYear=1;
    $scope.changeYear=function(v){
        //debugger;
    }
    $scope.months=[
        {
            name:01,
            key:1
        },
        {
            name:02,
            key:2
        },
        {
            name:03,
            key:3
        },
        {
            name:04,
            key:4
        },
        {
            name:05,
            key:5
        },
        {
            name:06,
            key:6
        },
        {
            name:07,
            key:7
        },
        {
            name:08,
            key:8
        },
        {
            name:09,
            key:9
        },
        {
            name:10,
            key:10
        },
        {
            name:11,
            key:11
        },
        {
            name:12,
            key:12
        }
    ];
    $scope.changeMonth=function(v){
        //debugger;
    };
    $scope.newMonth=1;
    $scope.states=[
        {
            name:"运营中",
            key:1
        },
        {
            name:"未上线",
            key:2
        },
        {
            name:"已关闭",
            key:3
        },
        {
            name:"已转型",
            key:4
        }
    ];
    $scope.changeState=function(v){
        //debugger;
    };
    $scope.newState=1;


    $scope.fields=[
        {
            name:"教育",
            key:1
        },
        {
            name:"金融",
            key:2
        },
        {
            name:"汽车交通",
            key:3
        },
        {
            name:"房产服务",
            key:4
        },
        {
            name:"医疗健康",
            key:5
        },
        {
            name:"旅游",
            key:6
        },
        {
            name:"本地生活",
            key:7
        },
        {
            name:"游戏",
            key:8
        },
        {
            name:"硬件",
            key:9
        },
        {
            name:"企业服务",
            key:10
        },
        {
            name:"电子商务",
            key:11
        },
        {
            name:"工具软件",
            key:12
        },
        {
            name:"移动互联网",
            key:13
        },
        {
            name:"体育运动",
            key:14
        },
        {
            name:"物流",
            key:15
        },
    ];
    $scope.changeField=function(v){
        //debugger;
    };
    $scope.newField=1;


    $scope.roles=[

        {
            name:"创始人",
            key:1
        },
        {
            name:"员工",
            key:2
        },
        {
            name:"投资人",
            key:3
        },
        {
            name:"用户",
            key:4
        },
        {
            name:"发现者",
            key:5
        }
    ];
    $scope.changeRole=function(v){
        //debugger;
    };
    $scope.newRole=1;


    $scope.moneys=[

        {
            name:"不明确",
            key:1
        },
        {
            name:"需要融资",
            key:2
        },
        {
            name:"不需要融资",
            key:3
        },
        {
            name:"寻求被收购",
            key:4
        },
        {
            name:"发现者",
            key:5
        }
    ];
    $scope.changeMoney=function(v){
        //debugger;
    };
    $scope.newMoney=1;
}]);
qsDataAnalysisApp.controller("qsSccsAddHatchController",["$scope","$http","$rootScope","$state","$interval","ScscInstance",function($scope,$http,$rootScope,$state,$interval,ScscInstance){

    $scope.isSubmitReview = false;

    $scope.submitIncubatorReview = function(){
        $scope.isSubmitReview = true;
        stopTime = $interval(function(){
            $state.go("qs100.sccsAddHatch",{},{reload:true});
            $scope.isSubmitReview = false;
            $interval.cancel(stopTime);
        },3000);

        var ii=0;
        $scope.setTime=3
        var tt=setInterval(function(){
            ii++;
            if(ii===3){
                clearInterval(tt);
            }
            $scope.setTime--;
            $scope.$apply();
        },1000)
    }

    $scope.closeSubmitReview = function(){
        $scope.isSubmitReview = false;
    }

    $rootScope.showChang=false;

    //$scope.pageClass="scscAddCompany"
    $scope.years=[
        {
            name:2008,
            key:1
        },
        {
            name:2009,
            key:2
        },
        {
            name:2010,
            key:2
        },
        {
            name:2011,
            key:2
        },
        {
            name:2012,
            key:2
        },
        {
            name:2013,
            key:2
        },
        {
            name:2014,
            key:2
        },
        {
            name:2015,
            key:2
        }
    ];
    $scope.newYear=1;
    $scope.changeYear=function(v){
        //debugger;
    }
    $scope.months=[
        {
            name:01,
            key:1
        },
        {
            name:02,
            key:2
        },
        {
            name:03,
            key:3
        },
        {
            name:04,
            key:4
        },
        {
            name:05,
            key:5
        },
        {
            name:06,
            key:6
        },
        {
            name:07,
            key:7
        },
        {
            name:08,
            key:8
        },
        {
            name:09,
            key:9
        },
        {
            name:10,
            key:10
        },
        {
            name:11,
            key:11
        },
        {
            name:12,
            key:12
        }
    ];
    $scope.changeMonth=function(v){
        //debugger;
    };
    $scope.newMonth=1;
    $scope.states=[
        {
            name:"运营中",
            key:1
        },
        {
            name:"未上线",
            key:2
        },
        {
            name:"已关闭",
            key:3
        },
        {
            name:"已转型",
            key:4
        }
    ];
    $scope.changeState=function(v){
        //debugger;
    };
    $scope.newState=1;


    $scope.fields=[
        {
            name:"教育",
            key:1
        },
        {
            name:"金融",
            key:2
        },
        {
            name:"汽车交通",
            key:3
        },
        {
            name:"房产服务",
            key:4
        },
        {
            name:"医疗健康",
            key:5
        },
        {
            name:"旅游",
            key:6
        },
        {
            name:"本地生活",
            key:7
        },
        {
            name:"游戏",
            key:8
        },
        {
            name:"硬件",
            key:9
        },
        {
            name:"企业服务",
            key:10
        },
        {
            name:"电子商务",
            key:11
        },
        {
            name:"工具软件",
            key:12
        },
        {
            name:"移动互联网",
            key:13
        },
        {
            name:"体育运动",
            key:14
        },
        {
            name:"物流",
            key:15
        },
    ];
    $scope.changeField=function(v){
        //debugger;
    };
    $scope.newField=1;


    $scope.roles=[

        {
            name:"创始人",
            key:1
        },
        {
            name:"员工",
            key:2
        },
        {
            name:"投资人",
            key:3
        },
        {
            name:"用户",
            key:4
        },
        {
            name:"发现者",
            key:5
        }
    ];
    $scope.changeRole=function(v){
        //debugger;
    };
    $scope.newRole=1;


    $scope.moneys=[

        {
            name:"不明确",
            key:1
        },
        {
            name:"需要融资",
            key:2
        },
        {
            name:"不需要融资",
            key:3
        },
        {
            name:"寻求被收购",
            key:4
        },
        {
            name:"发现者",
            key:5
        }
    ];
    $scope.changeMoney=function(v){
        //debugger;
    };
    $scope.newMoney=1;
}]);
qsDataAnalysisApp.controller("qsSccsAddQSTPController",["$scope","$http","$rootScope","$state","$interval","$location","ScscInstance",function($scope,$http,$rootScope,$state,$interval,$location,ScscInstance){

    $scope.isSubmitReview = false;

    $scope.submitStparkReview = function(){
        $scope.isSubmitReview = true;
        stopTime = $interval(function(){
            $state.go("qs100.sccsAddQSTP",{},{reload:true});
            $scope.isSubmitReview = false;
            $interval.cancel(stopTime);
        },3000);

        var ii=0;
        $scope.setTime=3
        var tt=setInterval(function(){
            ii++;
            if(ii===3){
                clearInterval(tt);
            }
            $scope.setTime--;
            $scope.$apply();
        },1000)
    }

    $scope.closeSubmitReview = function(){
        $scope.isSubmitReview = false;
    }

    $rootScope.showChang=false;

    //$scope.pageClass="scscAddCompany"
    $scope.years=[
        {
            name:2008,
            key:1
        },
        {
            name:2009,
            key:2
        },
        {
            name:2010,
            key:2
        },
        {
            name:2011,
            key:2
        },
        {
            name:2012,
            key:2
        },
        {
            name:2013,
            key:2
        },
        {
            name:2014,
            key:2
        },
        {
            name:2015,
            key:2
        }
    ];
    $scope.newYear=1;
    $scope.changeYear=function(v){
        //debugger;
    }
    $scope.months=[
        {
            name:01,
            key:1
        },
        {
            name:02,
            key:2
        },
        {
            name:03,
            key:3
        },
        {
            name:04,
            key:4
        },
        {
            name:05,
            key:5
        },
        {
            name:06,
            key:6
        },
        {
            name:07,
            key:7
        },
        {
            name:08,
            key:8
        },
        {
            name:09,
            key:9
        },
        {
            name:10,
            key:10
        },
        {
            name:11,
            key:11
        },
        {
            name:12,
            key:12
        }
    ];
    $scope.changeMonth=function(v){
        //debugger;
    };
    $scope.newMonth=1;
    $scope.states=[
        {
            name:"运营中",
            key:1
        },
        {
            name:"未上线",
            key:2
        },
        {
            name:"已关闭",
            key:3
        },
        {
            name:"已转型",
            key:4
        }
    ];
    $scope.changeState=function(v){
        //debugger;
    };
    $scope.newState=1;


    $scope.fields=[
        {
            name:"教育",
            key:1
        },
        {
            name:"金融",
            key:2
        },
        {
            name:"汽车交通",
            key:3
        },
        {
            name:"房产服务",
            key:4
        },
        {
            name:"医疗健康",
            key:5
        },
        {
            name:"旅游",
            key:6
        },
        {
            name:"本地生活",
            key:7
        },
        {
            name:"游戏",
            key:8
        },
        {
            name:"硬件",
            key:9
        },
        {
            name:"企业服务",
            key:10
        },
        {
            name:"电子商务",
            key:11
        },
        {
            name:"工具软件",
            key:12
        },
        {
            name:"移动互联网",
            key:13
        },
        {
            name:"体育运动",
            key:14
        },
        {
            name:"物流",
            key:15
        },
    ];
    $scope.changeField=function(v){
        //debugger;
    };
    $scope.newField=1;


    $scope.roles=[

        {
            name:"创始人",
            key:1
        },
        {
            name:"员工",
            key:2
        },
        {
            name:"投资人",
            key:3
        },
        {
            name:"用户",
            key:4
        },
        {
            name:"发现者",
            key:5
        }
    ];
    $scope.changeRole=function(v){
        //debugger;
    };
    $scope.newRole=1;


    $scope.moneys=[

        {
            name:"不明确",
            key:1
        },
        {
            name:"需要融资",
            key:2
        },
        {
            name:"不需要融资",
            key:3
        },
        {
            name:"寻求被收购",
            key:4
        },
        {
            name:"发现者",
            key:5
        }
    ];
    $scope.changeMoney=function(v){
        //debugger;
    };
    $scope.newMoney=1;
}]);
qsDataAnalysisApp.controller("qsSccsInnovativeVentureController",["$scope","$http","$rootScope","$state","$interval","ScscInstance",function($scope,$http,$rootScope,$state,$interval,ScscInstance){

    var westSCLayer = null;

    var westSCFeatureArray = [];

    $.ajax({
        url:"modules/sccs/data/westSC.json",
        dataType:"json",
        async:false,
        success:function(result){
            $.each(result,function(){

                var olFeature = new ol.Feature({
                    type:"westSC",
                    name:this.baseName,
                    geometry: new ol.geom.Point([this.lon, this.lat]),
                });

                olFeature.setStyle(new ol.style.Style({
                        text: new ol.style.Text({
                            font:"16px serif",
                            text:"西部双创\n"+olFeature.get("name"),
                            textAlign:"left",
                            offsetX:0,
                            offsetY:-15
                        }),
                        image: new ol.style.Circle({
                            radius: 6,
                            stroke:new ol.style.Stroke({color: 'black'}),
                            fill: new ol.style.Fill({
                                color: 'green'
                            })
                        })
                    })
                );

                westSCFeatureArray.push(olFeature);
            });

            var westSCSource = new ol.source.Vector({
                features: westSCFeatureArray
            });

            westSCLayer = new ol.layer.Vector({
                source: westSCSource
            });
        }
    });

    var featureArray = [];

    $.getJSON("modules/sccs/data/wzcx.json",function(result){
        $.each(result,function(){

            var olFeature = new ol.Feature({
                type:"wzcx",
                provinceName:this.provinceName,
                baseName:this.baseName,
                geometry: new ol.geom.Point([this.lon, this.lat]),
            });

            olFeature.setStyle(new ol.style.Style({
                    text: new ol.style.Text({
                        font:"16px serif",
                        text:olFeature.get("provinceName")+"--万众创新\n"+olFeature.get("baseName"),
                        textAlign:"left",
                        stroke:new ol.style.Stroke({color:'rgba(220,20,60,0.6)'}),
                        file:ol.style.Fill({color:'black'}),
                        offsetX:0,
                        offsetY:-15
                    }),
                    image: new ol.style.Circle({
                        radius: 6,
                        stroke:new ol.style.Stroke({color: 'black'}),
                        fill: new ol.style.Fill({
                            color: 'rgba(220,20,60,0.6)'
                        })
                    })
                })
            );

            featureArray.push(olFeature);
        });


        var source = new ol.source.Vector({
            features: featureArray
        });

        var layer = new ol.layer.Vector({
            source: source
        });

        var layer1 = new ol.layer.Tile({
            opacity:1,
            source: new ol.source.OSM()
        });

        var map = new ol.Map({
            layers: [layer1,layer,westSCLayer],
            target: 'innovativeVenture',
            view: new ol.View({
                center: [108.06, 35.63],
                projection:'EPSG:4326',
                zoom: 5
            })
        });

        map.on('click', function(evt) {
            var feature = map.forEachFeatureAtPixel(evt.pixel,
                function(feature) {
                    return feature;
                });
            if(feature){
                var type = feature.get("type");
                if(type == "westSC"){
                    console.log(feature.get("name"));
                }else if(type == "wzcx"){
                    console.log(feature.get("baseName"));
                }
            }
        });

        //westSCLayer.on("render",function(e){
        //    console.log(e.target);
        //})


    });

}]);
qsDataAnalysisApp.controller("qsSccsMapController",["$scope","$http","$rootScope","$state","ScscInstance",function($scope,$http,$rootScope,$state,ScscInstance){

    (function () {
        function resize() {
            $('#main').height($(window).height() - $('#header').height());
        }

        $(window).resize(resize);
        resize();

        $(document).ready(function () {
            loadScript([
                'static/assets/echarts-x/doc/lib/echarts-x/echarts-x.js',
                'static/assets/echarts-x/doc/lib/echarts/echarts.js',
                'static/assets/echarts-x/doc/lib/echarts/chart/map.js'
            ], function () {
                require.config({
                    paths: {
                        'echarts-x': 'static/assets/echarts-x/doc/lib/echarts-x',
                        'echarts': 'static/assets/echarts-x/doc/lib/echarts'
                    }
                });

                boot();
            });
        });

        window.refresh;

        function boot() {
            require(['modules/sccs/js/map'],function(obj){
                obj.myChart.on("click",function(e){
                    $scope.toProvince(e);
                });
                window.refresh = obj.refresh;
            });
            if(window.refresh){
                window.refresh().on("click",function(e){
                    $scope.toProvince(e);
                });
            }
        }


        function loadScript(urlList, onload) {
            var count = urlList.length;
            for (var i = 0; i < urlList.length; i++) {
                var script = document.createElement('script');
                script.src = urlList[i];
                script.onload = function () {
                    count--;
                    if (count === 0) {
                        onload && onload();
                    }
                }
                document.getElementsByTagName('head')[0].appendChild(script);
            }
        }
    })();

    $scope.toProvince=function(event){
        var province = event.name;
        $state.transitionTo("qs100.scscProvince",{province:angular.toJson(province)});
    };

    //跨控制器通讯，基于服务
    $scope.$watch(function(){
        return ScscInstance.cityIndexList;
    },function(newVal){
        //console.log(newVal);
    },true);
    

}]);
qsDataAnalysisApp.controller("qsSccsEchartsMapController", ["$scope", "$http", "$rootScope", "$state", "ScscInstance", function ($scope, $http, $rootScope, $state, ScscInstance) {

    var mapChart;

    $scope.currentSeason = "2016年第1季度";




    $rootScope.showChang = true;
    $scope.pageClass="scscMapPage";

    var now = new Date();
    var year = now.getFullYear();
    var month = now.getMonth();
    var lastSeason = parseInt(month / 3);

    $scope.currentInstance = {
        indexMode: "",
        timeline: []
    };

    $scope.leftListArray = [];

    $scope.selectModeList = [
        {
            id:0,
            modeName: "provinceRankByComplexIndexOfSeason.do",
            displayName: "综合指数",
            text:"展示全国不同地区创新创业公司数量",
            active: true
        },
        {
            id:1,
            modeName: "provinceRankByIncubatorOfSeason.do",
            displayName: "孵化器数",
            text:"",
            active: false
        },
        {
            id:2,
            modeName: "provinceRankByIncubatorAreaOfSeason.do",
            displayName: "孵化面积",
            text:"",
            active: false
        },
        {
            id:3,
            modeName: "provinceRankByCompanyCountOfSeason.do",
            displayName: "企业数量",
            text:"",
            active: false},
        {
            id:4,
            modeName: "provinceRankByInvestOfSeason.do",
            displayName: "累计投资",
            text:"",
            active: false
        },
        {
            id:5,
            modeName: "provinceRankByIndustrialParkCountOfSeason.do",
            displayName: "科技园数量",
            text:"",
            active: false
        }

    ];

    $scope.selectModeValue = function (item,index) {
        if(index!==0) $(".tab-fore").hide();
        $scope.changeIndex=index;

        for (var i = 0; i < $scope.selectModeList.length; i++) {

            if ($scope.selectModeList[i] == item) {
                ScscInstance.item = item;
                $scope.item=item;
                $scope.selectModeList[i].active = true;
                $http.get(basePath + "/qs/" + $scope.selectModeList[i].modeName)
                    .success(function (response) {
                        if (response.state == 0) {
                            ScscInstance.orderedSeasonList = response.result;
                        }
                    });

            } else {
                $scope.selectModeList[i].active = false;
            }
        }
        $scope.newTab=$rootScope.coloeList[index];
    };
    $scope.selectModeValue($scope.selectModeList[0],0);


    //跨控制器通讯，基于服务
    $scope.$watch(function () {
        return ScscInstance.orderedSeasonList;
    }, function (orderedSeasonListInstance) {


        $scope.currentInstance.indexMode = ScscInstance.item.id;
        $scope.currentInstance.timeline = [];
        var i = 0;

        angular.forEach(orderedSeasonListInstance, function (season) {

            var timeLineInstance = {
                seasonName: "",
                seasonId: 0,
                orderedProvinceList: []
            };

            timeLineInstance.seasonName = ++i;

            var orderedProvinceList = [];
            angular.forEach(season.resultList, function (province) {
                if (province.name.indexOf("洲") == -1) {
                    if ($scope.currentInstance.indexMode == 0) {
                        orderedProvinceList.push({name: province.name, value: province.map.complexIndex});
                    } else if ($scope.currentInstance.indexMode == 1) {
                        orderedProvinceList.push({name: province.name, value: province.map.incubatorCount});
                    } else if ($scope.currentInstance.indexMode == 2) {
                        orderedProvinceList.push({name: province.name, value: province.map.incubatorArea});
                    } else if ($scope.currentInstance.indexMode == 3) {
                        orderedProvinceList.push({name: province.name, value: province.map.companyCount});
                    } else if ($scope.currentInstance.indexMode == 4) {
                        orderedProvinceList.push({name: province.name, value: province.map.investTotalSum});
                    } else if ($scope.currentInstance.indexMode == 5) {
                        orderedProvinceList.push({name: province.name, value: province.map.industrialParkCount});
                    } else if ($scope.currentInstance.indexMode == 6) {
                        orderedProvinceList.push({name: province.name, value: province.map.angelCount});
                    } else if ($scope.currentInstance.indexMode == 7) {
                        orderedProvinceList.push({name: province.name, value: province.map.aCount});
                    } else if ($scope.currentInstance.indexMode == 8) {
                        orderedProvinceList.push({name: province.name, value: province.map.bCount});
                    } else if ($scope.currentInstance.indexMode == 9) {
                        orderedProvinceList.push({name: province.name, value: province.map.cCount});
                    }
                }
            });

            timeLineInstance.orderedProvinceList = orderedProvinceList;

            $scope.currentInstance.timeline.push(timeLineInstance);

        });

        var currentOption = $scope.buildOption($scope.currentInstance);


        if (currentOption) {

            mapChart = echarts.init(document.getElementById("mainChart"),"shine");


            mapChart.setOption(currentOption, true);

            mapChart.on("click", function (e) {
                $(".tab-fore").hide();
                if(e.seriesType == "map" && e.componentSubType == "map"){
                    $scope.toProvince(e);
                }
            });

            $scope.leftListArray = [];

            var produceLeftList = function(instance){

                if(instance){
                    var srcArray = _.chunk(instance[instance.length-1].resultList, 10);
                    if(srcArray && srcArray.length >0){
                        $scope.leftListArray = srcArray[0];
                        $scope.leftListArrayTemp = [];

                        //获取TOP 10中的指数最大的数值
                        $scope.widthRule = 0;
                        angular.forEach($scope.leftListArray,function(item){
                            if (parseFloat(item.map.complexIndex) > $scope.widthRule) {
                                $scope.widthRule = parseFloat(item.map.complexIndex);
                            }
                        });

                        //与 $scope.defaultPanelWidth 比对 生成 实际宽度
                        angular.forEach($scope.leftListArray,function(item){
                            if(item.name.indexOf("洲")==-1){
                                var realWidth = ($scope.defaultPanelWidth * item.map.complexIndex) / $scope.widthRule;
                                var bColor = $rootScope.coloeList[$scope.changeIndex].lists[parseInt($scope.widthRule / item.map.complexIndex / 3.1)]
                                item.style = "background:" + bColor + "; width:" + realWidth + "px;"
                                $scope.leftListArrayTemp.push(item);
                            }
                        });

                        $scope.leftListArray = $scope.leftListArrayTemp;

                    }
                }
            }

            produceLeftList(orderedSeasonListInstance);


            mapChart.on("timelinechanged", function(e){
                var node = e.currentIndex;
                var firsrYear = year - 3;
                var tempYear = parseInt((lastSeason + parseInt(node) - 1) / 4);
                var currentSeason = (lastSeason + parseInt(node)) % 4;
                if (currentSeason == 0) {
                    currentSeason = 4;
                }
                $scope.$apply(function(){
                    $scope.currentSeason = (firsrYear + tempYear) + "年第" + currentSeason+ "季度";
                });

                produceLeftList(orderedSeasonListInstance);

            });

            $scope.leftListArray = [
                {name:"北京",style:"background:#c23531;width:200px"},
                {name:"上海",style:"background:#c23531;width:180px"},
                {name:"广东",style:"background:#c23531;width:174px"},
                {name:"浙江",style:"background:#d48265;width:160px"},
                {name:"江苏",style:"background:#d48265;width:153px"},
                {name:"四川",style:"background:#d48265;width:143px"},
                {name:"重庆",style:"background:#d48265;width:135px"},
                {name:"福建",style:"background:#2f4554;width:131px"},
                {name:"湖北",style:"background:#2f4554;width:126px"},
                {name:"天津",style:"background:#2f4554;width:113px"}
            ];

        }

    }, true);

    $scope.buildOption = function (instance) {

        /*如果没有数据,返回空地图----------*/
        if (!instance.timeline.length) {
            var timeline = []
            for (var i = 0; i < 12; i++) {
                var json = {
                    orderedProvinceList: [],
                    seasonId: 0,
                    seasonName: i + 1
                }

                timeline.push(json);
            }
            instance.timeline = timeline;
        }

        if (instance.indexMode && instance.indexMode != null) {
            $scope.currentIndexMode = instance.indexMode;
        }

        $scope.timeLineLabelNodes = [];

        $scope.MapOption = {
            options: [],
            timeline: {}
        };

        var width=$(".main-map").height()-90
        if($(".main-map").height()>$(".main-map").width()){
            width=$(".main-map").width()-100
        }

        if (instance.timeline.length > 0) {
            $scope.currentTimeLine = instance.timeline;
            angular.forEach($scope.currentTimeLine, function (timeLine) {

                $scope.timeLineLabelNodes.push({value:timeLine.seasonName}); //,symbolSize:20,,symbol: 'arrow'

                $scope.MapOption.options.push({
                    dataRange: {
                        show:false,
                        min: 0,
                        max: 50,
                        color: ['#91c7ae','#c23531'],
                        x: 'left',
                        y: 'bottom',
                        text: ['高', '低'],
                        textStyle: {
                            color: '#fff'
                        }
                    },
                    showLegendSymbol:false,
                    tooltip: {
                        trigger: 'item',
                        showContent:false,
                        alwaysShowContent:true,
                        show: false
                    },
                    series: [
                        {
                            name: '双创指数',
                            type: 'map',
                            map:"china",
                            label:{
                                normal: {
                                    show:false,
                                    textStyle:{
                                        color:"#fff",
                                        fontStyle:"italic"
                                    }
                                },
                                emphasis: {
                                    show:true,
                                    textStyle:{
                                        color:"#fff",
                                    }
                                }
                            },
                            showLegendSymbol:false,
                            itemStyle: {
                                normal: {
                                    areaColor: '#323c48',
                                    borderColor: '#404a59'
                                },
                                emphasis: {
                                    areaColor: '#2a333d'
                                }
                            },
                            data: timeLine.orderedProvinceList
                        }
                    ]
                })
            });

            $scope.MapOption.baseOption={};

            $scope.MapOption.baseOption.timeline = {
                show:true,
                axisType:"category",
                data: $scope.timeLineLabelNodes,
                currentIndex:$scope.timeLineLabelNodes.length-1,
                left:"left",
                left:"left",
                top:"bottom",
                padding:[10,10,10,200],
                lineStyle:{
                    show:true,
                    //color:"red"
                },
                label:{
                    normal: {
                        show:false,
                        textStyle:{
                            color:"#fff"
                        },
                        formatter: function (node) {
                            var firsrYear = year - 3;
                            var tempYear = parseInt((lastSeason + parseInt(node) - 1) / 4);
                            var currentSeason = (lastSeason + parseInt(node)) % 4;
                            if (currentSeason == 0) {
                                currentSeason = 4;
                            }
                            return (firsrYear + tempYear) + "Q" + currentSeason;
                        },
                    }
                },
                controlPosition:'none',
                autoPlay: false,
                playInterval: 1500
            };

            return $scope.MapOption;

        } else {
            return false;
        }

    };


    $scope.goMap = function (name) {
        var newName=angular.toJson(event.name);
        if(name)newName=angular.toJson(name);
        $state.transitionTo("qs100.scscProvince", {province: newName});
    }

    document.onclick = function () {
        $scope.style03 = $scope.style02 = $scope.style01 = {display: "none"};

        $scope.$apply();
    }
    $scope.stop = function (event) {
        event.cancelBubble = false;
        event.stopPropagation();
    }

    $scope.playKey=true;
    $scope.play=function(){
        $(".tab-fore").hide();
        mapChart.dispatchAction({
            type: 'timelinePlayChange',
            playState: true
        });
        $scope.playKey=false;
    }
    $scope.suspend=function(){
        mapChart.dispatchAction({
            type: 'timelinePlayChange',
            playState: false
        });
        $scope.playKey=true;
    }

}]);
qsDataAnalysisApp.controller("qsSccsShowMapController", ["$scope", "$http", "$rootScope", "$state", "ScscInstance", function ($scope, $http, $rootScope, $state, ScscInstance) {

    var mapChart;


    //配置默认文件列表
    $scope.selectModeList = [
        {indexMode: 1, 'displayName': '清数指数', 'active': true,
            'miaos':"双创指数：清数双创指数，综合考量市场，政策，人才，资金，热度等等指标，计算得到双创的活跃度和健康度",
            'fileName': "1-complexIndex.json"},
        {indexMode: 4, 'displayName': '企业数量', 'active': false,
            'miaos':"企业数量：展示全国不同省份的双创企业数量",
            'fileName': "4-companyCount.json"},
        {indexMode: 2, 'displayName': '孵化器数', 'active': false,
            'miaos':"孵化器数：展示全国不同省份的孵化器数量",
            'fileName': "2-incubatorCount.json"},
        {indexMode: 3, 'displayName': '孵化面积', 'active': false,
            'miaos':"孵化面积：展示全国不同省份的孵化器提供的办公面积",
            'fileName': "3-incubatorArea.json"},
        {indexMode: 5, 'displayName': '累计投资', 'active': false,
            'miaos':"累计投资：展示全国不同省份的双创企业累积获得的投资金额",
            'fileName': "5-investTotalSum.json"},
        {indexMode: 6, 'displayName': '科技园数量', 'active': false,
            'miaos':"科技园数量：展示全国不同省份的科技园数量",
            'fileName': "6-industrialParkCount.json"},
        {indexMode: 7, 'displayName': '人才分布', 'active': false,
            'miaos':"人才分布：展示全国不同省份的双创人才分布情况",
            'fileName': "7-talentCount.json"}
    ];

    //配置选择指数模式
    $scope.selectModeValue = function (item, index) {
        ScscInstance.indexMode = item.indexMode;
        for (var i = 0; i < $scope.selectModeList.length; i++) {
            if ($scope.selectModeList[i] == item) {
                //debugger;
                $scope.miaos=item.miaos;
                $http.get(basePath + "/modules/sccs/homeData/" + item.fileName)
                    .success(function (response) {
                        if (response.state == 0) {
                            ScscInstance.orderedSeasonList = response.result;
                        }
                    });

                if (index != -1) {
                    $(".tab-fore").hide();
                    mapChart.dispatchAction({
                        type: 'timelinePlayChange',
                        playState: false
                    });
                }
                $scope.selectModeList[i].active = true;

            } else {
                $scope.selectModeList[i].active = false;
            }
        }


    };

    //默认选中清数指数
    $scope.selectModeValue($scope.selectModeList[0], -1);

    //当前地图使用的实例
    $scope.currentInstance = {
        timeline: [],
        orderedProvinceLists: []
    };

    //监听指数发送变化后的行为指定
    $scope.$watch(function () {
        return ScscInstance.orderedSeasonList;
    }, function (orderedSeasonListInstance) {

        var indexMode = ScscInstance.indexMode;


        if (orderedSeasonListInstance) {

            $scope.currentInstance = {
                timeline:[],
                orderedProvinceLists:[]
            }

            angular.forEach(orderedSeasonListInstance, function (seasonData) {

                var orderedProvinceList = [];
                angular.forEach(seasonData.resultList, function (province) {

                    if (province.name.indexOf("洲") == -1) {
                        if (indexMode == 1) {
                            orderedProvinceList.push({name: province.name, value: province.complexIndex});
                        } else if (indexMode == 2) {
                            orderedProvinceList.push({name: province.name, value: province.map.incubatorCount});
                        } else if (indexMode == 3) {
                            orderedProvinceList.push({name: province.name, value: province.map.incubatorArea});
                        } else if (indexMode == 4) {
                            orderedProvinceList.push({name: province.name, value: province.map.companyCount});
                        } else if (indexMode == 5) {
                            orderedProvinceList.push({name: province.name, value: province.map.investTotalSum});
                        } else if (indexMode == 6) {
                            orderedProvinceList.push({name: province.name, value: province.map.industrialParkCount});
                        }else if (indexMode == 7) {
                            orderedProvinceList.push({name: province.name, value: province.map.talentCount});
                        }
                    }
                });

                $scope.currentInstance.orderedProvinceLists.push(orderedProvinceList);

                //完成时间线数据
                $scope.currentInstance.timeline.push(seasonData.seasonName);
            });

            $scope.mapShowOption = {
                options: [],
                timeline: {}
            };

            angular.forEach($scope.currentInstance.orderedProvinceLists, function (orderedProvinceList) {

                $scope.mapShowOption.options.push({
                    dataRange: {
                        show: false,
                        min: 0,
                        max: 1000,
                        color: ['#AA0000','#FFF8DC'],
                        x: 'left',
                        y: 'bottom',
                        text: ['高', '低'],
                        textStyle: {
                            color: '#fff'
                        }
                    },
                    showLegendSymbol: false,
                    tooltip: {
                        trigger: 'item',
                        showContent: false,
                        alwaysShowContent: true,
                        show: false
                    },
                    series: [
                        {
                            name: '双创指数',
                            type: 'map',
                            map: "china",
                            label: {
                                normal: {
                                    show: false,
                                    textStyle: {
                                        color: "#fff",
                                        fontStyle: "italic"
                                    }
                                },
                                emphasis: {
                                    show: true,
                                    textStyle: {
                                        color: "#fff",
                                    }
                                }
                            },
                            showLegendSymbol: false,
                            itemStyle: {
                                normal: {
                                    areaColor: '#323c48',
                                    borderColor: '#404a59'
                                },
                                emphasis: {
                                    areaColor: '#2a333d'
                                }
                            },
                            data: orderedProvinceList
                        }
                    ]
                });
            });

            $scope.toProvince = function (event) {
                moveTab(event);
                event.event.event.cancelBubble = false;
                event.event.event.stopPropagation();

            };

            function moveTab(event) {

                $scope.style02 = {
                    left: event.event.event.layerX + "px",
                    top: (event.event.event.layerY) + "px",
                    display: "block"
                };
                $scope.style03 = {
                    left: (event.event.event.layerX + 99) + "px",
                    top: (event.event.event.layerY + 1) + "px",
                    display: "block"
                };
                $scope.style01 = {
                    left: (event.event.event.layerX + 80) + "px",
                    top: (event.event.event.layerY + 20) + "px",
                    display: "block"
                };
                $scope.newData = event;
                //debugger;
                $scope.goMap = function (name) {
                    var newName = angular.toJson(event.name);

                    if (name)newName = name;
                    $state.transitionTo("qs100.scscProvince", {province: newName});
                }

                $scope.$apply();
            }

            $scope.mapShowOption.timeline = {
                show: true,
                axisType: "category",
                data: $scope.currentInstance.timeline,
                currentIndex: $scope.currentInstance.timeline.length - 1,
                left: "left",
                top: "bottom",
                padding: [10, 10, 10, 200],
                lineStyle: {
                    show: true,
                },
                label: {
                    normal: {
                        show: false,
                        textStyle: {
                            color: "#fff"
                        },
                        formatter: function (node) {
                            var firsrYear = year - 3;
                            var tempYear = parseInt((lastSeason + parseInt(node) - 1) / 4);
                            var currentSeason = (lastSeason + parseInt(node)) % 4;
                            if (currentSeason == 0) {
                                currentSeason = 4;
                            }
                            return (firsrYear + tempYear) + "Q" + currentSeason;
                        },
                    }
                },
                controlPosition: 'none',
                autoPlay: false,
                playInterval: 1500
            };

            mapChart = echarts.init(document.getElementById("mainChart"), "shine");

            mapChart.setOption($scope.mapShowOption, false);

            mapChart.on("click", function (e) {
                $(".tab-fore").hide();
                if (e.seriesType == "map" && e.componentSubType == "map") {
                    $scope.toProvince(e);
                }
            });

            $scope.currentSeason = $scope.currentInstance.timeline[$scope.currentInstance.timeline.length - 1];

            $scope.structLeftList = function (srcArray) {

                srcArray = _.sortBy(srcArray, 'value', 'asc').reverse();

                //默认的panel宽度
                $scope.defaultPanelWidth = 200;

                $scope.widthRule = 0;

                angular.forEach(srcArray, function (item) {
                    if (parseFloat(item.value) > $scope.widthRule) {
                        $scope.widthRule = parseFloat(item.value);
                    }
                });

                $scope.leftListArrayTemp = [];
                var srcColor = ["#c23531","#d48265","#2f4554"];

                for (var i= 0; i < srcArray.length; i++) {
                    var item = srcArray[i];
                    if(item.name.indexOf("洲")==-1){
                        var realWidth = ($scope.defaultPanelWidth * item.value) / $scope.widthRule;
                        var bColor;
                        if(i<4){
                            bColor = srcColor[0];
                        }else if(i>=4 && i<8){
                            bColor = srcColor[1];
                        }else{
                            bColor = srcColor[2];
                        }
                        item.style = "background:" + bColor + ";width:" + realWidth + "px;"
                        $scope.leftListArrayTemp.push(item);
                    }
                }

                return $scope.leftListArrayTemp;

            };

            $scope.leftListArray = $scope.structLeftList($scope.currentInstance.orderedProvinceLists[$scope.currentInstance.orderedProvinceLists.length - 1]);


            mapChart.on("timelinechanged", function (e) {

                $scope.$apply(function () {
                    $scope.currentSeason = $scope.currentInstance.timeline[e.currentIndex % 12];
                    $scope.leftListArray = $scope.structLeftList($scope.currentInstance.orderedProvinceLists[e.currentIndex % 12]);
                });

            });

        }
    }, true);

    document.onclick = function () {
        $scope.style03 = $scope.style02 = $scope.style01 = {display: "none"};

        $scope.$apply();
    }

    $scope.playKey = true;
    $scope.play = function () {
        $(".tab-fore").hide();
        mapChart.dispatchAction({
            type: 'timelinePlayChange',
            playState: true
        });
        $scope.playKey = false;
    }
    $scope.suspend = function () {
        mapChart.dispatchAction({
            type: 'timelinePlayChange',
            playState: false
        });
        $scope.playKey = true;
    }


}]);
qsDataAnalysisApp.controller("qsScscCityDetailController",
    ["$scope","$location","$http","$stateParams","ComparisonManage","GotoService","$rootScope",
        function($scope,$location,$http,$stateParams,ComparisonManage,GotoService,$rootScope){

    $rootScope.showChang=false;
    $scope.pageClass="scscCityDetail";

    $scope.city = angular.fromJson($stateParams.city);


    $http.get(basePath+"/qs/cityDetailOfSeason.do?city="+$scope.city)
        .success(function(response){

            $scope.cityResultArr=[];

            if(response.state==0) {
                $scope.result = response.result;
                angular.forEach($scope.result,function(item){
                    $scope.cityResultArr.push({"complexIndex":item["resultList"]["complexIndex"],"stParkCount":item["resultList"]["stParkCount"],"incubatorCount":item["resultList"]["incubatorCount"],"incubatorArea":item["resultList"]["incubatorArea"],
                        "companyTotalCount":item["resultList"]["companyTotalCount"],"totalInvestment":item["resultList"]["totalInvestment"],"relatedNewsCount":item["resultList"]["relatedNewsCount"],"investLastYear":item["resultList"]["investLastYear"],"investThisYear":item["resultList"]["investThisYear"],"investIncrease":item["resultList"]["investIncrease"],
                        "policyComparison":item["resultList"]["policyComparison"],"name":item["resultList"]["name"],"returnnessCount":item["resultList"]["returnnessCount"],"yangtzeRiverScholarCount":item["resultList"]["yangtzeRiverScholarCount"],"aboveMasterCount":item["resultList"]["aboveMasterCount"],"aboveDoctorCount":item["resultList"]["aboveDoctorCount"],"returnnessCount":item["resultList"]["returnnessCount"],
                        "roundAngelCount":item["resultList"]["roundAngelCount"],"roundACount":item["resultList"]["roundACount"],"roundBCount":item["resultList"]["roundBCount"],"roundCCount":item["resultList"]["roundCCount"],"ktaltentPlanCount":item["resultList"]["ktaltentPlanCount"],"htaltentPlanCount":item["resultList"]["htaltentPlanCount"],"internetCount":item["resultList"]["internetCount"],"medicalCount":item["resultList"]["medicalCount"],"tourismCount":item["resultList"]["tourismCount"],"financeCount":item["resultList"]["financeCount"]
                        ,"adCount":item["resultList"]["adCount"],"gameCount":item["resultList"]["gameCount"],"cultureCount":item["resultList"]["cultureCount"],"ecommerceCount":item["resultList"]["ecommerceCount"],"educationCount":item["resultList"]["educationCount"],"estateCount":item["resultList"]["estateCount"],"vehicleCount":item["resultList"]["vehicleCount"]})
                });

            }

            $scope.v1LineOption = {
                title: {
                    text: '清数指数',
                    textStyle:{
                        color:"white"
                    }
                },
                tooltip: {
                    trigger: 'axis'
                },
                legend: {
                    textStyle:{
                        color:"white"
                    },
                    data: ['近3年创新趋势']
                },
                grid: {
                    left: '3%',
                    right: '4%',
                    bottom: '3%',
                    containLabel: true
                },
                xAxis: {
                    type: 'category',
                    boundaryGap: false,
                    splitLine: {show: false},
                    axisLabel:{
                        textStyle:{
                            color:"#fff"
                        }
                    },
                    data: ["2013第二季度", "2013第三季度", "2013第四季度","2014第一季度","2014第二季度","2014第三季度","2014第四季度","2015第一季度","2015第二季度","2015第三季度","2015第四季度","2016第一季度"]
                },
                yAxis: {
                    type: 'value',
                    splitLine: {show: false},
                    axisLabel:{
                        textStyle:{
                            color:"#fff"
                        }
                    }
                },
                series: [
                    {
                        name: '近3年创新趋势',
                        type: 'line',
                        stack: '数量',
                        data:[$scope.cityResultArr[0]["complexIndex"],$scope.cityResultArr[1]["complexIndex"],$scope.cityResultArr[2]["complexIndex"],$scope.cityResultArr[3]["complexIndex"],$scope.cityResultArr[4]["complexIndex"],$scope.cityResultArr[5]["complexIndex"],$scope.cityResultArr[6]["complexIndex"],$scope.cityResultArr[7]["complexIndex"],$scope.cityResultArr[8]["complexIndex"],$scope.cityResultArr[9]["complexIndex"],$scope.cityResultArr[10]["complexIndex"],$scope.cityResultArr[11]["complexIndex"]]
                    }
                ],
                textStyle:{
                    color:"#fff"
                }
            };

            $scope.v2PieOption = {
                title: {
                    x:"center",
                    text: '行业比例',
                    textStyle: {
                        color: '#ffffff'
                    }
                },
                tooltip : {
                    trigger: 'item',
                    formatter: "{a} <br/>{b} : {c} ({d}%)"
                },
                legend: {
                    orient : 'vertical',
                    x : 'left',
                    textStyle:{
                        color:"white"
                    },
                    data:['互联网','旅游','广告','金融', '医疗','游戏','文娱','教育', '房地产','电商', '车辆']
                },
                toolbox: {
                    show : false,
                    feature : {
                        mark : {show: true},
                        dataView : {show: true, readOnly: false},
                        magicType : {
                            show: true,
                            type: ['pie', 'funnel'],
                            option: {
                                funnel: {
                                    x: '25%',
                                    width: '50%',
                                    funnelAlign: 'left',
                                    max: 1548
                                }
                            }
                        },
                        restore : {show: true},
                        saveAsImage : {show: true}
                    }
                },
                calculable : true,
                series: [
                    {
                        name: '行业占比',
                        type: 'pie',
                        radius: '55%',
                        center: ['50%', '60%'],
                        data: [
                            {value: $scope.cityResultArr[11]["internetCount"], name: '互联网'},
                            {value: $scope.cityResultArr[11]["medicalCount"], name: '医疗'},
                            {value: $scope.cityResultArr[11]["tourismCount"], name: '旅游'},
                            {value: $scope.cityResultArr[11]["financeCount"], name: '金融'},
                            {value: $scope.cityResultArr[11]["adCount"], name: '广告'},
                            {value: $scope.cityResultArr[11]["gameCount"], name: '游戏'},
                            {value: $scope.cityResultArr[11]["cultureCount"], name: '文化'},
                            {value: $scope.cityResultArr[11]["ecommerceCount"], name: '电商'},
                            {value: $scope.cityResultArr[11]["educationCount"], name: '教育'},
                            {value: $scope.cityResultArr[11]["estateCount"], name: '房地产'},
                            {value: $scope.cityResultArr[11]["vehicleCount"], name: '车辆'}
                        ]
                    }
                ]
            };

            $scope.v3BarOption = {
                title: {
                    text: '投资额度',
                    textStyle:{
                        color:"white"
                    }

                },
                tooltip: {
                    trigger: 'axis'
                },
                legend: {
                    textStyle:{
                        color:"white"
                    },
                    data: ["总额度"]
                },
                calculable: true,
                xAxis: [
                    {
                        type: 'category',
                        splitLine: {show: false},
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        data: ["2013第二季度", "2013第三季度", "2013第四季度","2014第一季度","2014第二季度","2014第三季度","2014第四季度","2015第一季度","2015第二季度","2015第三季度","2015第四季度","2016第一季度"]
                    }
                ],
                yAxis: [
                    {
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        splitLine: {show: false},
                        type: 'value'
                    }
                ],
                series: [
                    {
                        name: '总额度',
                        type: 'bar',
                        data: [$scope.cityResultArr[0]["totalInvestment"], $scope.cityResultArr[1]["totalInvestment"], $scope.cityResultArr[2]["totalInvestment"], $scope.cityResultArr[3]["totalInvestment"],$scope.cityResultArr[4]["totalInvestment"],$scope.cityResultArr[5]["totalInvestment"],$scope.cityResultArr[6]["totalInvestment"],
                            $scope.cityResultArr[7]["totalInvestment"], $scope.cityResultArr[8]["totalInvestment"],$scope.cityResultArr[9]["totalInvestment"],$scope.cityResultArr[10]["totalInvestment"], $scope.cityResultArr[11]["totalInvestment"]],
                        markPoint: {
                            data: [
                                {type: 'max', name: '最大值'},
                                {type: 'min', name: '最小值'}
                            ]
                        },
                        markLine: {
                            data: [
                                {type: 'average', name: '平均值'}
                            ]
                        }
                    },
                ]
            };

            $scope.v4BarOption = {
                title : {
                    text: '科技园总数',
                    textStyle:{
                        color:"white"
                    }

                },
                tooltip : {
                    trigger: 'axis',
                    axisPointer : {            // 坐标轴指示器，坐标轴触发有效
                        type : 'shadow'        // 默认为直线，可选为：'line' | 'shadow'
                    },
                    formatter: function (params){
                        return params[0].name + '<br/>'
                            + params[0].seriesName + ' : ' + params[0].value + '<br/>';
                    }
                },
                legend: {
                    selectedMode:false,
                    textStyle:{
                        color:"white"
                    },
                    data:["个数"]
                },
                toolbox: {
                    show : false,
                    feature : {
                        mark : {show: true},
                        dataView : {show: true, readOnly: false},
                        restore : {show: true},
                        saveAsImage : {show: true}
                    }
                },
                calculable : true,
                xAxis : [
                    {
                        type : 'category',
                        splitLine: {show: false},
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        data: ["2013第二季度", "2013第三季度", "2013第四季度","2014第一季度","2014第二季度","2014第三季度","2014第四季度","2015第一季度","2015第二季度","2015第三季度","2015第四季度","2016第一季度"]
                    }
                ],
                yAxis : [
                    {
                        type : 'value',
                        splitLine: {show: false},
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        boundaryGap: [0, 0.1]
                    }
                ],
                series : [
                    {
                        name:'Acutal',
                        type:'bar',
                        stack: 'sum',
                        barCategoryGap: '50%',
                        itemStyle: {
                            normal: {
                                color: 'tomato',
                                barBorderColor: 'tomato',
                                barBorderWidth: 6,
                                barBorderRadius:0,
                                label : {
                                    show: true, position: 'insideTop'
                                }
                            }
                        },
                        data:[$scope.cityResultArr[0]["stParkCount"],$scope.cityResultArr[1]["stParkCount"],$scope.cityResultArr[2]["stParkCount"],$scope.cityResultArr[3]["stParkCount"],$scope.cityResultArr[4]["stParkCount"],$scope.cityResultArr[5]["stParkCount"],$scope.cityResultArr[6]["stParkCount"],$scope.cityResultArr[7]["stParkCount"],$scope.cityResultArr[8]["stParkCount"],$scope.cityResultArr[9]["stParkCount"],$scope.cityResultArr[10]["stParkCount"],$scope.cityResultArr[11]["stParkCount"]]
                    },
                ]
            };

            $scope.v5BarOption = {
                title : {
                    text: '总孵化器面积',
                    textStyle:{
                        color:"white"
                    }
                    //subtext: '纯属虚构'
                },
                tooltip : {
                    trigger: 'axis'
                },
                legend: {
                    textStyle:{
                        color:"white"
                    },
                    data:["面积"]
                },
                toolbox: {
                    show : false,
                    feature : {
                        mark : {show: true},
                        dataView : {show: true, readOnly: false},
                        magicType : {show: true, type: ['line', 'bar']},
                        restore : {show: true},
                        saveAsImage : {show: true}
                    }
                },
                calculable : true,
                xAxis : [
                    {
                        type : 'category',
                        splitLine: {show: false},
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        data: ["2013第二季度", "2013第三季度", "2013第四季度","2014第一季度","2014第二季度","2014第三季度","2014第四季度","2015第一季度","2015第二季度","2015第三季度","2015第四季度","2016第一季度"]
                    }
                ],
                yAxis : [
                    {
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        splitLine: {show: false},
                        type : 'value'
                    }
                ],
                series : [
                    {
                        name:'面积',
                        type:'bar',
                        data:[$scope.cityResultArr[0]["incubatorArea"],$scope.cityResultArr[1]["incubatorArea"],$scope.cityResultArr[2]["incubatorArea"],$scope.cityResultArr[3]["incubatorArea"],$scope.cityResultArr[4]["incubatorArea"],$scope.cityResultArr[5]["incubatorArea"],$scope.cityResultArr[6]["incubatorArea"],$scope.cityResultArr[7]["incubatorArea"],$scope.cityResultArr[8]["incubatorArea"],$scope.cityResultArr[9]["incubatorArea"],$scope.cityResultArr[10]["incubatorArea"],$scope.cityResultArr[11]["incubatorArea"]],
                        markPoint : {
                            data : [
                                {type : 'max', name: '最大值'},
                                {type : 'min', name: '最小值'}
                            ]
                        },
                        markLine : {
                            data : [
                                {type : 'average', name: '平均值'}
                            ]
                        }
                    },
                ]
            };

            $scope.v6AreaOption = {
                title : {
                    text: '各轮企业数',
                    textStyle:{
                        color:"white"
                    }
                    //sublink: 'http://e.weibo.com/1341556070/AizJXrAEa'
                },
                tooltip : {
                    trigger: 'axis'
                },
                legend: {
                    textStyle:{
                        color:"white"
                    },
                    data:['天使轮','a轮','b轮','c轮']
                },
                toolbox: {
                    show : false,
                    feature : {
                        mark : {show: true},
                        dataView : {show: true, readOnly: false},
                        magicType : {show: true, type: ['line', 'bar', 'stack', 'tiled']},
                        restore : {show: true},
                        saveAsImage : {show: true}
                    }
                },
                calculable : true,
                xAxis : [
                    {
                        type : 'category',
                        boundaryGap : false,
                        splitLine: {show: false},
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        data: ["2013第二季度", "2013第三季度", "2013第四季度","2014第一季度","2014第二季度","2014第三季度","2014第四季度","2015第一季度","2015第二季度","2015第三季度","2015第四季度","2016第一季度"]

                    }
                ],
                yAxis : [
                    {
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        splitLine: {show: false},
                        type : 'value'
                    }
                ],
                series : [
                    {
                        name:'天使轮',
                        type:'line',
                        stack: '总量',

                        itemStyle: {normal: {areaStyle: {type: 'default'}}},
                        data: [$scope.cityResultArr[0]["roundAngelCount"], $scope.cityResultArr[1]["roundAngelCount"], $scope.cityResultArr[2]["roundAngelCount"], $scope.cityResultArr[3]["roundAngelCount"],$scope.cityResultArr[4]["roundAngelCount"],$scope.cityResultArr[5]["roundAngelCount"],$scope.cityResultArr[6]["roundAngelCount"],
                            $scope.cityResultArr[7]["roundAngelCount"], $scope.cityResultArr[8]["roundAngelCount"],$scope.cityResultArr[9]["roundAngelCount"],$scope.cityResultArr[10]["roundAngelCount"], $scope.cityResultArr[11]["roundAngelCount"]],

                    },
                    {
                        name:'A轮',
                        type:'line',
                        stack: '总量',
                        itemStyle: {normal: {areaStyle: {type: 'default'}}},
                        data: [$scope.cityResultArr[0]["roundAngelCount"], $scope.cityResultArr[1]["roundAngelCount"], $scope.cityResultArr[2]["roundAngelCount"], $scope.cityResultArr[3]["roundAngelCount"],$scope.cityResultArr[4]["roundAngelCount"],$scope.cityResultArr[5]["roundAngelCount"],$scope.cityResultArr[6]["roundAngelCount"],
                            $scope.cityResultArr[7]["roundAngelCount"], $scope.cityResultArr[8]["roundAngelCount"],$scope.cityResultArr[9]["roundAngelCount"],$scope.cityResultArr[10]["roundAngelCount"], $scope.cityResultArr[11]["roundAngelCount"]],

                    },
                    {
                        name:'b轮',
                        type:'line',
                        stack: '总量',
                        itemStyle: {normal: {areaStyle: {type: 'default'}}},
                        data: [$scope.cityResultArr[0]["roundBCount"], $scope.cityResultArr[1]["roundBCount"], $scope.cityResultArr[2]["roundBCount"], $scope.cityResultArr[3]["roundBCount"],$scope.cityResultArr[4]["roundBCount"],$scope.cityResultArr[5]["roundBCount"],$scope.cityResultArr[6]["roundBCount"],
                            $scope.cityResultArr[7]["roundBCount"], $scope.cityResultArr[8]["roundBCount"],$scope.cityResultArr[9]["roundBCount"],$scope.cityResultArr[10]["roundBCount"], $scope.cityResultArr[11]["roundBCount"]],

                    },
                    {
                        name:'c轮',
                        type:'line',
                        stack: '总量',
                        itemStyle: {normal: {areaStyle: {type: 'default'}}},
                        data: [$scope.cityResultArr[0]["roundCCount"], $scope.cityResultArr[1]["roundCCount"], $scope.cityResultArr[2]["roundCCount"], $scope.cityResultArr[3]["roundCCount"],$scope.cityResultArr[4]["roundCCount"],$scope.cityResultArr[5]["roundCCount"],$scope.cityResultArr[6]["roundCCount"],
                            $scope.cityResultArr[7]["roundCCount"], $scope.cityResultArr[8]["roundCCount"],$scope.cityResultArr[9]["roundCCount"],$scope.cityResultArr[10]["roundCCount"], $scope.cityResultArr[11]["roundCCount"]],

                    },

                ]
            };

            $scope.v10BarOption = {
                title : {
                    text: '孵化器总数',
                    textStyle:{
                        color:"white"
                    },
                    subtext: 'From ExcelHome'
                    //sublink: 'http://e.weibo.com/1341556070/AizJXrAEa'
                },
                tooltip : {
                    trigger: 'axis',
                    axisPointer : {            // 坐标轴指示器，坐标轴触发有效
                        type : 'shadow'        // 默认为直线，可选为：'line' | 'shadow'
                    },
                    formatter: function (params){
                        return params[0].name + '<br/>'
                            + params[0].seriesName + ' : ' + params[0].value + '<br/>';
                    }
                },
                legend: {
                    selectedMode:false,
                    textStyle:{
                        color:"white"
                    },
                    data:["个数"]
                },
                toolbox: {
                    show : false,
                    feature : {
                        mark : {show: true},
                        dataView : {show: true, readOnly: false},
                        restore : {show: true},
                        saveAsImage : {show: true}
                    }
                },
                calculable : true,
                xAxis : [
                    {
                        type : 'category',
                        splitLine: {show: false},
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        data: ["2013第二季度", "2013第三季度", "2013第四季度","2014第一季度","2014第二季度","2014第三季度","2014第四季度","2015第一季度","2015第二季度","2015第三季度","2015第四季度","2016第一季度"]
                    }
                ],
                yAxis : [
                    {
                        type : 'value',
                        axisLabel:{
                            textStyle:{
                                color:"#fff"
                            }
                        },
                        splitLine: {show: false},
                        boundaryGap: [0, 0.1]
                    }
                ],
                series : [
                    {
                        name:'Acutal',
                        type:'bar',
                        stack: 'sum',
                        barCategoryGap: '50%',
                        itemStyle: {
                            normal: {
                                color: 'tomato',
                                barBorderColor: 'tomato',
                                barBorderWidth: 6,
                                barBorderRadius:0,
                                label : {
                                    show: true, position: 'insideTop'
                                }
                            }
                        },
                        data:[$scope.cityResultArr[0]["incubatorCount"],$scope.cityResultArr[1]["incubatorCount"],$scope.cityResultArr[2]["incubatorCount"],$scope.cityResultArr[3]["incubatorCount"],$scope.cityResultArr[4]["incubatorCount"],$scope.cityResultArr[5]["incubatorCount"],$scope.cityResultArr[6]["incubatorCount"],$scope.cityResultArr[7]["incubatorCount"],$scope.cityResultArr[8]["incubatorCount"],$scope.cityResultArr[9]["incubatorCount"],$scope.cityResultArr[10]["incubatorCount"],$scope.cityResultArr[11]["incubatorCount"]]
                    },

                ]
            };

            $scope.v8funnelOption = {
                title : {
                    text: '人才比例图',
                    textStyle:{
                        color:"white"
                    }
                    //subtext: '纯属虚构'
                },
                tooltip : {
                    trigger: 'item',
                    formatter: "{a} <br/>{b} : {c}%"
                },
                toolbox: {
                    show : false,
                    feature : {
                        mark : {show: true},
                        dataView : {show: true, readOnly: false},
                        restore : {show: true},
                        saveAsImage : {show: true}
                    }
                },
                legend: {
                    textStyle:{
                        color:"white"
                    },
                    data : ['海归学者','长江学者','硕士学位人才','博士学位人才']
                },
                calculable : true,
                series : [
                    {
                        name:'人才比例图',
                        type:'funnel',
                        width: '50%',
                        data:[
                            {value:$scope.cityResultArr[11]["returnnessCount"], name:'海归学者'},
                            {value:$scope.cityResultArr[11]["yangtzeRiverScholarCount"], name:'长江学者'},
                            {value:$scope.cityResultArr[11]["aboveMasterCount"], name:'订单'},
                            {value:$scope.cityResultArr[11]["aboveDoctorCount"], name:'点击'}
                        ]
                    }

                ]
            };

            echarts.init(document.getElementById("v1")).setOption($scope.v1LineOption);
            echarts.init(document.getElementById("v2")).setOption($scope.v2PieOption);
            echarts.init(document.getElementById("v3")).setOption($scope.v3BarOption);
            echarts.init(document.getElementById("v4")).setOption($scope.v4BarOption);
            echarts.init(document.getElementById("v5")).setOption($scope.v5BarOption);
            echarts.init(document.getElementById("v6")).setOption($scope.v6AreaOption);
            echarts.init(document.getElementById("v10")).setOption($scope.v10BarOption);
            echarts.init(document.getElementById("v8")).setOption($scope.v8funnelOption);

        });

    $http.get(basePath+"/qs/InvestOfCityByIndustryOfSeason.do?city="+$scope.city)
        .success(function(response){
            $scope.investCityInfo;

            if(response.state==0) {
                $scope.investCityInfo = response.result;

            }

            var labelRight = {normal: {label : {position: 'right'}}};
            
            $scope.v7PieOption = {
                title : {
                    text: '行业投资比例图',
                    textStyle:{
                        color:"white"
                    },
                    x:'center'
                },
                tooltip : {
                    trigger: 'item',
                    formatter: "{a} <br/>{b} : {c} ({d}%)"
                },
                legend: {
                    orient : 'vertical',
                    x : 'left',
                    textStyle:{
                        color:"white"
                    },
                    data:['互联网','旅游','广告','金融', '医疗','游戏','文娱','教育', '房地产','电商', '车辆']
                },
                toolbox: {
                    show : false,
                    feature : {
                        mark : {show: true},
                        dataView : {show: true, readOnly: false},
                        magicType : {
                            show: true,
                            type: ['pie', 'funnel'],
                            option: {
                                funnel: {
                                    x: '25%',
                                    width: '50%',
                                    funnelAlign: 'left',
                                    max: 1548
                                }
                            }
                        },
                        restore : {show: true},
                        saveAsImage : {show: true}
                    }
                },
                calculable : true,
                series : [
                    {
                        name:'访问来源',
                        type:'pie',
                        radius : '55%',
                        center: ['50%', '60%'],
                        data:[
                            {value:$scope.investCityInfo["internetInvest"], name:'互联网'},
                            {value:$scope.investCityInfo["medicalInvest"], name:'医疗'},
                            {value:$scope.investCityInfo["tourismInvest"], name:'旅游'},
                            {value:$scope.investCityInfo["financeInvest"], name:'金融'},
                            {value:$scope.investCityInfo["adInvest"], name:'广告'},
                            {value:$scope.investCityInfo["gameInvest"], name:'游戏'},
                            {value:$scope.investCityInfo["cultureInvest"], name:'文娱'},
                            {value:$scope.investCityInfo["ecommerceInvest"], name:'电商'},
                            {value:$scope.investCityInfo["educationInvest"], name:'教育'},
                            {value:$scope.investCityInfo["estateInvest"], name:'房地产'},
                            {value:$scope.investCityInfo["vehicleInvest"], name:'车辆'}

                        ]
                    }
                ]
            };

            $scope.v9BarOption = {
                title: {
                    text: '行业投资旋风条形图',
                    textStyle:{
                        color:"white"
                    }

                },
                tooltip : {
                    trigger: 'axis',
                    axisPointer : {            // 坐标轴指示器，坐标轴触发有效
                        type : 'shadow'        // 默认为直线，可选为：'line' | 'shadow'
                    }
                },

                toolbox: {
                    show : false,
                    feature : {
                        mark : {show: true},
                        dataView : {show: true, readOnly: false},
                        magicType : {show: true, type: ['line', 'bar']},
                        restore : {show: true},
                        saveAsImage : {show: true}
                    }
                },
                grid: {
                    y: 80,
                    y2: 30
                },
                xAxis : [
                    {
                        type : 'value',
                        position: 'top',
                        splitLine: {show: false}
                    }
                ],
                yAxis : [
                    {
                        type : 'category',
                        axisLine: {show: false},
                        axisLabel: {show: false},
                        axisTick: {show: false},
                        splitLine: {show: false},
                        data : ['互联网','旅游','广告','金融', '医疗','游戏','文娱','教育', '房地产','电商', '车辆']
                    }
                ],
                series : [
                    {
                        name:'总量',
                        type:'bar',
                        stack: '总量',
                        itemStyle : { normal: {
                            color: 'orange',
                            borderRadius: 5,
                            label : {
                                show: true,
                                position: 'left',
                                formatter: '{b}'
                            }
                        }},
                        data:[
                            $scope.investCityInfo["internetInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["tourismInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["adInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["financeInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["medicalInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["gameInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["cultureInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["educationInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["estateInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["ecommerceInvest"]-$scope.investCityInfo["averageValue"],
                            $scope.investCityInfo["vehicleInvest"]-$scope.investCityInfo["averageValue"]
                        ]

                    }
                ]
            };

            echarts.init(document.getElementById("v7")).setOption($scope.v7PieOption);
            echarts.init(document.getElementById("v9")).setOption($scope.v9BarOption);

        });







    $scope.cityPageStParkOption={
        url:"/cityStparkDetail.do?city="+$scope.city,
        colDef:[
            {col:"name",displayName:"名称"},
            {col:"region",displayName:"地区"},
            {col:"city",displayName:"城市"},
            {col:"nation",displayName:"国家"},
            {col:"setupDate",displayName:"创建日期",type:"date"},
            {col:"parkGrade",displayName:"科技园等级"}
        ],
        rowAction:{
            addToComparison:function(item){
                ComparisonManage.addStPark(item)
            },
            enterDetail:function(item){
                GotoService.gotoStPark(item);
            }
        }
    };

    $scope.cityPageIncubatorOption= {
        url: "/cityIncubatorDetail.do?city=" + $scope.city,
        colDef: [
            {col: "name", displayName: "名称"},
            {col: "city", displayName: "城市"},
            {col: "nation", displayName: "国家"},
            {col: "link", displayName: "链接"},
            {col: "setupDate", displayName: "创建日期",type:"date"}
        ],
        rowAction: {
            addToComparison: function (item) {
                ComparisonManage.addIncubator(item)
            },
            enterDetail: function (item) {
                GotoService.gotoIncubator(item)
            }
        }
    }

    $scope.cityPageCompanyOption={
        url:"/cityCompanyDetail.do?city="+$scope.city,
        colDef:[
            {col:"name",displayName:"名称"},
            {col:"region",displayName:"地区"},
            {col:"city",displayName:"城市"},
            {col:"nation",displayName:"国家"},
            {col:"link",displayName:"链接"},
            {col:"incubator",displayName:"所属孵化园"},
            {col:"qsscIndustrialPark",displayName:"所属科技园"},
            {col:"setupDate",displayName:"创建日期",type:"date"}
        ],
        rowAction:{
            addToComparison:function(item){
                ComparisonManage.addCompany(item)
            },
            enterDetail:function(item){
                GotoService.gotoCompany(item);
            }
        }
    };


}]);
qsDataAnalysisApp.controller("qsScscCityRankController",["$scope","$location","$http","ComparisonManage","GotoService",function($scope,$location,$http,ComparisonManage,GotoService){


    $scope.provinceIndexTrendOption = {
        title: {
            text: "中国"
        },
        tooltip: {
            trigger: 'axis'
        },
        legend: {
            data:['近3年创新趋势']
        },
        grid: {
            left: '3%',
            right: '4%',
            bottom: '3%',
            containLabel: true
        },
        toolbox: {
            feature: {
                //saveAsImage: {}
            }
        },
        xAxis: {
            type: 'category',
            boundaryGap: false,
            data: ['周一','周二','周三','周四','周五','周六','周日']
        },
        yAxis: {
            type: 'value'
        },
        series: [
            {
                name:'近3年创新趋势',
                type:'line',
                stack: '数量',
                data:[120, 132, 101, 134, 90, 230, 210]
            }
        ]
    };

    echarts.init(document.getElementById("provinceIndexTrendDiv")).setOption($scope.provinceIndexTrendOption);
    $scope.cityRankValueArr = [];
    //获取综合指数排名的公司
    $http.get(basePath + "/qs/cityByComplexIndex.do")//,{province:$scope.province,page:0}
        .success(function (response) {
            angular.forEach(response, function (item){
                //$scope.cityRankValueArr.push({"name": item[0], "index": item[1]});
            });
        });

    $scope.gridOption={
        url:"/qs/cityByComplexIndex.do",
        colDef:[
            {col:"rank",displayName:"排名"},
            {col:"name",displayName:"名称"},
            {col:"complexIndex",displayName:"综合指数"},
            {col:"stParkCount",displayName:"科技园数"},
            {col:"incubatorCount",displayName:"孵化园数"},
            {col:"incubatorArea",displayName:"孵化园面积"},
            {col:"companyTotalCount",displayName:"公司总数"},
            {col:"companyIncubatorCount",displayName:"入住公司数"},
            {col:"companyNotIncubatorCount",displayName:"未入住公司数"},
            {col:"totalInvestment",displayName:"投资总额"},
            {col:"lon",displayName:"经度"},
            {col:"lat",displayName:"维度"}
        ],
        rowAction:{
            addToComparison:function(item){
                //console.log("addToComparison");
                ComparisonManage.addCity(item);
                //console.log(item);
            },
            enterDetail:function(item){
                GotoService.gotoCity(item);
            }
        }
    };

}]);
qsDataAnalysisApp.filter("qsTextFormatter",['$sce',function($sce){
    return function(input,formatter){
        return $sce.trustAsHtml(input.replace(/ /g,"<br/>"));
    };
}]);


qsDataAnalysisApp.controller("qsScscCompnayDetailController",["$scope","$location","$stateParams","$http",function($scope,$location,$stateParams,$http){

    $scope.originalText = "Example Text Hello";

    $scope.company = angular.fromJson($stateParams.company);


    $http.get(basePath + "/companyDetailByName.do?company="+$scope.company)//,{province:$scope.province,page:0}
        .success(function (response) {
        });

}]);
qsDataAnalysisApp.controller("scscCompanyEventTimelineController",
    ["$scope","$rootScope", "$location", "$state", "$http", "$stateParams", "GotoService", "ComparisonManage",
        function ($scope,$rootScope, $location, $state, $http, $stateParams, GotoService, ComparisonManage) {

    $rootScope.bigTitle="公司成立时间图";



    $http.get(basePath+"/qs/companyInfoOfIndustry.do")
        .success(function(response){
            $scope.companyResult = [];
            function random(min,max){

                return Math.floor(min+Math.random()*(max-min));

            }
            function add0(m){return m<10?'0'+m:m }
            function format(shijianchuo)
            {
                var time = new Date(shijianchuo);
                var y = time.getFullYear();
                var m = time.getMonth()+1;
                var d = time.getDate()+1;
                return y+'-'+add0(m)+'-'+add0(d);
            }

            if(response.state==0){
                var data = [];
                var days = ['互联网', '医药', '旅游',
                    '金融', '广告', '游戏', '文化娱乐','电商','教育','房地产','车辆',"其他"];

                $scope.companyResult = response.result;
                angular.forEach($scope.companyResult,function(item){

                    data.push([item["setupDate"],item["industryCode"]-1,random(1,5),item["companyName"]])

                })


                var series = [];
                for(i=0;i<=11;i++) {
                    var serie = {
                        name: days[i],
                        type: 'scatter',
                        symbolSize: function (val) {
                            //return val[2] * 2;
                            return 2;
                        },
                        data: function () {
                            var info = [];
                            var c = 0
                            angular.forEach(data, function (item) {
                                c=c+1
                                if (item[1] == i&&c%4==0) {
                                    //info.push([item[0],item[1]-1,random(1,6)])
                                    info.push(item)

                                }

                            });
                            return info;
                        }(),
                        animationDelay: function (idx) {
                            return idx * 5;
                        }
                    };
                    series.push(serie);
                }
                $scope.scscCompanyEventTimelineOption = {

                    legend: {
                        orient:"vertical",
                        padding:10,
                        textStyle:{
                            color: '#fff'
                        },
                        left:"right",
                        top:"40%",
                        data: ['互联网', '医药', '旅游',
                            '金融', '广告', '游戏', '文化娱乐','电商','教育','房地产','车辆',"其他"]
                    },
                    tooltip: {
                        position: 'top',
                        formatter: function (params) {
                            var idustry;
                            if(params.value[0])
                            return "公司名称："+params.data[3]+"</br>"+"  成立时间：" + format(params.value[0]) +"</br>"+"  所属行业："+ days[params.value[1]];
                        }
                    },
                    // 加入选择条
                    visualMap: [
                        {
                            left: 'right',
                            top: '10%',
                            dimension: 2,
                            min: 0,
                            max: 10,
                            itemWidth: 20,
                            itemHeight: 80,
                            calculable: true,
                            precision: 0.1,
                            text: ['注册资本'],
                            textGap: 30,
                            textStyle: {
                                color: '#fff'
                            },
                            inRange: {
                                symbolSize: [10, 70]
                            },
                            outOfRange: {
                                symbolSize: [10, 70],
                                color: ['rgba(255,255,255,.2)']
                            },
                            controller: {
                                inRange: {
                                    color: ['#c23531']
                                },
                                outOfRange: {
                                    color: ['#444']
                                }
                            }
                        }
                    ],
                    grid: {
                        left: 2,
                        bottom: 10,
                        right:"10%",
                        containLabel: true
                    },
                    xAxis: {
                        type: 'time',
                        //boundaryGap: false,
                        //splitLine: {
                        //    show: false,
                        //},
                        axisLine: {
                            show: true
                        },
                        axisLabel:{
                            textStyle:{
                                color:"#fff",
                                fontSize:"12"
                            }
                        }
                    },
                    yAxis: {
                        type: 'category',
                        data: days,
                        //boundaryGap: ['20%', '20%'],
                        splitLine:{show:false},
                        axisLine: {
                            show: true
                        },
                        axisLabel:{
                            textStyle:{
                                color:"#fff",
                                fontSize:"14"
                            }
                        }
                    },
                    series:series,
                    dataZoom: [{
                        type: 'slider',
                        start: 75,
                        end: 85,
                        top:"top"
                    }]
                };
            }
            var scscCompanyEventTimelineChart = echarts.init(document.getElementById("scscCompanyEventTimelineChart"),"shine");

            scscCompanyEventTimelineChart.setOption($scope.scscCompanyEventTimelineOption);
        })
}])
qsDataAnalysisApp.controller("qsScscHomepageController", ["$scope", "$http", "$rootScope", "$state", "ScscInstance", function ($scope, $http, $rootScope, $state, ScscInstance) {
    require.config({
        paths: {
            echarts: 'static/assets/echarts'
        }
    });
    //launchExample();

    var EC_READY = false;
    var myChart0;

    var isExampleLaunched;
    function launchExample(instance) {
        if (isExampleLaunched) {
            return;
        }

        // 按需加载
        isExampleLaunched = 1;
        require(
            [
                'echarts',
                'echarts/chart/line',
                'echarts/chart/bar',
                'echarts/chart/scatter',
                'echarts/chart/pie',
                'echarts/chart/radar',
                'echarts/chart/map'
            ],
            function (ec) {
                EC_READY = true;
                myChart0 = ec.init(document.getElementById('dashboardMap')).setOption(option0(instance));
                var eventConfig =require('echarts/config').EVENT;
                myChart0.on(eventConfig.CLICK,function(event){
                    //console.log(e.name);
                    var province = event.name;
                    $state.transitionTo("qs100.scscProvince",{province:angular.toJson(province)});
                });
            }
        );
    };

    //跨控制器通讯，基于服务
    $scope.$watch(function(){
        return ScscInstance;
    },function(instance){
        console.log(instance);
        var items = instance.provinceIndexList;
        $scope.provinceList = [];
        angular.forEach(items,function(item){
            if(item.name.indexOf("洲")==-1){
                $scope.provinceList.push(item);
                //console.log(item.name+":"+item.complexIndex);
            }
        });
        instance.provinceIndexList = $scope.provinceList;
        launchExample(instance);
    },true);


}]);
qsDataAnalysisApp.controller("qsScscIncubatorController",["$scope","$location","$http","$stateParams","GotoService","ComparisonManage",function($scope,$location,$http,$stateParams,GotoService,ComparisonManage){

    $scope.incubator = angular.fromJson($stateParams.incubator);
    console.log($scope.incubator);

    $scope.provinceIndexTrendOption = {
        title: {
            text: "孵化园:"+$scope.incubator,
            textStyle:{
                color:"#fff"
            }
        },
        tooltip: {
            trigger: 'axis'
        },
        legend: {
            data:['近3年创新趋势'],
            textStyle:{
                color:"#fff"
            }
        },
        grid: {
            left: '3%',
            right: '4%',
            bottom: '3%',
            containLabel: true
        },
        toolbox: {
            feature: {
                //saveAsImage: {}
            }
        },
        xAxis: {
            type: 'category',
            boundaryGap: false,
            data: ['周一','周二','周三','周四','周五','周六','周日'],
            axisLabel: {
                textStyle:{
                    color:"#fff"
                }
            },
        },
        yAxis: {
            axisLabel: {
                textStyle:{
                    color:"#fff"
                }
            },
            type: 'value'
        },
        series: [
            {
                name:'近3年创新趋势',
                type:'line',
                stack: '数量',
                data:[120, 132, 101, 134, 90, 230, 210]
            }
        ]
    };

    echarts.init(document.getElementById("provinceIndexTrendDiv")).setOption($scope.provinceIndexTrendOption);

    $scope.incubatorPageCompanyOption={
        url:"/incubatorDetail.do?incubator="+$scope.incubator,
        colDef:[
            {col:"name",displayName:"名称"},
            {col:"region",displayName:"地区"},
            {col:"city",displayName:"城市"},
            {col:"province",displayName:"省份"},
            {col:"nation",displayName:"国家"},
            {col:"link",displayName:"链接"},
            {col:"qsscIndustrialPark",displayName:"所属科技园"},
            {col:"setupDate",displayName:"创立日期"}
        ],
        rowAction:{
            addToComparison:function(item){
                ComparisonManage.addCompany(item);
            },
            enterDetail:function(item){
                GotoService.gotoCompany(item);

            }
        }
    };

}]);
qsDataAnalysisApp.controller("scscInvestmentRelationController", [
    "$scope", "$rootScope","$location", "$state", "$http", "$stateParams", "GotoService", "ComparisonManage",
        function ($scope,$rootScope, $location, $state, $http, $stateParams, GotoService, ComparisonManage)
        {

    $rootScope.bigTitle="投资关系图";


    console.log("scscInvestmentRelationController");

    $scope.scscInvestmentRelationOption = {
        title : {
            text: '中国创新创业投资关系',
            textStyle:{
                fontSize:30,
                color:"white"
            },
            subtext: '--清数科技',
            subtextStyle:{
                fontSize:20,
                color:"white"
            },
            x:'right',
            y:'bottom'
        },
        tooltip : {
            trigger: 'item',
            formatter : "{b}"
        },
        toolbox: {
            show : false,
            feature : {
                restore : {show: true},
                magicType: {
                    show: true,
                    type: ['force', 'chord'],
                    option: {
                        chord: {
                            minRadius : 2,
                            maxRadius : 10,
                            ribbonType: false,
                            itemStyle: {
                                normal: {
                                    label: {
                                        show: true,
                                        rotate: true
                                    },
                                    chordStyle: {
                                        opacity: 0.2
                                    }
                                }
                            }
                        },
                        force: {
                            minRadius : 5,
                            maxRadius : 8,
                            itemStyle : {
                                normal : {
                                    label: {
                                        show: false
                                    },
                                    linkStyle : {
                                        opacity : 0.5
                                    }
                                }
                            }
                        }
                    }
                },
                saveAsImage : {show: true}
            }
        },
        noDataEffect: 'none',
        series :[{
            //FIXME No data
            //type: 'force',
        }],
    };
    $.ajax({
        url: 'modules/sccs/data/webkit-dep.json',
        dataType: 'json',
        success: function (data) {

            $scope.scscInvestmentRelationOption = {
                legend: {
                    //data: ['Alibaba', 'Tecent', 'IDG', 'SequoiaCapitalChina', 'Other'],
                    data: ['阿里巴巴', '腾讯', '国际数据', '红杉中国', '其它'],
                    orient : 'vertical',
                    left:"right",
                    bottom:"middle",
                    textStyle:{
                        color:"#fff",
                        fontSize:"12"
                    }
                },
                series: [{
                    type: 'graph',
                    layout: 'force',
                    animation: true,
                    left:"10%",
                    top:"10%",
                    right:"10%",
                    bottom:"10%",
                    label: {
                        normal: {
                            position: 'right',
                            formatter: '{b}'
                        }
                    },
                    draggable: false,
                    data: data.nodes.map(function (node, idx) {
                        node.id = idx;
                        return node;
                    }),
                    categories: data.categories,
                    force: {
                         initLayout: 'circular',
                         gravity: 0.05,
                         repulsion: 20,
                        edgeLength: 5,
                        repulsion: 20
                    },
                    edges: data.links
                }]
            };

            var scscInvestmentRelationChart = echarts.init(document.getElementById("scscInvestmentRelationChart"),"shine");

            scscInvestmentRelationChart.setOption($scope.scscInvestmentRelationOption);
            scscInvestmentRelationChart.hideLoading();
        }
    });

}]);

qsDataAnalysisApp.controller("qsScscProvinceController",
    ["$scope", "$location", "$state", "$http", "$stateParams", "GotoService", "ComparisonManage", "$rootScope",
        function ($scope, $location, $state, $http, $stateParams, GotoService, ComparisonManage, $rootScope) {

            $rootScope.showChang = false;

            $scope.pageClass = "scscProvincePage";


            $rootScope.bigTitle=$scope.province = angular.fromJson($stateParams.province);

            $scope.dataFormatter = function (obj) {
                var temp;
                var max = 0;
                var min = 0;
                for (var year in obj) {
                    temp = obj[year];
                    for (var i = 0, l = temp.length; i < l; i++) {
                        max = Math.max((temp[i] == '-' ? 0 : temp[i]), max);
                        min = Math.min((temp[i] == '-' ? 0 : temp[i]), min);
                        obj[year][i] = {
                            name: $scope.pList[i],
                            value: temp[i]
                        }
                    }
                    obj[year + 'max'] = Math.ceil(max / 100) * 100;
                    obj[year + 'min'] = Math.floor(min / 100) * 100;
                }
                return obj;
            }

            $scope.provinceMapOption = {
                title: {
                    //text: $scope.province + "概要",
                    textStyle: {
                        color: '#ffffff'
                    }
                },
                tooltip: {
                    trigger: 'item',
                    show: false
                },
                dataRange: {
                    orient: 'horizontal',
                    x: 'right',
                    y: 'top',
                    min: 0,
                    max: 100,
                    text: ['高', '低'],           // 文本，默认为数值文本
                    splitNumber: 0,
                    textStyle: {
                        color: '#ffffff'
                    }
                },
                toolbox: {
                    show: false
                },
                series: [
                    {
                        name: $scope.province + '概要',
                        type: 'map',
                        map: _.result(_.find(chinaJsonMappings,{name:$scope.province}),'jsonName'),
                        itemStyle: {
                            normal: {
                                areaColor: '#323c48',
                                borderColor: '#404a59'
                            },
                            emphasis: {
                                areaColor: '#2a333d'
                            }
                        },
                        label:{
                            normal: {
                                show:false,
                                textStyle:{
                                    color:"#fff",
                                    fontStyle:"italic"
                                }
                            },
                            emphasis: {
                                show:true,
                                textStyle:{
                                    color:"#fff",
                                }
                            }
                        },
                        textStyle: {
                            color: '#ffffff'
                        },
                        data: [
                            {name: '成都', value: 605.83},
                            {name: '广元', value: 1670.44},
                            {name: '西昌', value: 2102.21}
                        ]
                    }
                ],
                animation: true

            }


            $scope.provinceIndexTrendOption = {};


            var mapChart = echarts.init(document.getElementById("provinceMap"),"shine");
            mapChart.setOption($scope.provinceMapOption, true);
            mapChart.on("click", function (event) {
                $scope.toProvince(event)


            });

            $scope.toProvince = function (event) {
                moveTab(event);
                event.event.event.cancelBubble = false;
                event.event.event.stopPropagation();

            };

            function moveTab(event) {

                $scope.style02 = {
                    left: event.event.event.layerX + "px",
                    top: (event.event.event.layerY) + "px",
                    display: "block"};
                $scope.style03 = {
                    left: (event.event.event.layerX + 99) + "px",
                    top: (event.event.event.layerY + 1) + "px",
                    display: "block"
                };
                $scope.style01 = {
                    left: (event.event.event.layerX + 80) + "px",
                    top: (event.event.event.layerY + 20) + "px",
                    display: "block"
                };
                $scope.newData = event;


                $scope.goMap = function () {
                    $state.transitionTo("qs100.scscCityDetail", {city: angular.toJson(event.name)});
                }
                $scope.$apply();
            }


            $http.get(basePath + "/qs/provinceDetailOfSeason.do?province=" + $scope.province)
                .success(function (response) {
                    $scope.resultArr = [];
                    if (response.state == 0) {
                        $scope.result = response.result;
                        angular.forEach($scope.result, function (item) {
                            $scope.resultArr.push({
                                "complexIndex": item["resultList"]["complexIndex"],
                                "stParkCount": item["resultList"]["stParkCount"],
                                "incubatorCount": item["resultList"]["incubatorCount"],
                                "incubatorArea": item["resultList"]["incubatorArea"],
                                "companyTotalCount": item["resultList"]["companyTotalCount"],
                                "totalInvestment": item["resultList"]["totalInvestment"],
                                "relatedNewsCount": item["resultList"]["relatedNewsCount"],
                                "investLastYear": item["resultList"]["investLastYear"],
                                "investThisYear": item["resultList"]["investThisYear"],
                                "investIncrease": item["resultList"]["investIncrease"],
                                "policyComparison": item["resultList"]["policyComparison"],
                                "name": item["resultList"]["name"],
                                "returnnessCount": item["resultList"]["returnnessCount"],
                                "yangtzeRiverScholarCount": item["resultList"]["yangtzeRiverScholarCount"],
                                "aboveMasterCount": item["resultList"]["aboveMasterCount"],
                                "aboveDoctorCount": item["resultList"]["aboveDoctorCount"],
                                "returnnessCount": item["resultList"]["returnnessCount"],
                                "roundAngelCount": item["resultList"]["roundAngelCount"],
                                "roundACount": item["resultList"]["roundACount"],
                                "roundBCount": item["resultList"]["roundBCount"],
                                "roundCCount": item["resultList"]["roundCCount"],
                                "ktaltentPlanCount": item["resultList"]["ktaltentPlanCount"],
                                "htaltentPlanCount": item["resultList"]["htaltentPlanCount"],

                            })
                        });
                    }

                    $scope.people = $scope.resultArr[11]["returnnessCount"] + $scope.resultArr[11]["yangtzeRiverScholarCount"] + $scope.resultArr[11]["aboveMasterCount"] + $scope.resultArr[11]["aboveDoctorCount"];

                    $scope.provinceSummaryOption = {
                        title: {
                            //text: '清数对比',
                            textStyle: {
                                color: '#ffffff'
                            }

                        },
                        //color: '#B5C334',
                        tooltip: {
                            trigger: 'axis'
                        },
                        legend: {
                            orient: 'vertical',
                            x: 'right',
                            y: 'bottom',
                            textStyle: {
                                color: "white"
                            },
                            data: ['本地指数', "全国均值"]
                        },
                        toolbox: {
                            show: false
                        },
                        polar: [
                            {
                                indicator: [
                                    {text: '孵化园', max: $scope.resultArr[11]["stParkCount"]},
                                    {text: '孵化器', max: $scope.resultArr[11]["incubatorCount"]},
                                    {text: '孵化面积', max: $scope.resultArr[11]["incubatorArea"]},
                                    {text: '累计金额', max: $scope.resultArr[11]["totalInvestment"]},
                                    {text: '人才', max: $scope.people},
                                    {text: '舆论', max: 100}
                                ],
                                name: {
                                    formatter: '{value}',
                                    textStyle: {color: 'white'}
                                }
                            }
                        ],
                        calculable: true,
                        series: [
                            {
                                name: '清数概况',
                                type: 'radar',
                                lineStyle:{
                                    normal:{
                                        //color:"red"
                                    }
                                },
                                data: [
                                    {
                                        //value: [4300, 10000, 28000, 35000, 50000, 19000],
                                        value: [$scope.resultArr[11]["stParkCount"], $scope.resultArr[11]["incubatorCount"], $scope.resultArr[11]["incubatorArea"], $scope.resultArr[11]["totalInvestment"], $scope.people, 60],
                                        name: "本地指数"
                                    },
                                    {
                                        //value: [50, 140, 280, 310, 420, 70],
                                        value: [$scope.resultArr[11]["stParkCount"], $scope.resultArr[11]["incubatorCount"], $scope.resultArr[11]["incubatorArea"], $scope.resultArr[11]["totalInvestment"], $scope.people, 60],
                                        //value:[$scope.resultArr[11]["stParkCount"]+10,$scope.resultArr[11]["incubatorCount"]+10, $scope.resultArr[11]["incubatorArea"]+10, $scope.resultArr[11]["totalInvestment"]+10,$scope.people+10, 60+10],
                                        name: '全国均值'
                                    }
                                ]
                            }
                        ]
                    };

                    echarts.init(document.getElementById("provinceSummary")).setOption($scope.provinceSummaryOption, true);


                    $scope.v1LineOption = {
                        title: {
                            text: '清数指数',
                            textStyle: {
                                color: "white"
                            }
                        },
                        tooltip: {
                            trigger: 'axis'
                        },
                        legend: {
                            data: ['近3年创新趋势'],
                            textStyle: {
                                color: "white"
                            }
                        },
                        grid: {
                            left: '3%',
                            right: '4%',
                            bottom: '3%',
                            containLabel: true
                        },
                        xAxis: {
                            type: 'category',
                            boundaryGap: false,
                            splitLine: {show: false},
                            axisLabel: {
                                textStyle: {
                                    color: "#fff"
                                }
                            },
                            data: ["2013第二季度", "2013第三季度", "2013第四季度", "2014第一季度", "2014第二季度", "2014第三季度", "2014第四季度", "2015第一季度", "2015第二季度", "2015第三季度", "2015第四季度", "2016第一季度"]
                        },
                        yAxis: {
                            type: 'value',
                            splitLine: {show: false},
                            axisLabel: {
                                textStyle: {
                                    color: "#fff"
                                }
                            }
                        },
                        series: [
                            {
                                name: '近3年创新趋势',
                                type: 'line',
                                stack: '数量',
                                data: [$scope.resultArr[0]["complexIndex"], $scope.resultArr[1]["complexIndex"], $scope.resultArr[2]["complexIndex"], $scope.resultArr[3]["complexIndex"], $scope.resultArr[4]["complexIndex"], $scope.resultArr[5]["complexIndex"], $scope.resultArr[6]["complexIndex"], $scope.resultArr[7]["complexIndex"], $scope.resultArr[8]["complexIndex"], $scope.resultArr[9]["complexIndex"], $scope.resultArr[10]["complexIndex"], $scope.resultArr[11]["complexIndex"]]
                            }
                        ],
                        textStyle: {
                            color: "#fff"
                        }
                    };



                    $scope.v3BarOption = {
                        title: {
                            text: '投资额度',
                            textStyle: {
                                color: "white"
                            }

                        },
                        tooltip: {
                            trigger: 'axis'
                        },
                        legend: {
                            data: ["总额度"],
                            textStyle: {
                                color: "white"
                            }
                        },
                        calculable: true,
                        xAxis: [
                            {
                                type: 'category',
                                splitLine: {show: false},
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                data: ["2013第二季度", "2013第三季度", "2013第四季度", "2014第一季度", "2014第二季度", "2014第三季度", "2014第四季度", "2015第一季度", "2015第二季度", "2015第三季度", "2015第四季度", "2016第一季度"]
                            }
                        ],
                        yAxis: [
                            {
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                splitLine: {show: false},
                                type: 'value'
                            }
                        ],
                        series: [
                            {
                                name: '总额度',
                                type: 'bar',
                                data: [$scope.resultArr[0]["totalInvestment"], $scope.resultArr[1]["totalInvestment"], $scope.resultArr[2]["totalInvestment"], $scope.resultArr[3]["totalInvestment"], $scope.resultArr[4]["totalInvestment"], $scope.resultArr[5]["totalInvestment"], $scope.resultArr[6]["totalInvestment"],
                                    $scope.resultArr[7]["totalInvestment"], $scope.resultArr[8]["totalInvestment"], $scope.resultArr[9]["totalInvestment"], $scope.resultArr[10]["totalInvestment"], $scope.resultArr[11]["totalInvestment"]],
                                markPoint: {
                                    data: [
                                        {type: 'max', name: '最大值'},
                                        {type: 'min', name: '最小值'}
                                    ]
                                },
                                markLine: {
                                    data: [
                                        {type: 'average', name: '平均值'}
                                    ]
                                }
                            },
                        ]
                    };

                    $scope.v4BarOption = {
                        title: {
                            text: '科技园总数',
                            textStyle: {
                                color: "white"
                            }

                            //sublink: 'http://e.weibo.com/1341556070/AizJXrAEa'
                        },
                        tooltip: {
                            trigger: 'axis',
                            axisPointer: {            // 坐标轴指示器，坐标轴触发有效
                                type: 'shadow'        // 默认为直线，可选为：'line' | 'shadow'
                            },
                            formatter: function (params) {
                                return params[0].name + '<br/>'
                                    + params[0].seriesName + ' : ' + params[0].value + '<br/>';
                            }
                        },
                        legend: {
                            selectedMode: false,
                            data: ["个数"],
                            textStyle: {
                                color: "white"
                            }
                        },
                        toolbox: {
                            show: false,
                            feature: {
                                mark: {show: true},
                                dataView: {show: true, readOnly: false},
                                restore: {show: true},
                                saveAsImage: {show: true}
                            }
                        },
                        calculable: true,
                        xAxis: [
                            {
                                type: 'category',
                                splitLine: {show: false},
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                data: ["2013第二季度", "2013第三季度", "2013第四季度", "2014第一季度", "2014第二季度", "2014第三季度", "2014第四季度", "2015第一季度", "2015第二季度", "2015第三季度", "2015第四季度", "2016第一季度"]
                            }
                        ],
                        yAxis: [
                            {
                                type: 'value',
                                splitLine: {show: false},
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                boundaryGap: [0, 0.1]
                            }
                        ],
                        series: [
                            {
                                name: 'Acutal',
                                type: 'bar',
                                stack: 'sum',
                                barCategoryGap: '50%',
                                itemStyle: {
                                    normal: {
                                        color: 'tomato',
                                        barBorderColor: 'tomato',
                                        barBorderWidth: 6,
                                        barBorderRadius: 0,
                                        label: {
                                            show: true, position: 'insideTop'
                                        }
                                    }
                                },
                                data: [$scope.resultArr[0]["stParkCount"], $scope.resultArr[1]["stParkCount"], $scope.resultArr[2]["stParkCount"], $scope.resultArr[3]["stParkCount"], $scope.resultArr[4]["stParkCount"], $scope.resultArr[5]["stParkCount"], $scope.resultArr[6]["stParkCount"], $scope.resultArr[7]["stParkCount"], $scope.resultArr[8]["stParkCount"], $scope.resultArr[9]["stParkCount"], $scope.resultArr[10]["stParkCount"], $scope.resultArr[11]["stParkCount"]]
                            },

                        ]
                    };

                    $scope.v5BarOption = {
                        title: {
                            text: '总孵化器面积',
                            textStyle: {
                                color: "white"
                            }
                            //subtext: '纯属虚构'
                        },
                        tooltip: {
                            trigger: 'axis'
                        },
                        legend: {
                            data: ["面积"],
                            textStyle: {
                                color: "white"
                            }
                        },
                        toolbox: {
                            show: false,
                            feature: {
                                mark: {show: true},
                                dataView: {show: true, readOnly: false},
                                magicType: {show: true, type: ['line', 'bar']},
                                restore: {show: true},
                                saveAsImage: {show: true}
                            }
                        },
                        calculable: true,
                        xAxis: [
                            {
                                type: 'category',
                                splitLine: {show: false},
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                data: ["2013第二季度", "2013第三季度", "2013第四季度", "2014第一季度", "2014第二季度", "2014第三季度", "2014第四季度", "2015第一季度", "2015第二季度", "2015第三季度", "2015第四季度", "2016第一季度"]
                            }
                        ],
                        yAxis: [
                            {
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                splitLine: {show: false},
                                type: 'value'
                            }
                        ],
                        series: [
                            {
                                name: '面积',
                                type: 'bar',
                                data: [$scope.resultArr[0]["incubatorArea"], $scope.resultArr[1]["incubatorArea"], $scope.resultArr[2]["incubatorArea"], $scope.resultArr[3]["incubatorArea"], $scope.resultArr[4]["incubatorArea"], $scope.resultArr[5]["incubatorArea"], $scope.resultArr[6]["incubatorArea"], $scope.resultArr[7]["incubatorArea"], $scope.resultArr[8]["incubatorArea"], $scope.resultArr[9]["incubatorArea"], $scope.resultArr[10]["incubatorArea"], $scope.resultArr[11]["incubatorArea"]],
                                markPoint: {
                                    data: [
                                        {type: 'max', name: '最大值'},
                                        {type: 'min', name: '最小值'}
                                    ]
                                },
                                markLine: {
                                    data: [
                                        {type: 'average', name: '平均值'}
                                    ]
                                }
                            },
                        ]
                    };

                    $scope.v6AreaOption = {
                        title: {
                            text: '各轮企业数',
                            textStyle: {
                                color: "white"
                            }
                            //sublink: 'http://e.weibo.com/1341556070/AizJXrAEa'
                        },
                        tooltip: {
                            trigger: 'axis'
                        },
                        legend: {
                            data: ['天使轮', 'a轮', 'b轮', 'c轮'],
                            textStyle: {
                                color: "white"
                            }
                        },
                        toolbox: {
                            show: false,
                            feature: {
                                mark: {show: true},
                                dataView: {show: true, readOnly: false},
                                magicType: {show: true, type: ['line', 'bar', 'stack', 'tiled']},
                                restore: {show: true},
                                saveAsImage: {show: true}
                            }
                        },
                        calculable: true,
                        xAxis: [
                            {
                                type: 'category',
                                boundaryGap: false,
                                splitLine: {show: false},
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                data: ["2013第二季度", "2013第三季度", "2013第四季度", "2014第一季度", "2014第二季度", "2014第三季度", "2014第四季度", "2015第一季度", "2015第二季度", "2015第三季度", "2015第四季度", "2016第一季度"]

                            }
                        ],
                        yAxis: [
                            {
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                splitLine: {show: false},
                                type: 'value'
                            }
                        ],
                        series: [
                            {
                                name: '天使轮',
                                type: 'line',
                                stack: '总量',

                                itemStyle: {normal: {areaStyle: {type: 'default'}}},
                                data: [$scope.resultArr[0]["roundAngelCount"], $scope.resultArr[1]["roundAngelCount"], $scope.resultArr[2]["roundAngelCount"], $scope.resultArr[3]["roundAngelCount"], $scope.resultArr[4]["roundAngelCount"], $scope.resultArr[5]["roundAngelCount"], $scope.resultArr[6]["roundAngelCount"],
                                    $scope.resultArr[7]["roundAngelCount"], $scope.resultArr[8]["roundAngelCount"], $scope.resultArr[9]["roundAngelCount"], $scope.resultArr[10]["roundAngelCount"], $scope.resultArr[11]["roundAngelCount"]],

                            },
                            {
                                name: 'A轮',
                                type: 'line',
                                stack: '总量',
                                itemStyle: {normal: {areaStyle: {type: 'default'}}},
                                data: [$scope.resultArr[0]["roundAngelCount"], $scope.resultArr[1]["roundAngelCount"], $scope.resultArr[2]["roundAngelCount"], $scope.resultArr[3]["roundAngelCount"], $scope.resultArr[4]["roundAngelCount"], $scope.resultArr[5]["roundAngelCount"], $scope.resultArr[6]["roundAngelCount"],
                                    $scope.resultArr[7]["roundAngelCount"], $scope.resultArr[8]["roundAngelCount"], $scope.resultArr[9]["roundAngelCount"], $scope.resultArr[10]["roundAngelCount"], $scope.resultArr[11]["roundAngelCount"]],

                            },
                            {
                                name: 'b轮',
                                type: 'line',
                                stack: '总量',
                                itemStyle: {normal: {areaStyle: {type: 'default'}}},
                                data: [$scope.resultArr[0]["roundBCount"], $scope.resultArr[1]["roundBCount"], $scope.resultArr[2]["roundBCount"], $scope.resultArr[3]["roundBCount"], $scope.resultArr[4]["roundBCount"], $scope.resultArr[5]["roundBCount"], $scope.resultArr[6]["roundBCount"],
                                    $scope.resultArr[7]["roundBCount"], $scope.resultArr[8]["roundBCount"], $scope.resultArr[9]["roundBCount"], $scope.resultArr[10]["roundBCount"], $scope.resultArr[11]["roundBCount"]],

                            },
                            {
                                name: 'c轮',
                                type: 'line',
                                stack: '总量',
                                itemStyle: {normal: {areaStyle: {type: 'default'}}},
                                data: [$scope.resultArr[0]["roundCCount"], $scope.resultArr[1]["roundCCount"], $scope.resultArr[2]["roundCCount"], $scope.resultArr[3]["roundCCount"], $scope.resultArr[4]["roundCCount"], $scope.resultArr[5]["roundCCount"], $scope.resultArr[6]["roundCCount"],
                                    $scope.resultArr[7]["roundCCount"], $scope.resultArr[8]["roundCCount"], $scope.resultArr[9]["roundCCount"], $scope.resultArr[10]["roundCCount"], $scope.resultArr[11]["roundCCount"]],

                            },

                        ]
                    };

                    $scope.v10BarOption = {
                        title: {
                            text: '孵化器总数',
                            textStyle: {
                                color: "white"
                            },
                            subtext: 'From ExcelHome'
                            //sublink: 'http://e.weibo.com/1341556070/AizJXrAEa'
                        },
                        tooltip: {
                            trigger: 'axis',
                            axisPointer: {            // 坐标轴指示器，坐标轴触发有效
                                type: 'shadow'        // 默认为直线，可选为：'line' | 'shadow'
                            },
                            formatter: function (params) {
                                return params[0].name + '<br/>'
                                    + params[0].seriesName + ' : ' + params[0].value + '<br/>';
                            }
                        },
                        legend: {
                            selectedMode: false,
                            data: ["个数"],
                            textStyle: {
                                color: "white"
                            }
                        },
                        toolbox: {
                            show: false,
                            feature: {
                                mark: {show: true},
                                dataView: {show: true, readOnly: false},
                                restore: {show: true},
                                saveAsImage: {show: true}
                            }
                        },
                        calculable: true,
                        xAxis: [
                            {
                                type: 'category',
                                splitLine: {show: false},
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                data: ["2013第二季度", "2013第三季度", "2013第四季度", "2014第一季度", "2014第二季度", "2014第三季度", "2014第四季度", "2015第一季度", "2015第二季度", "2015第三季度", "2015第四季度", "2016第一季度"]
                            }
                        ],
                        yAxis: [
                            {
                                type: 'value',
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                splitLine: {show: false},
                                boundaryGap: [0, 0.1]
                            }
                        ],
                        series: [
                            {
                                name: 'Acutal',
                                type: 'bar',
                                stack: 'sum',
                                barCategoryGap: '50%',
                                itemStyle: {
                                    normal: {
                                        color: 'tomato',
                                        barBorderColor: 'tomato',
                                        barBorderWidth: 6,
                                        barBorderRadius: 0,
                                        label: {
                                            show: true, position: 'insideTop'
                                        }
                                    }
                                },
                                data: [$scope.resultArr[0]["incubatorCount"], $scope.resultArr[1]["incubatorCount"], $scope.resultArr[2]["incubatorCount"], $scope.resultArr[3]["incubatorCount"], $scope.resultArr[4]["incubatorCount"], $scope.resultArr[5]["incubatorCount"], $scope.resultArr[6]["incubatorCount"], $scope.resultArr[7]["incubatorCount"], $scope.resultArr[8]["incubatorCount"], $scope.resultArr[9]["incubatorCount"], $scope.resultArr[10]["incubatorCount"], $scope.resultArr[11]["incubatorCount"]]
                            },

                        ]
                    };

                    $scope.v8funnelOption = {
                        title: {
                            text: '人才比例图',
                            textStyle: {
                                color: "white"
                            }
                            //subtext: '纯属虚构'
                        },
                        tooltip: {
                            trigger: 'item',
                            formatter: "{a} <br/>{b} : {c}%"
                        },
                        toolbox: {
                            show: false,
                            feature: {
                                mark: {show: true},
                                dataView: {show: true, readOnly: false},
                                restore: {show: true},
                                saveAsImage: {show: true}
                            }
                        },
                        legend: {
                            data: ['海归学者', '长江学者', '硕士学位人才', '博士学位人才'],
                            y: 'bottom',
                            textStyle: {
                                color: "white"
                            }
                        },
                        calculable: true,
                        series: [
                            {
                                name: '人才比例图',
                                type: 'funnel',
                                width: '50%',
                                data: [
                                    {value: $scope.resultArr[11]["returnnessCount"], name: '海归学者'},
                                    {value: $scope.resultArr[11]["yangtzeRiverScholarCount"], name: '长江学者'},
                                    {value: $scope.resultArr[11]["aboveMasterCount"], name: "硕士学位人才"},
                                    {value: $scope.resultArr[11]["aboveDoctorCount"], name: '博士学位人才'}
                                ]
                            }

                        ]
                    };


                    echarts.init(document.getElementById("v1")).setOption($scope.v1LineOption);
                    echarts.init(document.getElementById("v3")).setOption($scope.v3BarOption);
                    echarts.init(document.getElementById("v4")).setOption($scope.v4BarOption);
                    echarts.init(document.getElementById("v5")).setOption($scope.v5BarOption);
                    echarts.init(document.getElementById("v6")).setOption($scope.v6AreaOption);
                    echarts.init(document.getElementById("v8")).setOption($scope.v8funnelOption);
                    echarts.init(document.getElementById("v10")).setOption($scope.v10BarOption);

                });


            var labelRight = {normal: {label: {position: 'right'}}};

            $http.get(basePath+"/qs/AllIndustryCompanyCount.do?province="+$scope.province)
                .success(function(response){
                    $scope.industryCompanyCount;
                    if(response.state==0){
                        $scope.industryCompanyCount = response.result;
                    }

                    $scope.v2PieOption = {
                        title: {
                            x:"center",
                            text: '行业比例',
                            textStyle: {
                                color: '#ffffff'
                            }
                        },
                        tooltip: {
                            trigger: 'item',
                            formatter: "{a} <br/>{b} : {c} ({d}%)"
                        },
                        legend: {
                            orient: 'vertical',
                            x: 'left',
                            textStyle: {
                                color: "white"
                            },
                            data: ['互联网', '旅游', '广告', '金融', '医疗', '游戏', '文娱', '教育', '房地产', '电商', '车辆']
                        },
                        toolbox: {
                            show: false,
                            feature: {
                                mark: {show: true},
                                dataView: {show: true, readOnly: false},
                                magicType: {
                                    show: true,
                                    type: ['pie', 'funnel'],
                                    option: {
                                        funnel: {
                                            x: '25%',
                                            width: '50%',
                                            funnelAlign: 'left',
                                            max: 1548
                                        }
                                    }
                                },
                                restore: {show: true},
                                saveAsImage: {show: true}
                            }
                        },
                        calculable: true,
                        series: [
                            {
                                name: '行业占比',
                                type: 'pie',
                                radius: '55%',
                                center: ['50%', '60%'],
                                data: [
                                    {value: $scope.industryCompanyCount["internetCount"], name: '互联网'},
                                    {value: $scope.industryCompanyCount["medicalCount"], name: '医疗'},
                                    {value: $scope.industryCompanyCount["tourismCount"], name: '旅游'},
                                    {value: $scope.industryCompanyCount["financeCount"], name: '金融'},
                                    {value: $scope.industryCompanyCount["adCount"], name: '广告'},
                                    {value: $scope.industryCompanyCount["gameCount"], name: '游戏'},
                                    {value: $scope.industryCompanyCount["cultureCount"], name: '文化'},
                                    {value: $scope.industryCompanyCount["ecommerceCount"], name: '电商'},
                                    {value: $scope.industryCompanyCount["educationCount"], name: '教育'},
                                    {value: $scope.industryCompanyCount["estateCount"], name: '房地产'},
                                    {value: $scope.industryCompanyCount["vehicleCount"], name: '车辆'}
                                ]
                            }
                        ]
                    };
                    echarts.init(document.getElementById("v2")).setOption($scope.v2PieOption);


                })

            $http.get(basePath + "/qs/InvestOfProvinceByIndustryOfSeason.do?province=" + $scope.province)
                .success(function (response) {
                    $scope.investInfo;
                    if (response.state == 0) {
                        $scope.investInfo = response.result;

                    }

                    $scope.v7PieOption = {
                        title: {
                            text: '行业投资比例图',
                            textStyle: {
                                color: "white"
                            },
                            x: 'center'
                        },
                        tooltip: {
                            trigger: 'item',
                            formatter: "{a} <br/>{b} : {c} ({d}%)"
                        },
                        legend: {
                            orient: 'vertical',
                            x: 'left',
                            data: ['互联网', '旅游', '广告', '金融', '医疗', '游戏', '文娱', '教育', '房地产', '电商', '车辆'],
                            textStyle: {
                                color: "white"
                            }
                        },
                        toolbox: {
                            show: false,
                            feature: {
                                mark: {show: true},
                                dataView: {show: true, readOnly: false},
                                magicType: {
                                    show: true,
                                    type: ['pie', 'funnel'],
                                    option: {
                                        funnel: {
                                            x: '25%',
                                            width: '50%',
                                            funnelAlign: 'left',
                                            max: 1548
                                        }
                                    }
                                },
                                restore: {show: true},
                                saveAsImage: {show: true}
                            }
                        },
                        calculable: true,
                        series: [
                            {
                                name: '访问来源',
                                type: 'pie',
                                radius: '55%',
                                center: ['50%', '60%'],
                                data: [
                                    {value: $scope.investInfo["internetInvest"], name: '互联网'},
                                    {value: $scope.investInfo["medicalInvest"], name: '医疗'},
                                    {value: $scope.investInfo["tourismInvest"], name: '旅游'},
                                    {value: $scope.investInfo["financeInvest"], name: '金融'},
                                    {value: $scope.investInfo["adInvest"], name: '广告'},
                                    {value: $scope.investInfo["gameInvest"], name: '游戏'},
                                    {value: $scope.investInfo["cultureInvest"], name: '文娱'},
                                    {value: $scope.investInfo["ecommerceInvest"], name: '电商'},
                                    {value: $scope.investInfo["educationInvest"], name: '教育'},
                                    {value: $scope.investInfo["estateInvest"], name: '房地产'},
                                    {value: $scope.investInfo["vehicleInvest"], name: '车辆'}

                                ]
                            }
                        ]
                    };

                    $scope.v9BarOption = {
                        title: {
                            text: '行业投资旋风条形图',
                            textStyle: {
                                color: "white"
                            }

                        },
                        tooltip: {
                            trigger: 'axis',
                            axisPointer: {            // 坐标轴指示器，坐标轴触发有效
                                type: 'shadow'        // 默认为直线，可选为：'line' | 'shadow'
                            }
                        },
                        toolbox: {
                            show: false,
                            feature: {
                                mark: {show: true},
                                dataView: {show: true, readOnly: false},
                                magicType: {show: true, type: ['line', 'bar']},
                                restore: {show: true},
                                saveAsImage: {show: true}
                            }
                        },
                        grid: {
                            y: 80,
                            y2: 30
                        },
                        xAxis: [
                            {
                                type: 'value',
                                axisLabel: {
                                    textStyle: {
                                        color: "#fff"
                                    }
                                },
                                position: 'top',
                                splitLine: {show: false},
                            }
                        ],
                        yAxis: [
                            {
                                type: 'category',
                                axisLine: {show: false},
                                axisLabel: {show: false},
                                axisTick: {show: false},
                                splitLine: {show: false},
                                data: ['互联网', '旅游', '广告', '金融', '医疗', '游戏', '文娱', '教育', '房地产', '电商', '车辆']
                            }
                        ],
                        series: [
                            {
                                name: '总量',
                                type: 'bar',
                                stack: '总量',
                                itemStyle: {
                                    normal: {
                                        color: 'orange',
                                        borderRadius: 5,
                                        label: {
                                            show: true,
                                            position: 'left',
                                            formatter: '{b}'
                                        }
                                    }
                                },
                                data: [
                                    $scope.investInfo["internetInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["tourismInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["adInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["financeInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["medicalInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["gameInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["cultureInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["educationInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["estateInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["ecommerceInvest"] - $scope.investInfo["averageValue"],
                                    $scope.investInfo["vehicleInvest"] - $scope.investInfo["averageValue"]
                                ]

                            }
                        ]
                    };

                    echarts.init(document.getElementById("v7")).setOption($scope.v7PieOption);
                    echarts.init(document.getElementById("v9")).setOption($scope.v9BarOption);

                });

        }])
;
qsDataAnalysisApp.controller("scscProvinceIndustryCompanycountTimelineController",
    ["$scope","$rootScope", "$location", "$state", "$http", "$stateParams", "GotoService", "ComparisonManage",
        function ($scope,$rootScope, $location, $state, $http, $stateParams, GotoService, ComparisonManage){
    $rootScope.bigTitle="行业企业数量分布图";



    var functionMap = {};

    // second chart
    var myChart20;
    var myChart21;
    var myChart22;
    var myChart23;
    var myChart24;
    var myChart25;
    functionMap.chart2 = function (idx) {
        functionMap.chart2dispose(idx);
        //var ec = require('echarts');
        var ec = echarts;
        myChart20 = ec.init(document.getElementById('g20'));
        myChart21 = ec.init(document.getElementById('g21'));
        myChart22 = ec.init(document.getElementById('g22'));
        myChart23 = ec.init(document.getElementById('g23'));
        myChart24 = ec.init(document.getElementById('g24'));
        myChart25 = ec.init(document.getElementById('g25'));


        myChart20.setOption(option2('Internet'));
        myChart21.setOption(option2('Financial'));
        myChart22.setOption(option2('Estate'));
        myChart23.setOption(option2('Education'));
        myChart24.setOption(option2('Culture'));
        myChart25.setOption(option2('Others'));
    }
    functionMap.chart2dispose = function () {
        if (myChart20) {
            myChart20.dispose();
            myChart21.dispose();
            myChart22.dispose();
            myChart23.dispose();
            myChart24.dispose();
            myChart25.dispose();
            myChart20 = false;
            myChart21 = false;
            myChart22 = false;
            myChart23 = false;
            myChart24 = false;
            myChart25 = false;
        }
    }

    function showTabContent(idx) {
        functionMap['chart' + idx](idx);
    }

    showTabContent(2);

}]);
qsDataAnalysisApp.controller("scscProvinceIndustryInvestmentTotalTimelineController",
    ["$scope","$rootScope", "$location", "$state", "$http", "$stateParams", "GotoService", "ComparisonManage",
        function ($scope,$rootScope, $location, $state, $http, $stateParams, GotoService, ComparisonManage) {

    $rootScope.bigTitle="企业数量及投资额度变化";


    $http.get(basePath+"/qs/IndustryDetailOfSeason.do")
            .success(function(response) {

            $scope.resultIndustry = [];
            $scope.seasonList = [];
            $scope.timelineList = [];
            var industry = ["Internet","Medical","Tourism","Finance","Ad","Game","Culture","Ecommerce","Education","Estate","Vehicle"]

            if (response.state == 0) {
                $scope.resultIndustry = response.result;
                angular.forEach($scope.resultIndustry,function(item){
                    $scope.resultItem=[];
                    angular.forEach(item.resultList,function(res){
                        $scope.resultItem.push([res.investTotalSum,res.companyCount,res.stuffCount,res.name,item.seasonName])
                    })
                    $scope.seasonList.push($scope.resultItem);
                    $scope.timelineList.push(item.seasonName);
                });

                $scope.scatterOption=[];

                var itemStyle = {
                    normal: {
                        opacity: 0.8,
                        shadowBlur: 10,
                        shadowOffsetX: 0,
                        shadowOffsetY: 0
                    }
                };

                var sizeFunction = function (x) {
                    var y = Math.sqrt(x / 5e8) + 0.1;
                    return y * 400;
                };
                // Schema:
                var schema = [
                    {name: 'investTotalSum', index: 0, text: '企业投资额度', unit: '美元'},
                    {name: 'companyCount', index: 1, text: '公司人数', unit: '个'},
                    {name: 'stuffCount', index: 2, text: '员工个数', unit: '个'},
                    {name: 'industryName', index: 3, text: '行业名称', unit: ''}

                ];

                $scope.scatterOption = {
                    baseOption: {
                        timeline: {
                            axisType: 'category',
                            orient: 'vertical',
                            autoPlay: true,
                            inverse: true,
                            playInterval: 1000,
                            left: "right",
                            right: "20%",
                            top: "10%",
                            bottom: "15%",
                            width: 120,
                            height: null,
                            label: {
                                normal: {
                                    textStyle: {
                                        color: '#fff'
                                    }
                                },
                                emphasis: {
                                    textStyle: {
                                        color: 'red'
                                    }
                                }
                            },
                            symbol: 'none',
                            lineStyle: {
                                color: '#555'
                            },
                            checkpointStyle: {
                                color: '#bbb',
                                borderColor: '#777',
                                borderWidth: 2
                            },
                            controlStyle: {
                                showNextBtn: false,
                                showPrevBtn: false,
                                normal: {
                                    color: '#666',
                                    borderColor: '#666'
                                },
                                emphasis: {
                                    color: '#aaa',
                                    borderColor: '#aaa'
                                }
                            },
                            data: []
                        },

                        title: {
                            'text': $scope.timelineList[0],
                            textAlign: 'center',
                            left: '63%',
                            top: '55%',
                            textStyle: {
                                fontSize: 80,
                                color: '#fff'
                            }
                        },
                        tooltip: {
                            padding: 5,
                            backgroundColor: '#222',
                            borderColor: '#777',
                            borderWidth: 1,
                            formatter: function (obj) {
                                var value = obj.value;
                                return schema[1].text + '：' + value[1] + schema[1].unit + '<br>'
                                    + schema[0].text + '：' + value[0] + schema[0].unit + '<br>'
                                    + schema[2].text + '：' + value[2] + schema[2].unit + '<br>'
                                    + schema[3].text + '：' + value[3] + schema[3].unit + '<br>'

                            }
                        },
                        grid: {
                            left: '12%',
                            right: '110'
                        },
                        xAxis: {
                            type: 'log',
                            name: '投资额度',
                            nameGap: 25,
                            nameLocation: 'middle',
                            nameTextStyle: {
                                color:"#fff",
                                fontSize: 30
                            },
                            splitLine: {
                                show: false
                            },
                            axisTick: {
                                lineStyle: {
                                    color: '#ccc'
                                }
                            },
                            axisLine: {
                                lineStyle: {
                                    color: '#ccc'
                                }
                            },
                            axisLabel: {
                                formatter: '{value}千万',
                                textStyle: {
                                    color: '#fff'
                                }
                            }
                        },
                        yAxis: {
                            type: 'value',
                            name: '企业个数',
                            nameTextStyle: {
                                color: '#ccc',
                                fontSize: 18
                            },
                            axisLine: {
                                lineStyle: {
                                    color: '#ccc'
                                }
                            },
                            axisTick: {
                                lineStyle: {
                                    color: '#ccc'
                                }
                            },
                            splitLine: {
                                show: false
                            },
                            axisLabel: {
                                formatter: '{value}千万',
                                textStyle: {
                                    color: '#fff'
                                }
                            }
                        },
                        visualMap: [
                            {
                                show: false,
                                dimension: 3,
                                categories: industry,
                                calculable: true,
                                precision: 0.1,
                                textGap: 30,
                                textStyle: {
                                    color: '#ccc'
                                },
                                inRange: {
                                    color: ['#bcd3bb', '#e88f70', '#edc1a5', '#9dc5c8', '#e1e8c8', '#7b7c68', '#e5b5b5', '#f0b489', '#928ea8', '#bda29a']
                                }
                            }
                        ],
                        series: [
                            {
                                type: 'scatter',
                                itemStyle: itemStyle,
                                data: $scope.seasonList[0],
                                symbolSize: function(val) {
                                    return sizeFunction(val[2]);
                                    console.log(val[2])
                                }
                            }
                        ],
                        animationDurationUpdate: 1000,
                        animationEasingUpdate: 'quinticInOut'
                    },
                    legend:{
                        data:industry
                    },
                    options: []
                };

                for (var n = 0; n < $scope.timelineList.length; n++) {
                    $scope.scatterOption.baseOption.timeline.data.push($scope.timelineList[n]);
                    $scope.scatterOption.options.push({
                            title: {
                                show: false,
                                'text': $scope.timelineList[n] + ''
                            },
                            series: {
                                name: $scope.timelineList[n],
                                type: 'scatter',
                                itemStyle: itemStyle,
                                data: $scope.seasonList[n],
                                symbolSize: function() {
                                    return sizeFunction(Math.random()*10+1);
                                }
                            }
                        });
                }

                echarts.init(document.getElementById("scatterChart")).setOption($scope.scatterOption);
            }
        })



    //$scope.scatterOption=[];
    //$.get('modules/sccs/data/invest.json', function (data) {
    //
    //
    //    var itemStyle = {
    //        normal: {
    //            opacity: 0.8,
    //            shadowBlur: 10,
    //            shadowOffsetX: 0,
    //            shadowOffsetY: 0,
    //            shadowColor: 'rgba(0, 0, 0, 0.5)'
    //        }
    //    };
    //
    //    var sizeFunction = function (x) {
    //        var y = Math.sqrt(x / 5e8) + 0.1;
    //        return y * 40;
    //    };
    //    // Schema:
    //    var schema = [
    //        {name: 'Income', index: 0, text: '企业投资额度', unit: '美元'},
    //        {name: 'LifeExpectancy', index: 1, text: '企业人数', unit: '个'}
    //    ];
    //
    //    $scope.scatterOption = {
    //        baseOption: {
    //            timeline: {
    //                axisType: 'category',
    //                orient: 'vertical',
    //                autoPlay: true,
    //                inverse: true,
    //                playInterval: 1000,
    //                left: null,
    //                right: 0,
    //                top: 20,
    //                bottom: 20,
    //                width: 55,
    //                height: null,
    //                label: {
    //                    normal: {
    //                        textStyle: {
    //                            color: '#999'
    //                        }
    //                    },
    //                    emphasis: {
    //                        textStyle: {
    //                            color: '#fff'
    //                        }
    //                    }
    //                },
    //                symbol: 'none',
    //                lineStyle: {
    //                    color: '#555'
    //                },
    //                checkpointStyle: {
    //                    color: '#bbb',
    //                    borderColor: '#777',
    //                    borderWidth: 2
    //                },
    //                controlStyle: {
    //                    showNextBtn: false,
    //                    showPrevBtn: false,
    //                    normal: {
    //                        color: '#666',
    //                        borderColor: '#666'
    //                    },
    //                    emphasis: {
    //                        color: '#aaa',
    //                        borderColor: '#aaa'
    //                    }
    //                },
    //                data: []
    //            },
    //            backgroundColor: '#333',
    //            title: {
    //                'text': data.timeline[0],
    //                textAlign: 'center',
    //                left: '63%',
    //                top: '55%',
    //                textStyle: {
    //                    fontSize: 100,
    //                    color: 'rgba(255, 255, 255, 0.7)'
    //                }
    //            },
    //            tooltip: {
    //                padding: 5,
    //                backgroundColor: '#222',
    //                borderColor: '#777',
    //                borderWidth: 1,
    //                formatter: function (obj) {
    //                    var value = obj.value;
    //                    return schema[1].text + '：' + value[1] + schema[1].unit + '<br>'
    //                        + schema[0].text + '：' + value[0] + schema[0].unit + '<br>'
    //
    //                }
    //            },
    //            grid: {
    //                left: '12%',
    //                right: '110'
    //            },
    //            xAxis: {
    //                type: 'log',
    //                name: '人均收入',
    //                max: 100000,
    //                min: 300,
    //                nameGap: 25,
    //                nameLocation: 'middle',
    //                nameTextStyle: {
    //                    fontSize: 18
    //                },
    //                splitLine: {
    //                    show: false
    //                },
    //                axisTick: {
    //                    lineStyle: {
    //                        color: '#ccc'
    //                    }
    //                },
    //                axisLine: {
    //                    lineStyle: {
    //                        color: '#ccc'
    //                    }
    //                },
    //                axisLabel: {
    //                    formatter: '{value} $',
    //                    textStyle: {
    //                        color: '#ccc'
    //                    }
    //                }
    //            },
    //            yAxis: {
    //                type: 'value',
    //                name: '平均寿命',
    //                max: 100,
    //                nameTextStyle: {
    //                    color: '#ccc',
    //                    fontSize: 18
    //                },
    //                axisLine: {
    //                    lineStyle: {
    //                        color: '#ccc'
    //                    }
    //                },
    //                axisTick: {
    //                    lineStyle: {
    //                        color: '#ccc'
    //                    }
    //                },
    //                splitLine: {
    //                    show: false
    //                },
    //                axisLabel: {
    //                    formatter: '{value} 岁',
    //                    textStyle: {
    //                        color: '#ccc'
    //                    }
    //                }
    //            },
    //            visualMap: [
    //                {
    //                    show: false,
    //                    dimension: 3,
    //                    categories: data.counties,
    //                    calculable: true,
    //                    precision: 0.1,
    //                    textGap: 30,
    //                    textStyle: {
    //                        color: '#ccc'
    //                    },
    //                    inRange: {
    //                        color: ['#bcd3bb', '#e88f70', '#edc1a5', '#9dc5c8', '#e1e8c8', '#7b7c68', '#e5b5b5', '#f0b489', '#928ea8', '#bda29a']
    //                    }
    //                }
    //            ],
    //            series: [
    //                {
    //                    type: 'scatter',
    //                    itemStyle: itemStyle,
    //                    data: data.series[0],
    //                    symbolSize: function(val) {
    //                        return sizeFunction(val[2]);
    //                    }
    //                }
    //            ],
    //            animationDurationUpdate: 1000,
    //            animationEasingUpdate: 'quinticInOut'
    //        },
    //        options: []
    //    };
    //
    //    for (var n = 0; n < data.timeline.length; n++) {
    //        $scope.scatterOption.baseOption.timeline.data.push(data.timeline[n]);
    //        $scope.scatterOption
    //            .options.push({
    //            title: {
    //                show: true,
    //                'text': data.timeline[n] + ''
    //            },
    //            series: {
    //                name: data.timeline[n],
    //                type: 'scatter',
    //                itemStyle: itemStyle,
    //                data: data.series[n],
    //                symbolSize: function(val) {
    //                    return sizeFunction(val[2]);
    //                }
    //            }
    //        });
    //    }
    //
    //    echarts.init(document.getElementById("scatterChart")).setOption($scope.scatterOption);
    //
    //});



}]);
qsDataAnalysisApp.controller("qsScscStParkDetailController",["$scope","$location","$state","$http","$stateParams","GotoService","ComparisonManage",function($scope,$location,$state,$http,$stateParams,GotoService,ComparisonManage){

    $scope.stPark = angular.fromJson($stateParams.stPark);
    console.log($scope.stPark);

    $scope.provinceIndexTrendOption = {
        title: {
            text: "科技园区:"+$scope.stPark,
            textStyle:{
                color:"#fff"
            }
        },
        tooltip: {
            trigger: 'axis'
        },
        legend: {
            data:['近3年创新趋势'],
            textStyle:{
                color:"#fff"
            }
        },
        grid: {
            left: '3%',
            right: '4%',
            bottom: '3%',
            containLabel: true
        },
        toolbox: {
            feature: {
                //saveAsImage: {}
            }
        },
        xAxis: {
            type: 'category',
            boundaryGap: false,
            axisLabel: {
                textStyle:{
                    color:"#fff"
                }
            },
            data: ['周一','周二','周三','周四','周五','周六','周日']
        },
        yAxis: {
            axisLabel: {
                textStyle:{
                    color:"#fff"
                }
            },
            type: 'value'
        },
        series: [
            {
                name:'近3年创新趋势',
                type:'line',
                stack: '数量',
                data:[120, 132, 101, 134, 90, 230, 210]
            }
        ]
    };

    $scope.stParkPageIncubatorOption={
        url:"/parkIncubatorDetail.do?stPark="+$scope.stPark,
        colDef:[
            {col:"name",displayName:"名称"},
            {col:"region",displayName:"地区"},
            {col:"city",displayName:"城市"},
            {col:"province",displayName:"省份"},
            {col:"nation",displayName:"国家"},
            {col:"link",displayName:"链接"},
            {col:"setupDate",displayName:"创立日期"}
        ],
        rowAction:{
            addToComparison:function(item){
                ComparisonManage.addIncubator(item);
            },
            enterDetail:function(item){
                GotoService.gotoIncubator(item);
            }
        }
    };



    $scope.companyValueArr = [];
    $http.get(basePath+"/parkCompanyDetail.do?page=0&stPark="+$scope.stPark)
        .success(function(response){
            angular.forEach(response,function(item){
                $scope.companyValueArr.push({"name":item["name"],"city":item["city"],"link":item["link"],
                    "nation":item["nation"],"setupDate":item["setupDate"],"region":item["region"],"province":item["province"],"incubator":item["incubator"]})
            });
        });



    $scope.stParkPageCompanyOption={
        url:"/parkCompanyDetail.do?stPark="+$scope.stPark,
        colDef:[
            {col:"name",displayName:"名称"},
            {col:"region",displayName:"地区"},
            {col:"city",displayName:"城市"},
            {col:"province",displayName:"省份"},
            {col:"nation",displayName:"国家"},
            {col:"link",displayName:"链接"},
            {col:"incubator",displayName:"所属孵化器"},
            {col:"setupDate",displayName:"创立日期"}
        ],
        rowAction:{
            addToComparison:function(item){
                ComparisonManage.addCompany(item);
            },
            enterDetail:function(item){
                GotoService.gotoCompany(item)

            }
        }
    };

    //$scope.companyValueArr = [];

    echarts.init(document.getElementById("provinceIndexTrendDiv")).setOption($scope.provinceIndexTrendOption);



}]);